{
  "intelligence_roasts": [
    "You're so dense, light bends around you.",
    "Your brain is like a browser with 47 tabs open, 46 are frozen, and you can't find the music.",
    "You have the intellectual depth of a puddle in the Sahara.",
    "Your thought process is like a broken GPS - it takes forever and gets you nowhere.",
    "You're proof that evolution can go in reverse.",
    "Your mind is like a steel trap - rusty and illegal in 37 states.",
    "You think outside the box because you can't figure out how to get in it.",
    "Your brain cells are on a permanent vacation and forgot to send postcards.",
    "You're like a dictionary - you give meaning to everything except yourself.",
    "Your intelligence is like a fine wine - it doesn't exist.",
    "You have the cognitive abilities of a goldfish with amnesia.",
    "Your brain is like a computer from 1995 - slow, outdated, and makes weird noises.",
    "You're so slow, you make a sloth look like it's on espresso.",
    "Your thought process is like dial-up internet in the age of fiber optic.",
    "You have the mental agility of a brick wall.",
    "Your brain is like a smartphone with 1% battery - barely functional.",
    "You're like a broken calculator - you can't even do simple math.",
    "Your intelligence is like a solar panel at night - completely useless.",
    "You have the problem-solving skills of a hammer looking for a nail.",
    "Your mind is like a maze with no exit and no cheese.",
    "You're so confused, you get lost in your own thoughts.",
    "Your brain is like a library with all the books written in invisible ink.",
    "You have the attention span of a caffeinated squirrel.",
    "Your thought process is like a jigsaw puzzle missing half the pieces.",
    "You're like a GPS that only gives directions to nowhere.",
    "Your intelligence is like a candle in a hurricane - flickering and about to go out.",
    "You have the mental capacity of a teaspoon.",
    "Your brain is like a broken record player - it keeps skipping the important parts.",
    "You're so dense, you make black holes jealous.",
    "Your thought process is like a traffic jam in your head.",
    "You have the intellectual curiosity of a rock.",
    "Your brain is like a computer virus - it corrupts everything it touches.",
    "You're like a broken compass - you point in every direction except the right one.",
    "Your intelligence is like a mirage - it looks real from a distance but disappears up close.",
    "You have the reasoning skills of a magic 8-ball.",
    "Your mind is like a browser with no internet connection.",
    "You're so slow, you make molasses look speedy.",
    "Your brain is like a broken clock - right twice a day by pure accident.",
    "You have the cognitive function of a potato.",
    "Your thought process is like a washing machine on the fritz - lots of noise, no results.",
    "You're like a broken search engine - you can't find anything useful.",
    "Your intelligence is like a flashlight with dead batteries.",
    "You have the mental sharpness of a bowling ball.",
    "Your brain is like a smartphone with no apps - technically functional but completely useless.",
    "You're so confused, you need GPS to find your own thoughts.",
    "Your thought process is like a broken elevator - it doesn't go up.",
    "You have the intellectual depth of a kiddie pool.",
    "Your mind is like a computer running on Windows 95 - outdated and constantly crashing.",
    "You're like a broken pencil - pointless.",
    "Your intelligence is like a solar eclipse - rare, brief, and you shouldn't look directly at it."
  ],
  "appearance_roasts": [
    "You look like you were assembled by someone who lost the instruction manual.",
    "Your face could stop a clock and make time go backwards.",
    "You have a face for radio and a voice for silent films.",
    "You look like you fell out of the ugly tree and hit every branch on the way down.",
    "Your appearance is like a modern art piece - confusing and nobody understands it.",
    "You look like you were drawn by someone wearing oven mitts.",
    "Your face is like a work of abstract art - it's open to interpretation.",
    "You have the kind of face that makes onions cry.",
    "You look like you were put together by a committee with no artistic vision.",
    "Your appearance is like a broken mirror - it reflects poorly on everything.",
    "You look like you were designed by someone who hates symmetry.",
    "Your face is like a puzzle with pieces from different boxes.",
    "You have the aesthetic appeal of a traffic accident.",
    "You look like you were assembled during a power outage.",
    "Your appearance is like a rough draft that was never edited.",
    "You look like you were created by artificial intelligence having a bad day.",
    "Your face is like a GPS malfunction - it takes you to all the wrong places.",
    "You have the visual appeal of a broken television.",
    "You look like you were designed by someone who only works in abstract concepts.",
    "Your appearance is like a software glitch made manifest.",
    "You look like you were put together by someone reading instructions in a foreign language.",
    "Your face is like a modern sculpture - nobody knows what it's supposed to be.",
    "You have the aesthetic charm of a construction zone.",
    "You look like you were assembled by someone who was colorblind and working in the dark.",
    "Your appearance is like a rough sketch that someone forgot to finish.",
    "You look like you were created during a cosmic alignment gone wrong.",
    "Your face is like a broken compass - it points in all the wrong directions.",
    "You have the visual impact of a power outage.",
    "You look like you were designed by someone who specializes in abstract disappointment.",
    "Your appearance is like a prototype that never made it to production.",
    "You look like you were assembled by someone who was multitasking poorly.",
    "Your face is like a jigsaw puzzle missing the corner pieces.",
    "You have the aesthetic appeal of a broken kaleidoscope.",
    "You look like you were created by someone who misunderstood the assignment.",
    "Your appearance is like a rough draft written in disappearing ink.",
    "You look like you were designed by artificial intelligence having an existential crisis.",
    "Your face is like a map to nowhere interesting.",
    "You have the visual charm of a glitched video game character.",
    "You look like you were assembled by someone who was working from memory.",
    "Your appearance is like a modern art installation about confusion.",
    "You look like you were created during a creative block.",
    "Your face is like a broken algorithm trying to process beauty.",
    "You have the aesthetic appeal of a system error message.",
    "You look like you were designed by someone who only works in theoretical concepts.",
    "Your appearance is like a rough translation from another dimension.",
    "You look like you were assembled by someone who was improvising badly.",
    "Your face is like a GPS that only gives directions to disappointment.",
    "You have the visual impact of a buffering video.",
    "You look like you were created by someone who was working without a reference.",
    "Your appearance is like a prototype for something that was never meant to exist."
  ],
  "personality_roasts": [
    "Your personality has the warmth of a broken refrigerator.",
    "You have the charm of a parking ticket.",
    "Your personality is like a black hole - it sucks the joy out of everything.",
    "You have the social skills of a cactus in a balloon factory.",
    "Your personality is like a broken record - repetitive and annoying.",
    "You have the charisma of wet cardboard.",
    "Your personality is like a GPS with no signal - completely lost.",
    "You have the emotional range of a teaspoon.",
    "Your personality is like a broken elevator - it doesn't go up and makes everyone uncomfortable.",
    "You have the social grace of a bull in a china shop.",
    "Your personality is like a flat tire - deflated and going nowhere.",
    "You have the charm of a root canal.",
    "Your personality is like a broken clock - wrong most of the time.",
    "You have the warmth of a winter morning in Antarctica.",
    "Your personality is like a dead battery - no energy and completely useless.",
    "You have the social skills of a hermit crab with anxiety.",
    "Your personality is like a broken compass - it points in every direction except the right one.",
    "You have the charisma of a tax audit.",
    "Your personality is like a flat soda - no fizz and leaves a bad taste.",
    "You have the emotional depth of a puddle.",
    "Your personality is like a broken radio - lots of static and no clear signal.",
    "You have the social grace of a tornado in a trailer park.",
    "Your personality is like a dead phone - no connection and nobody wants to charge it.",
    "You have the charm of a dentist appointment.",
    "Your personality is like a broken mirror - it reflects poorly on everyone.",
    "You have the warmth of a frozen fish stick.",
    "Your personality is like a traffic jam - frustrating and going nowhere fast.",
    "You have the social skills of a mime having an existential crisis.",
    "Your personality is like a broken calculator - it doesn't add up.",
    "You have the charisma of a DMV waiting room.",
    "Your personality is like a flat balloon - deflated and disappointing.",
    "You have the emotional intelligence of a brick.",
    "Your personality is like a broken GPS - it gives directions to nowhere good.",
    "You have the social grace of a wrecking ball.",
    "Your personality is like a dead plant - no growth and needs to be replaced.",
    "You have the charm of a parking meter that only takes exact change.",
    "Your personality is like a broken thermostat - either too hot or too cold, never just right.",
    "You have the warmth of a morgue in winter.",
    "Your personality is like a flat tire on a road trip - it ruins everything.",
    "You have the social skills of a robot programmed by antisocial engineers.",
    "Your personality is like a broken alarm clock - annoying and unreliable.",
    "You have the charisma of a tax form.",
    "Your personality is like a dead end street - it leads nowhere interesting.",
    "You have the emotional range of a broken thermometer.",
    "Your personality is like a broken vending machine - it takes your money and gives you nothing.",
    "You have the social grace of a hurricane.",
    "Your personality is like a flat note in a symphony - it ruins the whole performance.",
    "You have the charm of a colonoscopy.",
    "Your personality is like a broken promise - disappointing and unreliable.",
    "You have the warmth of a broken heater in the middle of winter."
  ],
  "skill_roasts": [
    "Your skills are like a broken tool - they look functional but accomplish nothing.",
    "You have the competence of a chocolate teapot.",
    "Your abilities are like a GPS with no satellites - completely lost.",
    "You have the skill level of someone who learned everything from YouTube tutorials played at 0.25x speed.",
    "Your talents are like a broken calculator - they don't add up to anything useful.",
    "You have the expertise of a fish trying to climb a tree.",
    "Your skills are like a flat tire - they get you nowhere fast.",
    "You have the competence of a broken compass in a maze.",
    "Your abilities are like a dead battery - no power and completely useless.",
    "You have the skill level of someone who reads instruction manuals upside down.",
    "Your talents are like a broken clock - occasionally right by pure accident.",
    "You have the expertise of a penguin trying to fly.",
    "Your skills are like a broken elevator - they don't go up.",
    "You have the competence of a screen door on a submarine.",
    "Your abilities are like a broken radio - lots of noise, no clear signal.",
    "You have the skill level of someone who uses a hammer for everything.",
    "Your talents are like a flat soda - no fizz and disappointing.",
    "You have the expertise of a vegetarian at a barbecue competition.",
    "Your skills are like a broken thermostat - never quite right.",
    "You have the competence of a chocolate fireguard.",
    "Your abilities are like a GPS that only gives directions to dead ends.",
    "You have the skill level of someone who learned to drive from bumper cars.",
    "Your talents are like a broken mirror - they reflect poorly on everything.",
    "You have the expertise of a snowball in a furnace.",
    "Your skills are like a dead phone - no connection and nobody wants to use them.",
    "You have the competence of a paper umbrella in a hurricane.",
    "Your abilities are like a broken vending machine - they take effort and give nothing back.",
    "You have the skill level of someone who uses a fork to eat soup.",
    "Your talents are like a flat balloon - deflated and going nowhere.",
    "You have the expertise of a cactus in a petting zoo.",
    "Your skills are like a broken alarm clock - unreliable when you need them most.",
    "You have the competence of a chocolate teakettle.",
    "Your abilities are like a GPS with a dead battery - completely useless.",
    "You have the skill level of someone who learned to cook from watching cooking shows with the sound off.",
    "Your talents are like a broken pencil - pointless.",
    "You have the expertise of a fish out of water trying to give swimming lessons.",
    "Your skills are like a flat tire on a unicycle - they make everything harder.",
    "You have the competence of a solar panel at midnight.",
    "Your abilities are like a broken search engine - they can't find anything useful.",
    "You have the skill level of someone who uses a spoon to cut steak.",
    "Your talents are like a dead plant - no growth and need to be replaced.",
    "You have the expertise of a mime trying to give verbal instructions.",
    "Your skills are like a broken bridge - they don't connect anything useful.",
    "You have the competence of a waterproof towel.",
    "Your abilities are like a GPS that speaks only in ancient Latin.",
    "You have the skill level of someone who learned to type by pecking randomly at keys.",
    "Your talents are like a broken promise - they sound good but deliver nothing.",
    "You have the expertise of a submarine with screen doors.",
    "Your skills are like a flat note in a symphony - they ruin the whole performance.",
    "You have the competence of someone who uses a chainsaw to trim their fingernails."
  ],
  "gaming_roasts": [
    "You play games like you're allergic to winning.",
    "Your gaming skills are like a broken controller - they don't respond when needed.",
    "You have the hand-eye coordination of a blindfolded sloth.",
    "Your gaming abilities are like lag in real life - always behind and frustrating.",
    "You play like you're using a steering wheel to play a first-person shooter.",
    "Your skills are like a disconnected internet - you're always offline when it matters.",
    "You game like you're trying to set a world record for most creative failures.",
    "Your abilities are like a broken headset - no communication and lots of static.",
    "You play games like you're reading the controls in a foreign language.",
    "Your gaming skills are like a dead battery in the middle of a boss fight.",
    "You have the reaction time of a sedated turtle.",
    "Your abilities are like a glitched NPC - repetitive and unhelpful.",
    "You play like you're using a banana as a controller.",
    "Your gaming skills are like a corrupted save file - they don't work when you need them.",
    "You have the strategic thinking of a lemming heading for a cliff.",
    "Your abilities are like a broken graphics card - everything looks wrong.",
    "You play games like you're trying to prove that practice doesn't make perfect.",
    "Your gaming skills are like a lagging connection - always a step behind.",
    "You have the precision of a drunk surgeon playing Operation.",
    "Your abilities are like a broken microphone - lots of noise, no useful communication.",
    "You play like you're using voice commands to control a character that only understands sign language.",
    "Your gaming skills are like a crashed server - completely inaccessible.",
    "You have the teamwork abilities of a solo player in a multiplayer game.",
    "Your abilities are like a broken achievement system - they never unlock anything worthwhile.",
    "You play games like you're trying to speedrun in reverse.",
    "Your gaming skills are like a pixelated mess - unclear and hard to look at.",
    "You have the situational awareness of a mole wearing sunglasses underground.",
    "Your abilities are like a broken respawn system - you keep coming back but never improve.",
    "You play like you're using a flight simulator to drive a car.",
    "Your gaming skills are like a corrupted texture - they look wrong and make everything worse.",
    "You have the competitive spirit of a participation trophy.",
    "Your abilities are like a broken matchmaking system - they put you where you don't belong.",
    "You play games like you're trying to prove that button mashing is a legitimate strategy.",
    "Your gaming skills are like a disconnected controller - present but not functional.",
    "You have the learning curve of a flat line.",
    "Your abilities are like a broken tutorial - they teach you all the wrong things.",
    "You play like you're using a keyboard with half the keys missing.",
    "Your gaming skills are like a laggy stream - everyone can see you're struggling.",
    "You have the muscle memory of someone who just discovered they have muscles.",
    "Your abilities are like a broken leaderboard - they don't rank anywhere useful.",
    "You play games like you're trying to set a new standard for creative incompetence.",
    "Your gaming skills are like a glitched hitbox - they never connect when they should.",
    "You have the reflexes of a statue contemplating movement.",
    "Your abilities are like a broken DLC - they promise more but deliver disappointment.",
    "You play like you're using a dance pad to play chess.",
    "Your gaming skills are like a corrupted mod - they break everything they touch.",
    "You have the game sense of a goldfish playing 4D chess.",
    "Your abilities are like a broken patch - they fix nothing and create new problems.",
    "You play games like you're trying to prove that losing is an art form.",
    "Your gaming skills are like a disconnected headset - you can't hear what's going wrong, but everyone else can."
  ],
  "work_roasts": [
    "Your work ethic is like a broken clock - it's right twice a day by pure accident.",
    "You have the productivity of a sloth on sedatives.",
    "Your professional skills are like a GPS with no signal - completely lost.",
    "You work like you're allergic to success.",
    "Your career trajectory is like a paper airplane in a hurricane.",
    "You have the ambition of a rock with depression.",
    "Your work performance is like a broken elevator - it doesn't go up.",
    "You approach tasks like you're solving a puzzle with pieces from different boxes.",
    "Your professional abilities are like a dead battery - no energy and completely useless.",
    "You work like you're trying to set a world record for most creative procrastination.",
    "Your career progress is like a flat tire - going nowhere fast.",
    "You have the initiative of a statue waiting for inspiration.",
    "Your work ethic is like a broken compass - it points in every direction except forward.",
    "You approach deadlines like they're suggestions from a parallel universe.",
    "Your professional skills are like a corrupted file - they look like they should work but don't.",
    "You work like you're using a manual from a different century.",
    "Your career development is like a broken escalator - lots of effort, no elevation.",
    "You have the focus of a caffeinated squirrel in a nut factory.",
    "Your work performance is like a glitched video game - repetitive and frustrating.",
    "You approach projects like you're assembling furniture without instructions.",
    "Your professional abilities are like a broken calculator - they don't add up to anything useful.",
    "You work like you're trying to prove that effort is overrated.",
    "Your career path is like a maze designed by someone who hates solutions.",
    "You have the time management skills of a sundial in a cave.",
    "Your work ethic is like a broken promise - it sounds good but delivers nothing.",
    "You approach responsibilities like they're optional side quests.",
    "Your professional skills are like a flat soda - no fizz and disappointing.",
    "You work like you're using a hammer for every problem, including the ones that need a scalpel.",
    "Your career advancement is like a broken vending machine - you put in effort and get nothing back.",
    "You have the organizational skills of a tornado in a filing cabinet.",
    "Your work performance is like a broken radio - lots of static, no clear signal.",
    "You approach meetings like you're attending a foreign film without subtitles.",
    "Your professional abilities are like a GPS that only gives directions to dead ends.",
    "You work like you're trying to speedrun failure.",
    "Your career goals are like a mirage - they look real from a distance but disappear up close.",
    "You have the leadership skills of a sheep trying to herd cats.",
    "Your work ethic is like a broken thermostat - never quite right.",
    "You approach collaboration like you're playing a solo game in multiplayer mode.",
    "Your professional skills are like a broken search engine - they can't find anything useful.",
    "You work like you're using a map from a different planet.",
    "Your career strategy is like a paper boat in a storm.",
    "You have the problem-solving abilities of a hammer looking for a nail in a world full of screws.",
    "Your work performance is like a corrupted save file - it looks like progress but nothing actually works.",
    "You approach innovation like you're trying to reinvent the wheel using only triangles.",
    "Your professional abilities are like a broken bridge - they don't connect anything useful.",
    "You work like you're following a recipe written in invisible ink.",
    "Your career momentum is like a stopped clock - it's going nowhere but at least it's consistent.",
    "You have the networking skills of a hermit with social anxiety.",
    "Your work ethic is like a broken alarm clock - unreliable when you need it most.",
    "You approach success like it's a foreign concept that requires a translator."
  ],
  "social_roasts": [
    "Your social skills are like a broken phone - no connection and lots of static.",
    "You have the charisma of a DMV waiting room.",
    "Your conversation abilities are like a GPS with no signal - completely lost.",
    "You socialize like you're speaking a language only you understand.",
    "Your social presence is like a flat tire at a car show.",
    "You have the charm of a root canal appointment.",
    "Your social skills are like a broken elevator - they don't go up and make everyone uncomfortable.",
    "You interact with people like you're reading from a script written by aliens.",
    "Your social abilities are like a dead battery - no energy and completely useless.",
    "You have the conversational flow of a broken faucet.",
    "Your social skills are like a corrupted file - they look like they should work but don't.",
    "You socialize like you're trying to set a world record for most awkward moments.",
    "Your social presence is like a glitched video game character - repetitive and confusing.",
    "You have the networking abilities of a hermit crab with social anxiety.",
    "Your social skills are like a broken compass - they point in every direction except the right one.",
    "You interact with people like you're using a manual from a different species.",
    "Your social abilities are like a flat soda - no fizz and disappointing.",
    "You have the conversational skills of a mime having an existential crisis.",
    "Your social skills are like a broken radio - lots of noise, no clear signal.",
    "You socialize like you're trying to prove that small talk is a lost art.",
    "Your social presence is like a corrupted download - it never fully loads.",
    "You have the charm of a parking ticket on a windshield.",
    "Your social skills are like a GPS that only gives directions to awkward situations.",
    "You interact with people like you're playing charades with invisible props.",
    "Your social abilities are like a broken vending machine - you put in effort and get nothing back.",
    "You have the conversational timing of a broken metronome.",
    "Your social skills are like a flat balloon - deflated and going nowhere.",
    "You socialize like you're using Google Translate for a language that doesn't exist.",
    "Your social presence is like a broken mirror - it reflects poorly on everyone.",
    "You have the networking skills of a lighthouse in the desert.",
    "Your social skills are like a corrupted save file - they look like progress but nothing actually works.",
    "You interact with people like you're following a recipe for disaster.",
    "Your social abilities are like a broken calculator - they don't add up to meaningful connections.",
    "You have the conversational skills of a robot programmed by antisocial engineers.",
    "Your social skills are like a dead phone - no connection and nobody wants to charge it.",
    "You socialize like you're trying to speedrun social awkwardness.",
    "Your social presence is like a glitched NPC - repetitive responses and no real interaction.",
    "You have the charm of a tax audit notification.",
    "Your social skills are like a broken bridge - they don't connect anything useful.",
    "You interact with people like you're using a foreign language dictionary with half the pages missing.",
    "Your social abilities are like a flat tire on a road trip - they ruin the whole experience.",
    "You have the conversational flow of a traffic jam.",
    "Your social skills are like a broken thermostat - never quite right for the situation.",
    "You socialize like you're trying to prove that human connection is overrated.",
    "Your social presence is like a corrupted video file - it starts promising but quickly becomes unwatchable.",
    "You have the networking abilities of a submarine with screen doors.",
    "Your social skills are like a broken alarm clock - they go off at all the wrong times.",
    "You interact with people like you're playing a game where the objective is to make everyone uncomfortable.",
    "Your social abilities are like a GPS that speaks only in ancient Latin.",
    "You have the conversational skills of someone who learned social interaction from watching silent films."
  ],
  "general_roasts": [
    "You're like a human participation trophy - present but not particularly impressive.",
    "You have the life skills of a goldfish with amnesia.",
    "You're like a broken GPS - you take forever to get anywhere and usually end up lost.",
    "You have the common sense of a chocolate teapot.",
    "You're like a flat tire on the highway of life.",
    "You have the problem-solving abilities of a hammer in a world full of screws.",
    "You're like a broken calculator - you don't add up to much.",
    "You have the life trajectory of a paper airplane in a hurricane.",
    "You're like a corrupted file - you look like you should work but you don't.",
    "You have the effectiveness of a screen door on a submarine.",
    "You're like a broken clock - occasionally right by pure accident.",
    "You have the usefulness of a chocolate fireguard.",
    "You're like a flat soda - no fizz and disappointing.",
    "You have the reliability of a broken promise.",
    "You're like a GPS with no signal - completely lost.",
    "You have the impact of a whisper in a hurricane.",
    "You're like a broken elevator - you don't go up and you make everyone uncomfortable.",
    "You have the effectiveness of a waterproof towel.",
    "You're like a corrupted download - you never fully load.",
    "You have the usefulness of a solar panel at midnight.",
    "You're like a broken compass - you point in every direction except the right one.",
    "You have the reliability of a chocolate teakettle.",
    "You're like a flat balloon - deflated and going nowhere.",
    "You have the effectiveness of a paper umbrella in a hurricane.",
    "You're like a broken radio - lots of static, no clear signal.",
    "You have the usefulness of a submarine with screen doors.",
    "You're like a corrupted save file - you look like progress but nothing actually works.",
    "You have the reliability of a broken alarm clock.",
    "You're like a GPS that only gives directions to dead ends.",
    "You have the effectiveness of a broken bridge.",
    "You're like a flat tire on a unicycle - you make everything harder.",
    "You have the usefulness of a broken vending machine.",
    "You're like a corrupted video file - you start promising but quickly become unwatchable.",
    "You have the reliability of a broken thermostat.",
    "You're like a GPS that speaks only in ancient Latin.",
    "You have the effectiveness of a broken search engine.",
    "You're like a flat note in a symphony - you ruin the whole performance.",
    "You have the usefulness of a broken calculator.",
    "You're like a corrupted texture in a video game - you look wrong and make everything worse.",
    "You have the reliability of a broken promise.",
    "You're like a GPS with a dead battery - completely useless.",
    "You have the effectiveness of a broken mirror.",
    "You're like a flat tire on a road trip - you ruin everything.",
    "You have the usefulness of a broken pencil - pointless.",
    "You're like a corrupted mod - you break everything you touch.",
    "You have the reliability of a broken clock.",
    "You're like a GPS that only knows how to get lost.",
    "You have the effectiveness of a broken tool.",
    "You're like a flat balloon at a birthday party - disappointing and deflated.",
    "You have the usefulness of a broken key - you can't unlock anything worthwhile."
  ],
  "life_choices_roasts": [
    "Your life choices are like a GPS with no signal - completely lost and going nowhere.",
    "You make decisions like you're playing darts blindfolded in a hurricane.",
    "Your life path is like a broken compass - it points in every direction except the right one.",
    "You choose your direction in life like you're following a map drawn by someone who hates you.",
    "Your decision-making process is like a broken calculator - it doesn't add up to anything good.",
    "You navigate life like you're using a manual written in a language you don't understand.",
    "Your life choices are like a flat tire on the highway of existence.",
    "You make decisions like you're trying to solve a puzzle with pieces from different boxes.",
    "Your life direction is like a paper airplane in a tornado.",
    "You choose your path like you're following directions from a broken GPS.",
    "Your life choices are like a corrupted file - they look like they should work but they don't.",
    "You make decisions like you're playing chess with checkers pieces.",
    "Your life path is like a broken elevator - lots of effort, no elevation.",
    "You navigate existence like you're reading a map upside down in the dark.",
    "Your life choices are like a flat soda - no fizz and disappointing.",
    "You make decisions like you're using a magic 8-ball with all negative responses.",
    "Your life direction is like a broken bridge - it doesn't connect to anything useful.",
    "You choose your path like you're following a recipe for disaster.",
    "Your life choices are like a corrupted save file - they look like progress but nothing actually works.",
    "You make decisions like you're trying to speedrun failure.",
    "Your life path is like a GPS that only gives directions to dead ends.",
    "You navigate life like you're using a compass that only points to disappointment.",
    "Your life choices are like a broken thermostat - never quite right.",
    "You make decisions like you're playing a game where the objective is to lose.",
    "Your life direction is like a flat balloon - deflated and going nowhere.",
    "You choose your path like you're following a trail of breadcrumbs in a rainstorm.",
    "Your life choices are like a broken alarm clock - they go off at all the wrong times.",
    "You make decisions like you're using a dartboard where all the numbers are negative.",
    "Your life path is like a corrupted download - it never fully loads.",
    "You navigate existence like you're driving with a blindfold and broken steering wheel.",
    "Your life choices are like a GPS that speaks only in riddles.",
    "You make decisions like you're trying to prove that good judgment is overrated.",
    "Your life direction is like a broken escalator - lots of effort, no progress.",
    "You choose your path like you're following a map to nowhere.",
    "Your life choices are like a flat tire on a unicycle - they make everything harder.",
    "You make decisions like you're using a coin that always lands on the wrong side.",
    "Your life path is like a corrupted video game - glitchy and frustrating.",
    "You navigate life like you're using a broken search engine.",
    "Your life choices are like a GPS with a dead battery - completely useless.",
    "You make decisions like you're playing Russian roulette with a fully loaded gun.",
    "Your life direction is like a broken mirror - it reflects poorly on everything.",
    "You choose your path like you're following directions written by your worst enemy.",
    "Your life choices are like a flat note in the symphony of existence.",
    "You make decisions like you're trying to set a world record for poor judgment.",
    "Your life path is like a corrupted file that crashes every time you try to open it.",
    "You navigate existence like you're using a map from a parallel universe where everything is backwards.",
    "Your life choices are like a broken vending machine - you put in effort and get nothing back.",
    "You make decisions like you're playing a game where the rules change every time you're about to win.",
    "Your life direction is like a GPS that only knows how to get lost.",
    "You choose your path like you're following a trail that leads directly off a cliff."
  ],
  "technology_roasts": [
    "Your tech skills are like Internet Explorer - outdated and nobody wants to use them.",
    "You use technology like you're trying to operate a spaceship with a typewriter manual.",
    "Your digital abilities are like a dial-up connection in the age of fiber optic.",
    "You approach technology like you're allergic to progress.",
    "Your tech knowledge is like a floppy disk - obsolete and can't hold much.",
    "You use computers like you're trying to communicate with aliens using smoke signals.",
    "Your digital skills are like a broken WiFi connection - lots of attempts, no results.",
    "You approach technology like you're reading instructions written in hieroglyphics.",
    "Your tech abilities are like a corrupted hard drive - they look functional but nothing works.",
    "You use devices like you're trying to solve a Rubik's cube blindfolded.",
    "Your digital knowledge is like a 404 error - not found.",
    "You approach technology like you're trying to start a fire with wet matches.",
    "Your tech skills are like a frozen computer - unresponsive and frustrating.",
    "You use technology like you're playing a game where the objective is to break everything.",
    "Your digital abilities are like a dead battery - no power and completely useless.",
    "You approach tech like you're trying to use a smartphone as a hammer.",
    "Your tech knowledge is like a broken search engine - it can't find anything useful.",
    "You use computers like you're trying to perform surgery with oven mitts.",
    "Your digital skills are like a lagging video call - delayed and hard to understand.",
    "You approach technology like you're trying to drive a car using a TV remote.",
    "Your tech abilities are like a corrupted file - they look like they should work but don't.",
    "You use devices like you're trying to play a piano with boxing gloves.",
    "Your digital knowledge is like a broken GPS - it gives directions to nowhere.",
    "You approach technology like you're trying to paint a masterpiece with a mop.",
    "Your tech skills are like a glitched video game - repetitive and confusing.",
    "You use technology like you're trying to thread a needle while riding a roller coaster.",
    "Your digital abilities are like a disconnected internet - present but not functional.",
    "You approach tech like you're trying to write poetry with a calculator.",
    "Your tech knowledge is like a broken calculator - it doesn't add up to anything useful.",
    "You use computers like you're trying to perform brain surgery with a spoon.",
    "Your digital skills are like a pixelated image - unclear and hard to make sense of.",
    "You approach technology like you're trying to conduct an orchestra with a flyswatter.",
    "Your tech abilities are like a crashed server - completely inaccessible.",
    "You use devices like you're trying to bake a cake using only a screwdriver.",
    "Your digital knowledge is like a broken link - it doesn't lead anywhere useful.",
    "You approach technology like you're trying to build a house with only a rubber duck.",
    "Your tech skills are like a buffering video - they take forever and never fully load.",
    "You use technology like you're trying to perform magic tricks with broken props.",
    "Your digital abilities are like a corrupted download - they never complete successfully.",
    "You approach tech like you're trying to solve calculus using finger painting.",
    "Your tech knowledge is like a broken password - it doesn't unlock anything.",
    "You use computers like you're trying to perform a symphony using only a kazoo.",
    "Your digital skills are like a glitched NPC - repetitive responses and no real function.",
    "You approach technology like you're trying to navigate using a map from the 1800s.",
    "Your tech abilities are like a dead pixel - they're there but they don't contribute anything.",
    "You use devices like you're trying to perform dentistry with a chainsaw.",
    "Your digital knowledge is like a broken algorithm - it processes everything wrong.",
    "You approach technology like you're trying to cook a gourmet meal using only a lighter.",
    "Your tech skills are like a disconnected controller - present but not responsive.",
    "You use technology like you're trying to perform archaeology with a sledgehammer."
  ],
  "relationship_roasts": [
    "Your relationship skills are like a broken GPS - they lead everyone to the wrong destination.",
    "You approach love like you're trying to solve a puzzle with pieces from different boxes.",
    "Your romantic abilities are like a flat tire on the highway of love.",
    "You handle relationships like you're using a manual written in a language you don't understand.",
    "Your dating skills are like a corrupted file - they look like they should work but they don't.",
    "You approach romance like you're trying to dance with two left feet and no rhythm.",
    "Your relationship abilities are like a broken calculator - they don't add up to anything meaningful.",
    "You handle love like you're trying to perform surgery with oven mitts.",
    "Your romantic skills are like a GPS with no signal - completely lost.",
    "You approach relationships like you're playing a game where the objective is to lose.",
    "Your dating abilities are like a flat soda - no fizz and disappointing.",
    "You handle romance like you're trying to paint a masterpiece with a broken brush.",
    "Your relationship skills are like a corrupted save file - they look like progress but nothing actually works.",
    "You approach love like you're trying to build a house with only a rubber hammer.",
    "Your romantic abilities are like a broken elevator - they don't go up and make everyone uncomfortable.",
    "You handle relationships like you're following a recipe for disaster.",
    "Your dating skills are like a GPS that only gives directions to dead ends.",
    "You approach romance like you're trying to conduct an orchestra with a flyswatter.",
    "Your relationship abilities are like a flat balloon - deflated and going nowhere.",
    "You handle love like you're trying to thread a needle while riding a roller coaster.",
    "Your romantic skills are like a broken compass - they point in every direction except the right one.",
    "You approach relationships like you're using a map from a parallel universe.",
    "Your dating abilities are like a corrupted download - they never complete successfully.",
    "You handle romance like you're trying to perform magic tricks with broken props.",
    "Your relationship skills are like a glitched video game - repetitive and frustrating.",
    "You approach love like you're trying to solve calculus using finger painting.",
    "Your romantic abilities are like a broken bridge - they don't connect anything useful.",
    "You handle relationships like you're trying to bake a cake using only a screwdriver.",
    "Your dating skills are like a dead battery - no energy and completely useless.",
    "You approach romance like you're trying to write poetry with a calculator.",
    "Your relationship abilities are like a broken thermostat - never quite right for the situation.",
    "You handle love like you're trying to perform brain surgery with a spoon.",
    "Your romantic skills are like a GPS that speaks only in ancient Latin.",
    "You approach relationships like you're trying to drive a car using a TV remote.",
    "Your dating abilities are like a corrupted video file - they start promising but quickly become unwatchable.",
    "You handle romance like you're trying to play a piano with boxing gloves.",
    "Your relationship skills are like a broken search engine - they can't find anything worthwhile.",
    "You approach love like you're trying to perform dentistry with a chainsaw.",
    "Your romantic abilities are like a flat tire on a unicycle - they make everything harder.",
    "You handle relationships like you're trying to cook a gourmet meal using only a lighter.",
    "Your dating skills are like a broken alarm clock - they go off at all the wrong times.",
    "You approach romance like you're trying to perform archaeology with a sledgehammer.",
    "Your relationship abilities are like a corrupted hard drive - they look functional but nothing works.",
    "You handle love like you're trying to navigate using a broken compass in a maze.",
    "Your romantic skills are like a disconnected internet - present but not functional.",
    "You approach relationships like you're trying to build a sandcastle during a tsunami.",
    "Your dating abilities are like a broken vending machine - you put in effort and get nothing back.",
    "You handle romance like you're trying to perform a symphony using only a kazoo.",
    "Your relationship skills are like a GPS with a dead battery - completely useless when you need them most.",
    "You approach love like you're trying to solve a Rubik's cube while blindfolded and wearing mittens."
  ],
  "cooking_roasts": [
    "Your cooking skills are like a smoke alarm - they only activate when something's burning.",
    "You cook like you're trying to prove that food poisoning is an art form.",
    "Your culinary abilities are like a broken recipe - they never turn out right.",
    "You approach cooking like you're conducting a chemistry experiment gone wrong.",
    "Your kitchen skills are like a GPS with no signal - completely lost.",
    "You cook like you're using ingredients from a parallel universe where taste doesn't exist.",
    "Your culinary talents are like a flat soufflé - deflated and disappointing.",
    "You approach cooking like you're trying to solve a puzzle with edible pieces that don't fit.",
    "Your cooking abilities are like a broken thermometer - they never get the temperature right.",
    "You cook like you're following recipes written in invisible ink.",
    "Your kitchen skills are like a corrupted cookbook - they look like they should work but they don't.",
    "You approach cooking like you're trying to paint a masterpiece with food coloring.",
    "Your culinary abilities are like a broken blender - lots of noise, no useful results.",
    "You cook like you're using a manual from a different planet where food works differently.",
    "Your kitchen skills are like a flat tire on a food truck - they get you nowhere.",
    "You approach cooking like you're trying to perform surgery with kitchen utensils.",
    "Your culinary talents are like a broken oven - they promise heat but deliver disappointment.",
    "You cook like you're playing a game where the objective is to make everything inedible.",
    "Your kitchen skills are like a corrupted taste bud - they can't distinguish good from bad.",
    "You approach cooking like you're trying to build a house using only condiments.",
    "Your culinary abilities are like a broken scale - they never measure up.",
    "You cook like you're following a recipe for disaster written by your worst enemy.",
    "Your kitchen skills are like a GPS that only gives directions to food poisoning.",
    "You approach cooking like you're trying to conduct an orchestra using only spatulas.",
    "Your culinary talents are like a broken refrigerator - they can't keep anything fresh.",
    "You cook like you're using ingredients that have been translated through five different languages.",
    "Your kitchen skills are like a flat balloon at a cooking competition - deflated and out of place.",
    "You approach cooking like you're trying to perform magic tricks with expired ingredients.",
    "Your culinary abilities are like a broken timer - they never know when something's done.",
    "You cook like you're trying to solve calculus using only salt and pepper.",
    "Your kitchen skills are like a corrupted recipe database - they store all the wrong information.",
    "You approach cooking like you're trying to write poetry with pasta.",
    "Your culinary talents are like a broken can opener - they can't access the good stuff.",
    "You cook like you're using a cookbook written by someone who hates food.",
    "Your kitchen skills are like a GPS with a dead battery - completely useless when you need them.",
    "You approach cooking like you're trying to perform brain surgery with a whisk.",
    "Your culinary abilities are like a broken smoke detector - they don't warn you when things go wrong.",
    "You cook like you're following directions from a cookbook that's been through a paper shredder.",
    "Your kitchen skills are like a flat soda in a cooking show - no fizz and disappointing.",
    "You approach cooking like you're trying to build a rocket using only kitchen appliances.",
    "Your culinary talents are like a broken measuring cup - they never get the proportions right.",
    "You cook like you're using spices that have been cursed by an angry chef.",
    "Your kitchen skills are like a corrupted cooking video - they skip all the important parts.",
    "You approach cooking like you're trying to perform archaeology with a rolling pin.",
    "Your culinary abilities are like a broken food processor - they chop up everything including the good ideas.",
    "You cook like you're following a recipe that was written during a natural disaster.",
    "Your kitchen skills are like a GPS that speaks only in cooking terms from the 1800s.",
    "You approach cooking like you're trying to solve a Rubik's cube using only kitchen utensils.",
    "Your culinary talents are like a broken dishwasher - they make everything messier than when you started.",
    "You cook like you're trying to prove that the phrase 'too many cooks spoil the broth' applies even when there's only one cook."
  ],
  "driving_roasts": [
    "Your driving skills are like a GPS with no signal - completely lost and dangerous.",
    "You drive like you're trying to prove that traffic laws are just suggestions.",
    "Your road abilities are like a broken speedometer - you never know how fast you're going wrong.",
    "You approach driving like you're playing a video game where crashing is the objective.",
    "Your driving skills are like a flat tire - they get you nowhere safely.",
    "You drive like you learned from watching action movies with your eyes closed.",
    "Your road abilities are like a corrupted navigation system - they lead everyone astray.",
    "You approach driving like you're trying to solve a puzzle while blindfolded.",
    "Your driving skills are like a broken brake - they don't stop you from making bad decisions.",
    "You drive like you're using a manual written by someone who hates cars.",
    "Your road abilities are like a GPS that only gives directions to accidents.",
    "You approach driving like you're trying to conduct an orchestra from the driver's seat.",
    "Your driving skills are like a flat balloon - deflated and going nowhere good.",
    "You drive like you're playing a game where the rules change every time you think you understand them.",
    "Your road abilities are like a broken turn signal - they never indicate your actual intentions.",
    "You approach driving like you're trying to perform surgery while operating heavy machinery.",
    "Your driving skills are like a corrupted driving test - they fail every safety check.",
    "You drive like you're using a steering wheel from a different vehicle.",
    "Your road abilities are like a GPS with a dead battery - completely useless when you need them.",
    "You approach driving like you're trying to paint a masterpiece while moving at highway speeds.",
    "Your driving skills are like a broken rearview mirror - they don't help you see what's behind you.",
    "You drive like you're following directions from a map drawn by someone who's never seen a road.",
    "Your road abilities are like a flat tire on a race car - they slow everyone down.",
    "You approach driving like you're trying to solve calculus while parallel parking.",
    "Your driving skills are like a corrupted odometer - they never accurately measure your progress.",
    "You drive like you're using a vehicle that was assembled by someone who hates transportation.",
    "Your road abilities are like a broken fuel gauge - they never tell you when you're running on empty.",
    "You approach driving like you're trying to perform magic tricks with a two-ton vehicle.",
    "Your driving skills are like a GPS that speaks only in riddles.",
    "You drive like you're playing a game where the objective is to collect as many traffic violations as possible.",
    "Your road abilities are like a broken windshield - they don't give you a clear view of what's ahead.",
    "You approach driving like you're trying to write poetry while merging onto the highway.",
    "Your driving skills are like a corrupted parking sensor - they beep at all the wrong times.",
    "You drive like you're using a car that was designed by someone who's never seen traffic.",
    "Your road abilities are like a flat spare tire - they're supposed to help but they don't.",
    "You approach driving like you're trying to perform brain surgery while changing lanes.",
    "Your driving skills are like a broken horn - they make noise but don't communicate anything useful.",
    "You drive like you're following a GPS that was programmed by your worst enemy.",
    "Your road abilities are like a corrupted driving simulator - they teach you all the wrong things.",
    "You approach driving like you're trying to build a house while sitting in traffic.",
    "Your driving skills are like a broken seat belt - they're supposed to keep you safe but they don't work.",
    "You drive like you're using a vehicle that came with instructions in a language you don't understand.",
    "Your road abilities are like a GPS that only knows how to get lost.",
    "You approach driving like you're trying to perform archaeology while navigating rush hour traffic.",
    "Your driving skills are like a corrupted traffic light - they give all the wrong signals.",
    "You drive like you're playing a game where the roads are made of ice and your tires are made of soap.",
    "Your road abilities are like a broken dashboard - they don't tell you anything useful about your situation.",
    "You approach driving like you're trying to solve a Rubik's cube while operating a vehicle designed by someone who hates puzzles.",
    "Your driving skills are like a GPS with a sense of humor - they take you everywhere except where you want to go.",
    "You drive like you're trying to prove that the phrase 'defensive driving' is just a marketing slogan."
  ],
  "fashion_roasts": [
    "Your fashion sense is like a broken GPS - it takes you everywhere except where you want to go.",
    "You dress like you're colorblind and shopping in the dark during a power outage.",
    "Your style is like a corrupted fashion magazine - it looks like it should make sense but it doesn't.",
    "You approach fashion like you're trying to solve a puzzle with pieces from different decades.",
    "Your wardrobe choices are like a flat tire on the runway of style.",
    "You dress like you're using a fashion manual written by someone who hates clothes.",
    "Your style sense is like a broken mirror - it reflects poorly on everything.",
    "You approach fashion like you're playing a game where the objective is to clash as much as possible.",
    "Your clothing choices are like a GPS with no signal - completely lost.",
    "You dress like you're trying to prove that fashion rules are just suggestions from a parallel universe.",
    "Your style is like a corrupted color palette - nothing goes together.",
    "You approach fashion like you're trying to conduct an orchestra using only mismatched socks.",
    "Your wardrobe is like a flat balloon at a fashion show - deflated and out of place.",
    "You dress like you're following fashion advice from someone who learned style from watching silent films.",
    "Your fashion sense is like a broken calculator - it doesn't add up to anything attractive.",
    "You approach style like you're trying to paint a masterpiece using only mud.",
    "Your clothing choices are like a GPS that only gives directions to fashion disasters.",
    "You dress like you're using a wardrobe that was assembled by someone who's never seen clothes before.",
    "Your style is like a corrupted fashion algorithm - it processes everything wrong.",
    "You approach fashion like you're trying to solve calculus using only fabric swatches.",
    "Your wardrobe choices are like a broken compass - they point in every direction except stylish.",
    "You dress like you're following a fashion guide written in invisible ink.",
    "Your fashion sense is like a flat soda at a cocktail party - no fizz and disappointing.",
    "You approach style like you're trying to perform surgery with fashion accessories.",
    "Your clothing choices are like a corrupted style database - they store all the wrong information.",
    "You dress like you're using a closet that was organized by a tornado.",
    "Your style is like a broken fashion app - it crashes every time you try to look good.",
    "You approach fashion like you're trying to write poetry using only clothing tags.",
    "Your wardrobe choices are like a GPS with a dead battery - completely useless when you need them.",
    "You dress like you're following fashion trends from a dimension where style works backwards.",
    "Your fashion sense is like a corrupted photo filter - it makes everything look worse.",
    "You approach style like you're trying to build a house using only accessories.",
    "Your clothing choices are like a broken fashion magazine - they skip all the important parts.",
    "You dress like you're using a style guide that was written during a fashion apocalypse.",
    "Your style is like a flat tire on a fashion runway - it stops the show for all the wrong reasons.",
    "You approach fashion like you're trying to perform magic tricks with mismatched outfits.",
    "Your wardrobe choices are like a corrupted fashion video - they buffer at all the wrong moments.",
    "You dress like you're following advice from a fashion consultant who's never seen clothes.",
    "Your fashion sense is like a broken style sensor - it can't detect what looks good.",
    "You approach style like you're trying to solve a Rubik's cube using only patterns that don't match.",
    "Your clothing choices are like a GPS that speaks only in fashion terms from the 1800s.",
    "You dress like you're using a wardrobe that was curated by someone who hates visual harmony.",
    "Your style is like a corrupted fashion forecast - it predicts everything wrong.",
    "You approach fashion like you're trying to perform archaeology with vintage clothes that should have stayed buried.",
    "Your wardrobe choices are like a broken fashion compass - they navigate you directly to style disasters.",
    "You dress like you're following a fashion map that was drawn by someone who's never seen a mirror.",
    "Your fashion sense is like a flat balloon at a style convention - deflated and completely out of place.",
    "You approach style like you're trying to conduct a symphony using only clothes that were designed by tone-deaf fashion designers.",
    "Your clothing choices are like a corrupted style algorithm that was programmed by someone who thinks fashion is a foreign language.",
    "You dress like you're trying to prove that the phrase 'clothes make the man' is just a cruel joke played on humanity."
  ],
  "fitness_roasts": [
    "Your fitness level is like a broken treadmill - lots of effort, no forward movement.",
    "You exercise like you're allergic to progress and breaking out in improvement.",
    "Your workout routine is like a GPS with no signal - completely lost and going nowhere.",
    "You approach fitness like you're trying to solve a puzzle with weights that don't fit.",
    "Your athletic abilities are like a flat tire on a bicycle - they get you nowhere fast.",
    "You exercise like you're using a fitness manual written by someone who hates movement.",
    "Your workout skills are like a corrupted fitness app - they look like they should work but they don't.",
    "You approach fitness like you're trying to conduct an orchestra using only dumbbells.",
    "Your exercise routine is like a broken scale - it never measures any real progress.",
    "You work out like you're following instructions from a fitness guide written in invisible ink.",
    "Your athletic abilities are like a GPS that only gives directions to the couch.",
    "You approach fitness like you're trying to paint a masterpiece using only sweat.",
    "Your workout routine is like a flat balloon at a gym - deflated and out of place.",
    "You exercise like you're playing a game where the objective is to avoid all forms of improvement.",
    "Your fitness level is like a corrupted heart rate monitor - it can't detect any real activity.",
    "You approach workouts like you're trying to perform surgery with exercise equipment.",
    "Your athletic abilities are like a broken fitness tracker - they count everything except actual progress.",
    "You exercise like you're using gym equipment that was designed by someone who's never seen a muscle.",
    "Your workout routine is like a GPS with a dead battery - completely useless when you need it.",
    "You approach fitness like you're trying to solve calculus using only protein powder.",
    "Your exercise skills are like a corrupted workout video - they skip all the important parts.",
    "You work out like you're following a fitness plan written by someone who thinks exercise is a myth.",
    "Your athletic abilities are like a flat tire on a stationary bike - they don't even pretend to go anywhere.",
    "You approach fitness like you're trying to write poetry using only gym equipment.",
    "Your workout routine is like a broken gym membership - it costs money but provides no benefits.",
    "You exercise like you're using a fitness app that was programmed by someone who hates physical activity.",
    "Your fitness level is like a corrupted muscle memory - it remembers all the wrong movements.",
    "You approach workouts like you're trying to build a house using only resistance bands.",
    "Your athletic abilities are like a GPS that speaks only in fitness terms from the stone age.",
    "You exercise like you're following a workout plan that was designed during a fitness apocalypse.",
    "Your workout routine is like a broken personal trainer - it gives all the wrong advice.",
    "You approach fitness like you're trying to perform magic tricks with exercise equipment.",
    "Your exercise skills are like a corrupted fitness database - they store all the wrong techniques.",
    "You work out like you're using gym equipment that was assembled by someone who's never seen a body.",
    "Your athletic abilities are like a flat soda at a sports drink convention - no energy and disappointing.",
    "You approach fitness like you're trying to solve a Rubik's cube using only cardio equipment.",
    "Your workout routine is like a broken fitness algorithm - it processes everything wrong.",
    "You exercise like you're following advice from a fitness consultant who learned everything from watching exercise videos with the sound off.",
    "Your fitness level is like a corrupted step counter - it counts everything except actual steps toward improvement.",
    "You approach workouts like you're trying to perform archaeology with weights that should have stayed buried.",
    "Your athletic abilities are like a GPS that only knows how to navigate to the nearest fast food restaurant.",
    "You exercise like you're using a fitness plan that was written by someone who thinks 'working out' means solving math problems.",
    "Your workout routine is like a broken fitness mirror - it reflects all the wrong movements.",
    "You approach fitness like you're trying to conduct a symphony using only the sound of heavy breathing.",
    "Your exercise skills are like a corrupted fitness tracker that was designed by someone who thinks movement is optional.",
    "You work out like you're following a fitness guide that was translated through five different languages by people who've never seen a gym.",
    "Your athletic abilities are like a flat tire on a exercise bike - they make noise but don't actually move anything.",
    "You approach fitness like you're trying to prove that the phrase 'no pain, no gain' is just a suggestion from people who enjoy suffering.",
    "Your workout routine is like a broken fitness subscription - it promises results but delivers only confusion and mild disappointment.",
    "You exercise like you're trying to solve the mysteries of the universe using only the power of avoiding actual physical exertion."
  ],
  "music_roasts": [
    "Your musical taste is like a broken radio - lots of static and no clear signal.",
    "You listen to music like you're trying to solve a puzzle with your ears closed.",
    "Your music skills are like a flat note in a symphony - they ruin the whole performance.",
    "You approach music like you're tone-deaf and proud of it.",
    "Your musical abilities are like a corrupted audio file - they skip all the good parts.",
    "You play music like you're using instruments that were designed by someone who hates sound.",
    "Your music taste is like a GPS with no signal - completely lost in the world of melody.",
    "You approach music like you're trying to conduct an orchestra using only air guitar.",
    "Your musical skills are like a broken speaker - lots of noise, no quality.",
    "You listen to music like you're following a playlist curated by someone who's never heard harmony.",
    "Your music abilities are like a flat tire on a tour bus - they get the band nowhere.",
    "You approach music like you're trying to paint a masterpiece using only sound effects.",
    "Your musical taste is like a corrupted music library - it stores all the wrong songs.",
    "You play music like you're using a manual written by someone who thinks rhythm is optional.",
    "Your music skills are like a GPS that only gives directions to off-key destinations.",
    "You approach music like you're trying to solve calculus using only drum beats.",
    "Your musical abilities are like a broken metronome - they never keep proper time.",
    "You listen to music like you're using headphones that were designed by someone who hates ears.",
    "Your music taste is like a flat balloon at a concert - deflated and out of place.",
    "You approach music like you're trying to perform surgery with musical instruments.",
    "Your musical skills are like a corrupted music video - they buffer at all the wrong moments.",
    "You play music like you're following sheet music written in invisible ink.",
    "Your music abilities are like a GPS with a dead battery - completely useless when you need rhythm.",
    "You approach music like you're trying to write poetry using only musical notes that don't exist.",
    "Your musical taste is like a broken music app - it crashes every time you try to find something good.",
    "You listen to music like you're using a sound system that was assembled by someone who's never heard audio.",
    "Your music skills are like a corrupted audio driver - they make everything sound worse.",
    "You approach music like you're trying to build a house using only musical instruments.",
    "Your musical abilities are like a flat note that somehow manages to be sharp at the same time.",
    "You play music like you're following a songbook that was written during a musical apocalypse.",
    "Your music taste is like a broken tuning fork - it can't find the right pitch.",
    "You approach music like you're trying to perform magic tricks with sound waves.",
    "Your musical skills are like a corrupted music database - they catalog all the wrong information.",
    "You listen to music like you're using speakers that were designed by someone who thinks silence is golden.",
    "Your music abilities are like a GPS that speaks only in musical terms from the medieval period.",
    "You approach music like you're trying to solve a Rubik's cube using only audio cues.",
    "Your musical taste is like a broken concert ticket - it promises an experience but delivers disappointment.",
    "You play music like you're using instruments that were tuned by someone who's never heard harmony.",
    "Your music skills are like a corrupted music streaming service - they buffer everything except good taste.",
    "You approach music like you're trying to conduct a symphony using only interpretive dance.",
    "Your musical abilities are like a flat tire on a music tour - they stop the show for all the wrong reasons.",
    "You listen to music like you're following a playlist that was created by artificial intelligence having a breakdown.",
    "Your music taste is like a broken music box - it plays the same wrong note over and over.",
    "You approach music like you're trying to perform archaeology with instruments that should have stayed buried.",
    "Your musical skills are like a corrupted equalizer - they make every frequency sound wrong.",
    "You play music like you're using a songbook that was written by someone who thinks melody is a suggestion.",
    "Your music abilities are like a GPS that only knows how to navigate to musical disasters.",
    "You approach music like you're trying to prove that the phrase 'music to my ears' is just a cruel joke.",
    "Your musical taste is like a broken sound system that was designed by someone who prefers the sound of nails on a chalkboard.",
    "You listen to music like you're trying to solve the mysteries of the universe using only the power of being completely tone-deaf."
  ],
  "parenting_roasts": [
     "Your parenting skills are like a broken GPS - they lead your kids everywhere except where they should go.",
     "You parent like you're trying to raise functional adults using a manual written by someone who hates children.",
     "Your child-rearing abilities are like a flat tire on the family road trip of life.",
     "You approach parenting like you're solving a puzzle with pieces from different childhood development theories.",
     "Your parenting skills are like a corrupted family photo - they look like they should capture something beautiful but they don't.",
     "You parent like you're using child development advice from someone who learned everything from watching sitcoms.",
     "Your child-rearing abilities are like a GPS with no signal - completely lost in the world of nurturing.",
     "You approach parenting like you're trying to conduct an orchestra using only children's toys.",
     "Your parenting skills are like a broken calculator - they don't add up to anything positive.",
     "You parent like you're following a recipe for disaster written in crayon.",
     "Your child-rearing abilities are like a flat balloon at a birthday party - deflated and disappointing.",
     "You approach parenting like you're trying to solve calculus using only finger paints.",
     "Your parenting skills are like a corrupted bedtime story - they look like they should be comforting but they're not.",
     "You parent like you're using a child psychology textbook that was written by someone who's never met a child.",
     "Your child-rearing abilities are like a GPS that only gives directions to chaos.",
     "You approach parenting like you're trying to build a house using only building blocks.",
     "Your parenting skills are like a broken playground - they're supposed to be fun but they're actually dangerous.",
     "You parent like you're following advice from a parenting guru who learned everything from watching cartoons.",
     "Your child-rearing abilities are like a corrupted lullaby - they're supposed to be soothing but they cause nightmares.",
     "You approach parenting like you're trying to perform surgery with safety scissors.",
     "Your parenting skills are like a flat tire on a school bus - they get nobody where they need to go.",
     "You parent like you're using a manual that was translated through five different languages by people who've never had children.",
     "Your child-rearing abilities are like a broken compass in the wilderness of childhood.",
     "You approach parenting like you're trying to write poetry using only temper tantrums.",
     "Your parenting skills are like a corrupted photo album - they're supposed to capture memories but they create trauma.",
     "You parent like you're following a roadmap drawn by someone who's never been on a family vacation.",
     "Your child-rearing abilities are like a GPS with a dead battery - completely useless when you need guidance most.",
     "You approach parenting like you're trying to conduct a symphony using only the sound of crying.",
     "Your parenting skills are like a broken swing set - they're supposed to bring joy but they just cause accidents.",
     "You parent like you're using child development theories from someone who thinks children are just small, irrational adults.",
     "Your child-rearing abilities are like a corrupted video game - they're supposed to be fun but they're just frustrating.",
     "You approach parenting like you're trying to solve a Rubik's cube while blindfolded and the cube is on fire.",
     "Your parenting skills are like a flat soda at a children's party - no fizz and disappointing.",
     "You parent like you're following advice from a parenting book that was written by someone who's allergic to children.",
     "Your child-rearing abilities are like a broken toy - they look like they should work but they just cause tears.",
     "You approach parenting like you're trying to perform magic tricks with props that don't exist.",
     "Your parenting skills are like a corrupted children's song - they're supposed to be cheerful but they're actually disturbing.",
     "You parent like you're using a strategy guide for a game you've never played.",
     "Your child-rearing abilities are like a GPS that speaks only in ancient languages that children don't understand.",
     "You approach parenting like you're trying to build a sandcastle during a hurricane.",
     "Your parenting skills are like a broken promise to be the parent you never had.",
     "You parent like you're following a recipe that was written by someone who thinks love is an optional ingredient.",
     "Your child-rearing abilities are like a corrupted backup file - they're supposed to preserve the important stuff but they just create more problems.",
     "You approach parenting like you're trying to solve the mysteries of the universe using only the wisdom of someone who's never successfully raised a houseplant.",
     "Your parenting skills are like a flat tire on the journey to raising well-adjusted humans.",
     "You parent like you're using a manual that was written by someone who thinks 'because I said so' is a complete parenting philosophy.",
     "Your child-rearing abilities are like a broken alarm clock - they're supposed to wake everyone up to what's important but they just cause stress.",
     "You approach parenting like you're trying to conduct a masterclass in how to make childhood feel like a survival challenge.",
     "Your parenting skills are like a corrupted family tree - they're supposed to show growth but they just show dysfunction.",
     "You parent like you're trying to prove that the phrase 'it takes a village' means the village should do all the work."
    ],
    "sports_roasts": [
      "Your athletic abilities are like a broken scoreboard - they don't register any points.",
      "You play sports like you're trying to redefine what losing looks like.",
      "Your coordination is like a GPS with no signal - completely lost in space.",
      "You approach athletics like you're solving calculus using only your feet.",
      "Your sports skills are like a flat basketball - no bounce and disappointing.",
      "You play like you're trying to prove that participation trophies were invented for people exactly like you.",
      "Your athletic performance is like a corrupted video game - it looks like it should work but it just glitches.",
      "You approach sports like you're trying to conduct an orchestra using only sports equipment.",
      "Your coordination is like a broken compass - it points in every direction except the right one.",
      "You play sports like you're following rules that were written by someone who's never seen the game.",
      "Your athletic abilities are like a calculator with dead batteries - they don't compute.",
      "You approach athletics like you're trying to solve a puzzle with pieces from different sports.",
      "Your sports performance is like a flat tire on race day - it gets you nowhere fast.",
      "You play like you're using a strategy guide for a completely different sport.",
      "Your coordination is like a corrupted dance routine - it's supposed to be graceful but it's just chaos.",
      "You approach sports like you're trying to write poetry using only athletic failures.",
      "Your athletic abilities are like a broken stopwatch - they don't measure up to anything.",
      "You play sports like you're following advice from a coach who learned everything from watching cartoons.",
      "Your coordination is like a GPS that only gives directions to the bench.",
      "You approach athletics like you're trying to perform surgery with sports equipment.",
      "Your sports skills are like a corrupted highlight reel - they're supposed to show your best moments but they don't exist.",
      "You play like you're using equipment that was designed by someone who's never played sports.",
      "Your athletic performance is like a broken alarm clock - it's supposed to wake people up but it just causes stress.",
      "You approach sports like you're trying to solve the mysteries of the universe using only athletic incompetence.",
      "Your coordination is like a flat balloon at a sports event - deflated and disappointing.",
      "You play sports like you're following a manual that was translated through five different languages by people who hate athletics.",
      "Your athletic abilities are like a corrupted sports broadcast - they're supposed to be entertaining but they're just painful to watch.",
      "You approach athletics like you're trying to conduct a masterclass in how to make sports look impossible.",
      "Your sports performance is like a broken trophy - it's supposed to represent achievement but it just represents participation.",
      "You play like you're using a rulebook that was written by someone who thinks sports are just elaborate ways to embarrass yourself.",
      "Your coordination is like a GPS with a dead battery - completely useless when you need direction most.",
      "You approach sports like you're trying to prove that the phrase 'it's not whether you win or lose' was written specifically for you.",
      "Your athletic abilities are like a flat soda at a sports event - no fizz and disappointing.",
      "You play sports like you're following advice from an athletic guru who learned everything from watching people fail.",
      "Your coordination is like a corrupted video game controller - it's supposed to help you play but it just makes everything harder.",
      "You approach athletics like you're trying to build a championship team using only people who've never seen the sport.",
      "Your sports skills are like a broken scoreboard that only counts mistakes.",
      "You play like you're using a strategy that was designed by someone who thinks losing is the objective.",
      "Your athletic performance is like a corrupted sports app - it's supposed to track progress but it just tracks regression.",
      "You approach sports like you're trying to solve a Rubik's cube while blindfolded and the cube is made of athletic equipment.",
      "Your coordination is like a broken compass in the wilderness of athletic competition.",
      "You play sports like you're following a roadmap drawn by someone who's never been to a sporting event.",
      "Your athletic abilities are like a corrupted backup file - they're supposed to preserve your skills but they just create more problems.",
      "You approach athletics like you're trying to conduct a symphony using only the sound of athletic failure.",
      "Your sports performance is like a flat tire on the journey to athletic competence.",
      "You play like you're using a manual that was written by someone who thinks 'good effort' is the highest form of athletic achievement.",
      "Your coordination is like a broken alarm clock - it's supposed to wake everyone up to your potential but it just causes disappointment.",
      "You approach sports like you're trying to prove that the phrase 'practice makes perfect' doesn't apply to everyone.",
      "Your athletic abilities are like a corrupted family photo - they're supposed to capture something beautiful but they just document disaster.",
      "You play sports like you're trying to redefine what it means to be athletically challenged."
    ],
    "travel_roasts": [
      "Your travel planning skills are like a broken GPS - they lead you everywhere except where you want to go.",
      "You navigate like you're trying to solve geography using only a magic 8-ball.",
      "Your sense of direction is like a corrupted map - it looks like it should help but it just causes confusion.",
      "You approach travel like you're following directions written by someone who's never left their house.",
      "Your navigation abilities are like a flat tire on a road trip - they get you nowhere.",
      "You travel like you're using a guidebook that was written by someone who thinks getting lost is the destination.",
      "Your sense of direction is like a broken compass that only points to disappointment.",
      "You approach travel like you're trying to conduct a world tour using only public transportation and bad decisions.",
      "Your navigation skills are like a calculator with dead batteries - they don't compute distances or directions.",
      "You travel like you're following a map that was drawn by someone who's colorblind and geographically challenged.",
      "Your sense of direction is like a corrupted travel app - it's supposed to help but it just makes everything worse.",
      "You approach travel like you're trying to solve the mysteries of the world using only tourist traps and overpriced souvenirs.",
      "Your navigation abilities are like a GPS with no signal - completely lost in the world of exploration.",
      "You travel like you're using directions from someone who learned geography from watching travel commercials.",
      "Your sense of direction is like a flat balloon at a travel expo - deflated and disappointing.",
      "You approach travel like you're trying to write poetry using only flight delays and lost luggage.",
      "Your navigation skills are like a broken stopwatch - they don't measure distances or time accurately.",
      "You travel like you're following advice from a travel guru who's never been further than their local grocery store.",
      "Your sense of direction is like a corrupted vacation photo - it's supposed to capture memories but it just documents confusion.",
      "You approach travel like you're trying to perform surgery with travel brochures.",
      "Your navigation abilities are like a broken alarm clock - they're supposed to wake you up to new experiences but they just cause stress.",
      "You travel like you're using a strategy guide for a game you've never played and don't understand.",
      "Your sense of direction is like a GPS that speaks only in ancient languages that modern travelers don't understand.",
      "You approach travel like you're trying to build a vacation using only the worst possible decisions.",
      "Your navigation skills are like a corrupted travel itinerary - they're supposed to organize your trip but they just create chaos.",
      "You travel like you're following a roadmap drawn by someone who thinks all roads lead to the same disappointing destination.",
      "Your sense of direction is like a flat tire on the journey to adventure.",
      "You approach travel like you're trying to solve calculus using only travel magazines and wishful thinking.",
      "Your navigation abilities are like a broken promise to see the world.",
      "You travel like you're using a manual that was written by someone who thinks 'getting there is half the fun' means the other half is misery.",
      "Your sense of direction is like a corrupted backup file - it's supposed to preserve your travel plans but it just creates more problems.",
      "You approach travel like you're trying to conduct a masterclass in how to make exploration feel like punishment.",
      "Your navigation skills are like a GPS with a dead battery - completely useless when you need guidance most.",
      "You travel like you're following advice from a travel expert who learned everything from watching people get lost.",
      "Your sense of direction is like a broken compass in the wilderness of wanderlust.",
      "You approach travel like you're trying to prove that the phrase 'not all who wander are lost' doesn't apply to you because you're definitely lost.",
      "Your navigation abilities are like a flat soda at a travel event - no fizz and disappointing.",
      "You travel like you're using directions that were translated through five different languages by people who've never traveled.",
      "Your sense of direction is like a corrupted travel documentary - it's supposed to be inspiring but it's just confusing.",
      "You approach travel like you're trying to solve a Rubik's cube while blindfolded and the cube is a map.",
      "Your navigation skills are like a broken scoreboard that only counts wrong turns.",
      "You travel like you're following a strategy that was designed by someone who thinks getting lost is the objective.",
      "Your sense of direction is like a corrupted travel app that only shows you places you don't want to go.",
      "You approach travel like you're trying to conduct a symphony using only the sound of confused tourists.",
      "Your navigation abilities are like a flat tire on the road to adventure.",
      "You travel like you're using a guidebook that was written by someone who thinks 'journey before destination' means the journey should be as confusing as possible.",
      "Your sense of direction is like a broken alarm clock - it's supposed to wake you up to new possibilities but it just causes travel anxiety.",
      "You approach travel like you're trying to prove that the phrase 'the world is your oyster' means you're allergic to shellfish.",
      "Your navigation skills are like a corrupted family vacation photo - they're supposed to capture adventure but they just document disaster.",
      "You travel like you're trying to redefine what it means to be geographically challenged."
    ],
    "money_roasts": [
      "Your financial planning skills are like a broken calculator - they don't add up to anything positive.",
      "You manage money like you're trying to solve economics using only Monopoly money and wishful thinking.",
      "Your budgeting abilities are like a corrupted spreadsheet - they look organized but they're actually chaos.",
      "You approach finances like you're following advice from someone who thinks money grows on trees that don't exist.",
      "Your money management is like a flat tire on the road to financial stability.",
      "You handle finances like you're using a budget that was written by someone who's never seen real money.",
      "Your financial skills are like a broken ATM - they're supposed to give you what you need but they just eat your card.",
      "You approach money like you're trying to conduct a financial orchestra using only credit cards and debt.",
      "Your budgeting abilities are like a GPS with no signal - completely lost in the world of fiscal responsibility.",
      "You manage money like you're following a financial plan drawn by someone who thinks bankruptcy is a destination.",
      "Your financial planning is like a corrupted bank statement - it's supposed to show your progress but it just shows problems.",
      "You approach finances like you're trying to solve the mysteries of wealth using only poor decisions and expensive mistakes.",
      "Your money management skills are like a calculator with dead batteries - they don't compute income or expenses.",
      "You handle finances like you're using advice from a financial guru who learned everything from watching people go broke.",
      "Your budgeting abilities are like a flat balloon at a financial planning seminar - deflated and disappointing.",
      "You approach money like you're trying to write poetry using only overdraft fees and credit card bills.",
      "Your financial skills are like a broken stopwatch - they don't measure financial progress accurately.",
      "You manage money like you're following a budget that was translated through five different languages by people who've never balanced a checkbook.",
      "Your financial planning is like a corrupted investment portfolio - it's supposed to grow but it just shrinks.",
      "You approach finances like you're trying to perform surgery with financial statements.",
      "Your money management abilities are like a broken alarm clock - they're supposed to wake you up to financial reality but they just cause stress.",
      "You handle finances like you're using a strategy guide for a game you've never played and can't afford.",
      "Your budgeting skills are like a GPS that speaks only in ancient currencies that modern banks don't accept.",
      "You approach money like you're trying to build wealth using only the worst possible financial decisions.",
      "Your financial planning is like a corrupted retirement fund - it's supposed to secure your future but it just creates uncertainty.",
      "You manage money like you're following a roadmap drawn by someone who thinks all financial roads lead to poverty.",
      "Your financial abilities are like a flat tire on the journey to economic prosperity.",
      "You approach finances like you're trying to solve calculus using only credit card statements and financial anxiety.",
      "Your money management skills are like a broken promise to be financially responsible.",
      "You handle finances like you're using a manual that was written by someone who thinks 'money can't buy happiness' means you shouldn't try to have any.",
      "Your budgeting abilities are like a corrupted backup file - they're supposed to preserve your financial security but they just create more problems.",
      "You approach money like you're trying to conduct a masterclass in how to make financial planning feel impossible.",
      "Your financial skills are like a GPS with a dead battery - completely useless when you need financial guidance most.",
      "You manage money like you're following advice from a financial expert who learned everything from watching people make expensive mistakes.",
      "Your financial planning is like a broken compass in the wilderness of economic uncertainty.",
      "You approach finances like you're trying to prove that the phrase 'money doesn't grow on trees' applies especially to your bank account.",
      "Your money management abilities are like a flat soda at a financial planning event - no fizz and disappointing.",
      "You handle finances like you're using a budget that was designed by someone who thinks spending more than you earn is a valid strategy.",
      "Your budgeting skills are like a corrupted financial app - they're supposed to help you save but they just track your spending disasters.",
      "You approach money like you're trying to solve a Rubik's cube while blindfolded and the cube is made of unpaid bills.",
      "Your financial planning is like a broken scoreboard that only counts financial mistakes.",
      "You manage money like you're following a strategy that was designed by someone who thinks debt is a hobby.",
      "Your financial abilities are like a corrupted bank account - they're supposed to hold your money but they just hold your disappointment.",
      "You approach finances like you're trying to conduct a symphony using only the sound of financial failure.",
      "Your money management skills are like a flat tire on the road to financial independence.",
      "You handle finances like you're using a guidebook that was written by someone who thinks 'living paycheck to paycheck' is a lifestyle choice.",
      "Your budgeting abilities are like a broken alarm clock - they're supposed to wake you up to financial opportunities but they just cause money anxiety.",
      "You approach money like you're trying to prove that the phrase 'time is money' means you're wasting both.",
      "Your financial skills are like a corrupted family budget - they're supposed to provide security but they just document financial chaos.",
      "You manage money like you're trying to redefine what it means to be financially challenged."
    ],
    "education_roasts": [
      "Your learning abilities are like a broken pencil - pointless and unable to make a mark.",
      "You approach education like you're trying to solve quantum physics using only crayons and confusion.",
      "Your study skills are like a corrupted hard drive - they look like they should store information but they just crash.",
      "You learn like you're following a curriculum designed by someone who thinks ignorance is bliss.",
      "Your academic abilities are like a flat tire on the road to knowledge.",
      "You approach learning like you're using textbooks that were written by someone who's allergic to facts.",
      "Your study skills are like a broken calculator - they don't compute information accurately.",
      "You learn like you're trying to conduct an educational orchestra using only confusion and procrastination.",
      "Your academic abilities are like a GPS with no signal - completely lost in the world of knowledge.",
      "You approach education like you're following a lesson plan drawn by someone who thinks learning is optional.",
      "Your study skills are like a corrupted research paper - they're supposed to demonstrate understanding but they just show confusion.",
      "You learn like you're trying to solve the mysteries of knowledge using only poor study habits and expensive textbooks you don't read.",
      "Your academic abilities are like a calculator with dead batteries - they don't process information or concepts.",
      "You approach education like you're using advice from a teacher who learned everything from watching students fail.",
      "Your study skills are like a flat balloon at a graduation ceremony - deflated and disappointing.",
      "You learn like you're trying to write poetry using only failed exams and missed assignments.",
      "Your academic abilities are like a broken stopwatch - they don't measure learning progress accurately.",
      "You approach education like you're following a study guide that was translated through five different languages by people who've never been to school.",
      "Your study skills are like a corrupted diploma - they're supposed to represent achievement but they just represent attendance.",
      "You learn like you're trying to perform surgery with educational materials.",
      "Your academic abilities are like a broken alarm clock - they're supposed to wake you up to new ideas but they just cause academic stress.",
      "You approach education like you're using a strategy guide for a game you've never played and don't want to learn.",
      "Your study skills are like a GPS that speaks only in ancient languages that modern students don't understand.",
      "You learn like you're trying to build knowledge using only the worst possible study methods.",
      "Your academic abilities are like a corrupted transcript - they're supposed to record your progress but they just create academic problems.",
      "You approach education like you're following a roadmap drawn by someone who thinks all academic roads lead to confusion.",
      "Your study skills are like a flat tire on the journey to intellectual growth.",
      "You learn like you're trying to solve calculus using only study guides and academic anxiety.",
      "Your academic abilities are like a broken promise to get an education.",
      "You approach education like you're using a manual that was written by someone who thinks 'knowledge is power' means you should avoid both.",
      "Your study skills are like a corrupted backup file - they're supposed to preserve your learning but they just create more academic problems.",
      "You learn like you're trying to conduct a masterclass in how to make education feel impossible.",
      "Your academic abilities are like a GPS with a dead battery - completely useless when you need intellectual guidance most.",
      "You approach education like you're following advice from an academic expert who learned everything from watching people drop out.",
      "Your study skills are like a broken compass in the wilderness of intellectual curiosity.",
      "You learn like you're trying to prove that the phrase 'knowledge is power' doesn't apply to you because you're powerless against textbooks.",
      "Your academic abilities are like a flat soda at an educational event - no fizz and disappointing.",
      "You approach education like you're using a curriculum that was designed by someone who thinks learning should be as difficult as possible.",
      "Your study skills are like a corrupted educational app - they're supposed to help you learn but they just track your academic disasters.",
      "You learn like you're trying to solve a Rubik's cube while blindfolded and the cube is made of unread textbooks.",
      "Your academic abilities are like a broken scoreboard that only counts missed assignments.",
      "You approach education like you're following a strategy that was designed by someone who thinks failing is the objective.",
      "Your study skills are like a corrupted grade book - they're supposed to show your progress but they just show your regression.",
      "You learn like you're trying to conduct a symphony using only the sound of academic failure.",
      "Your academic abilities are like a flat tire on the road to intellectual achievement.",
      "You approach education like you're using a guidebook that was written by someone who thinks 'lifelong learning' means a lifetime of confusion.",
      "Your study skills are like a broken alarm clock - they're supposed to wake you up to educational opportunities but they just cause academic anxiety.",
      "You learn like you're trying to prove that the phrase 'education is the key to success' means you've lost the key.",
      "Your academic abilities are like a corrupted family report card - they're supposed to show achievement but they just document academic disaster.",
      "You approach education like you're trying to redefine what it means to be academically challenged."
    ],
    "hobby_roasts": [
      "Your hobbies are like a broken toy - they're supposed to bring joy but they just collect dust.",
      "You approach leisure activities like you're trying to solve fun using only boredom and lack of commitment.",
      "Your hobby skills are like a corrupted game save - they look like they should show progress but they just show wasted time.",
      "You pursue hobbies like you're following instructions written by someone who thinks enjoyment is overrated.",
      "Your leisure abilities are like a flat tire on the road to personal fulfillment.",
      "You approach hobbies like you're using a manual that was written by someone who's allergic to fun.",
      "Your hobby skills are like a broken calculator - they don't add up to any meaningful accomplishment.",
      "You pursue leisure activities like you're trying to conduct a hobby orchestra using only half-hearted attempts and abandoned projects.",
      "Your hobby abilities are like a GPS with no signal - completely lost in the world of personal interests.",
      "You approach hobbies like you're following a guide drawn by someone who thinks all recreational roads lead to disappointment.",
      "Your leisure skills are like a corrupted craft project - they're supposed to demonstrate creativity but they just show confusion.",
      "You pursue hobbies like you're trying to solve the mysteries of enjoyment using only expensive equipment you don't know how to use.",
      "Your hobby abilities are like a calculator with dead batteries - they don't process creativity or skill development.",
      "You approach leisure activities like you're using advice from a hobby guru who learned everything from watching people quit.",
      "Your hobby skills are like a flat balloon at a craft fair - deflated and disappointing.",
      "You pursue hobbies like you're trying to write poetry using only unfinished projects and good intentions.",
      "Your leisure abilities are like a broken stopwatch - they don't measure hobby progress accurately.",
      "You approach hobbies like you're following a tutorial that was translated through five different languages by people who've never had fun.",
      "Your hobby skills are like a corrupted portfolio - they're supposed to showcase your talents but they just showcase your lack thereof.",
      "You pursue leisure activities like you're trying to perform surgery with craft supplies.",
      "Your hobby abilities are like a broken alarm clock - they're supposed to wake you up to new interests but they just cause hobby stress.",
      "You approach hobbies like you're using a strategy guide for activities you've never tried and don't want to master.",
      "Your leisure skills are like a GPS that speaks only in ancient languages that modern hobbyists don't understand.",
      "You pursue hobbies like you're trying to build enjoyment using only the worst possible recreational choices.",
      "Your hobby abilities are like a corrupted instruction manual - they're supposed to guide your interests but they just create hobby problems.",
      "You approach leisure activities like you're following a roadmap drawn by someone who thinks all hobby roads lead to expensive disappointment.",
      "Your hobby skills are like a flat tire on the journey to personal satisfaction.",
      "You pursue hobbies like you're trying to solve creativity using only hobby supplies and recreational anxiety.",
      "Your leisure abilities are like a broken promise to develop interesting skills.",
      "You approach hobbies like you're using a manual that was written by someone who thinks 'practice makes perfect' doesn't apply to recreational activities.",
      "Your hobby skills are like a corrupted backup file - they're supposed to preserve your interests but they just create more recreational problems.",
      "You pursue leisure activities like you're trying to conduct a masterclass in how to make fun feel like work.",
      "Your hobby abilities are like a GPS with a dead battery - completely useless when you need recreational guidance most.",
      "You approach hobbies like you're following advice from a leisure expert who learned everything from watching people abandon their interests.",
      "Your leisure skills are like a broken compass in the wilderness of personal fulfillment.",
      "You pursue hobbies like you're trying to prove that the phrase 'find your passion' means you're destined to be passionless.",
      "Your hobby abilities are like a flat soda at a craft event - no fizz and disappointing.",
      "You approach leisure activities like you're using a hobby guide that was designed by someone who thinks enjoyment should be as difficult as possible.",
      "Your hobby skills are like a corrupted recreational app - they're supposed to help you have fun but they just track your hobby disasters.",
      "You pursue hobbies like you're trying to solve a Rubik's cube while blindfolded and the cube is made of unfinished craft projects.",
      "Your leisure abilities are like a broken scoreboard that only counts abandoned hobbies.",
      "You approach hobbies like you're following a strategy that was designed by someone who thinks quitting is the objective.",
      "Your hobby skills are like a corrupted craft room - they're supposed to show your creativity but they just show your clutter.",
      "You pursue leisure activities like you're trying to conduct a symphony using only the sound of recreational failure.",
      "Your hobby abilities are like a flat tire on the road to personal enrichment.",
      "You approach hobbies like you're using a guidebook that was written by someone who thinks 'leisure time' means time to be disappointed in yourself.",
      "Your leisure skills are like a broken alarm clock - they're supposed to wake you up to new possibilities but they just cause hobby anxiety.",
      "You pursue hobbies like you're trying to prove that the phrase 'follow your dreams' means your dreams should be as boring as possible.",
      "Your hobby abilities are like a corrupted family craft project - they're supposed to bring joy but they just document recreational disaster.",
      "You approach leisure activities like you're trying to redefine what it means to be recreationally challenged."
    ],
    "pet_roasts": [
      "Your pet care skills are like a broken leash - they're supposed to provide guidance but they just create chaos.",
      "You care for animals like you're trying to solve veterinary science using only good intentions and pet store advice.",
      "Your pet management abilities are like a corrupted pet training app - they look helpful but they just confuse everyone involved.",
      "You approach pet ownership like you're following care instructions written by someone who thinks animals are just furry houseplants.",
      "Your animal care skills are like a flat tire on the road to responsible pet ownership.",
      "You handle pets like you're using a care manual that was written by someone who's allergic to animals.",
      "Your pet care abilities are like a broken treat dispenser - they're supposed to reward good behavior but they just create mess.",
      "You care for animals like you're trying to conduct a pet orchestra using only confusion and overpriced pet accessories.",
      "Your pet management skills are like a GPS with no signal - completely lost in the world of animal care.",
      "You approach pet ownership like you're following a guide drawn by someone who thinks all pet care roads lead to veterinary bills.",
      "Your animal care abilities are like a corrupted pet health record - they're supposed to track wellness but they just track problems.",
      "You handle pets like you're trying to solve the mysteries of animal behavior using only pet psychology books you don't understand.",
      "Your pet care skills are like a calculator with dead batteries - they don't compute feeding schedules or exercise needs.",
      "You care for animals like you're using advice from a pet expert who learned everything from watching people return pets to shelters.",
      "Your pet management abilities are like a flat balloon at a pet show - deflated and disappointing.",
      "You approach pet ownership like you're trying to write poetry using only vet bills and pet behavioral problems.",
      "Your animal care skills are like a broken stopwatch - they don't measure pet care progress accurately.",
      "You handle pets like you're following care instructions that were translated through five different languages by people who've never owned animals.",
      "Your pet care abilities are like a corrupted pet photo album - they're supposed to capture happy moments but they just document chaos.",
      "You care for animals like you're trying to perform veterinary surgery with pet toys.",
      "Your pet management skills are like a broken alarm clock - they're supposed to wake you up to pet care responsibilities but they just cause animal anxiety.",
      "You approach pet ownership like you're using a strategy guide for animals you've never met and don't understand.",
      "Your animal care abilities are like a GPS that speaks only in ancient languages that modern pets don't understand.",
      "You handle pets like you're trying to build a happy animal family using only the worst possible pet care decisions.",
      "Your pet care skills are like a corrupted training manual - they're supposed to guide animal behavior but they just create pet problems.",
      "You care for animals like you're following a roadmap drawn by someone who thinks all pet care roads lead to expensive mistakes.",
      "Your pet management abilities are like a flat tire on the journey to successful animal companionship.",
      "You approach pet ownership like you're trying to solve animal psychology using only pet care supplies and veterinary anxiety.",
      "Your animal care skills are like a broken promise to be a responsible pet owner.",
      "You handle pets like you're using a manual that was written by someone who thinks 'unconditional love' means the love should be one-sided.",
      "Your pet care abilities are like a corrupted backup file - they're supposed to preserve animal welfare but they just create more pet problems.",
      "You care for animals like you're trying to conduct a masterclass in how to make pet ownership feel impossible.",
      "Your pet management skills are like a GPS with a dead battery - completely useless when you need animal care guidance most.",
      "You approach pet ownership like you're following advice from an animal expert who learned everything from watching people struggle with pets.",
      "Your animal care abilities are like a broken compass in the wilderness of pet responsibility.",
      "You handle pets like you're trying to prove that the phrase 'man's best friend' doesn't apply to you because you're not even your pet's acquaintance.",
      "Your pet care skills are like a flat soda at a pet expo - no fizz and disappointing.",
      "You care for animals like you're using a pet care guide that was designed by someone who thinks animal welfare should be as complicated as possible.",
      "Your pet management abilities are like a corrupted pet care app - they're supposed to help you care for animals but they just track your pet care disasters.",
      "You approach pet ownership like you're trying to solve a Rubik's cube while blindfolded and the cube is made of pet care responsibilities.",
      "Your animal care skills are like a broken scoreboard that only counts pet care mistakes.",
      "You handle pets like you're following a strategy that was designed by someone who thinks neglect is a valid pet care approach.",
      "Your pet care abilities are like a corrupted animal welfare record - they're supposed to show proper care but they just show confusion.",
      "You care for animals like you're trying to conduct a symphony using only the sound of pet care failure.",
      "Your pet management skills are like a flat tire on the road to animal companionship.",
      "You approach pet ownership like you're using a guidebook that was written by someone who thinks 'pet parent' means you should be as confused as a new parent.",
      "Your animal care abilities are like a broken alarm clock - they're supposed to wake you up to pet care opportunities but they just cause animal anxiety.",
      "You handle pets like you're trying to prove that the phrase 'all creatures great and small' means you're equally bad at caring for all of them.",
      "Your pet care skills are like a corrupted family pet photo - they're supposed to show love but they just document pet care disaster.",
      "You care for animals like you're trying to redefine what it means to be pet care challenged."
    ],
    "weather_roasts": [
      "Your weather prediction skills are like a broken barometer - they're completely off and unreliable.",
      "You forecast weather like you're trying to solve meteorology using only wishful thinking and a magic 8-ball.",
      "Your weather awareness is like a corrupted weather app - it looks like it should be helpful but it just gives wrong information.",
      "You approach weather like you're following forecasts written by someone who thinks rain is just a suggestion.",
      "Your meteorological abilities are like a flat tire on the road to accurate weather prediction.",
      "You handle weather like you're using forecasts that were written by someone who's allergic to being outdoors.",
      "Your weather prediction skills are like a broken umbrella - they're supposed to protect you but they just leave you soaked.",
      "You forecast weather like you're trying to conduct a meteorological orchestra using only confusion and inaccurate instruments.",
      "Your weather awareness is like a GPS with no signal - completely lost in the world of atmospheric conditions.",
      "You approach weather like you're following a forecast drawn by someone who thinks all weather patterns lead to disappointment.",
      "Your meteorological abilities are like a corrupted weather report - they're supposed to inform but they just confuse.",
      "You handle weather like you're trying to solve the mysteries of atmospheric science using only weather folklore and superstition.",
      "Your weather prediction skills are like a calculator with dead batteries - they don't compute temperature or precipitation accurately.",
      "You forecast weather like you're using advice from a meteorologist who learned everything from watching people get caught in storms.",
      "Your weather awareness is like a flat balloon at a weather station - deflated and disappointing.",
      "You approach weather like you're trying to write poetry using only incorrect forecasts and weather-related disasters.",
      "Your meteorological abilities are like a broken stopwatch - they don't measure weather patterns accurately.",
      "You handle weather like you're following forecasts that were translated through five different languages by people who've never been outside.",
      "Your weather prediction skills are like a corrupted weather map - they're supposed to show conditions but they just show confusion.",
      "You forecast weather like you're trying to perform meteorological surgery with weather instruments you don't understand.",
      "Your weather awareness is like a broken alarm clock - it's supposed to wake you up to changing conditions but it just causes weather anxiety.",
      "You approach weather like you're using a strategy guide for atmospheric conditions you've never experienced and don't want to understand.",
      "Your meteorological abilities are like a GPS that speaks only in ancient weather languages that modern forecasters don't understand.",
      "You handle weather like you're trying to build accurate predictions using only the worst possible meteorological methods.",
      "Your weather prediction skills are like a corrupted forecast model - they're supposed to predict conditions but they just create weather problems.",
      "You forecast weather like you're following a roadmap drawn by someone who thinks all weather roads lead to being unprepared.",
      "Your weather awareness is like a flat tire on the journey to meteorological understanding.",
      "You approach weather like you're trying to solve atmospheric physics using only weather apps and meteorological anxiety.",
      "Your meteorological abilities are like a broken promise to check the forecast.",
      "You handle weather like you're using a manual that was written by someone who thinks 'weather the storm' means you should be surprised by every storm.",
      "Your weather prediction skills are like a corrupted backup file - they're supposed to preserve forecast accuracy but they just create more weather problems.",
      "You forecast weather like you're trying to conduct a masterclass in how to make meteorology feel impossible.",
      "Your weather awareness is like a GPS with a dead battery - completely useless when you need atmospheric guidance most.",
      "You approach weather like you're following advice from a weather expert who learned everything from watching people get caught unprepared.",
      "Your meteorological abilities are like a broken compass in the wilderness of atmospheric uncertainty.",
      "You handle weather like you're trying to prove that the phrase 'weather permitting' means the weather will never permit anything for you.",
      "Your weather prediction skills are like a flat soda at a meteorological conference - no fizz and disappointing.",
      "You forecast weather like you're using a weather guide that was designed by someone who thinks atmospheric science should be as confusing as possible.",
      "Your weather awareness is like a corrupted weather tracking app - it's supposed to help you prepare but it just tracks your weather disasters.",
      "You approach weather like you're trying to solve a Rubik's cube while blindfolded and the cube is made of unpredictable weather patterns.",
      "Your meteorological abilities are like a broken scoreboard that only counts weather-related mistakes.",
      "You handle weather like you're following a strategy that was designed by someone who thinks being unprepared is the objective.",
      "Your weather prediction skills are like a corrupted atmospheric model - they're supposed to show weather patterns but they just show confusion.",
      "You forecast weather like you're trying to conduct a symphony using only the sound of meteorological failure.",
      "Your weather awareness is like a flat tire on the road to atmospheric preparedness.",
      "You approach weather like you're using a guidebook that was written by someone who thinks 'fair weather friend' describes your relationship with accurate forecasting.",
      "Your meteorological abilities are like a broken alarm clock - they're supposed to wake you up to weather changes but they just cause atmospheric anxiety.",
      "You handle weather like you're trying to prove that the phrase 'every cloud has a silver lining' doesn't apply to your weather predictions because your clouds only have confusion.",
      "Your weather prediction skills are like a corrupted family weather photo - they're supposed to capture atmospheric beauty but they just document meteorological disaster.",
      "You forecast weather like you're trying to redefine what it means to be meteorologically challenged."
    ]
  }