{
    "transformers_politics_war_jokes": [
        {
            "setup": "Why did Optimus Prime run for Cybertronian President?",
            "delivery": "Because his campaign slogan was 'Freedom is the right of all sentient beings... including your vote!'",
            "category": "Transformers Politics"
        },
        {
            "setup": "What's Megatron's favorite political strategy?",
            "delivery": "The 'Peace through Tyranny' platform - surprisingly unpopular with the electorate!",
            "category": "Transformers Politics"
        },
        {
            "setup": "Why did Starscream's presidential campaign fail?",
            "delivery": "Every time he gave a speech, he'd start with 'I should be leader!' and end with 'MEGATRON IS A FOOL!' - terrible for polling numbers.",
            "category": "Transformers Politics"
        },
        {
            "setup": "What's the Decepticon Party's official stance on healthcare?",
            "delivery": "Universal Energon coverage... as long as you pledge absolute loyalty to Megatron. Pre-existing conditions include Autobot sympathies.",
            "category": "Transformers Politics"
        },
        {
            "setup": "Why don't Autobots and Decepticons ever form a coalition government?",
            "delivery": "Because 'bipartisan cooperation' loses something when one party's platform is literally 'enslave the universe.'",
            "category": "Transformers Politics"
        },
        {
            "setup": "What happened when Shockwave tried to gerrymander Cybertron's districts?",
            "delivery": "He redrew the maps so perfectly logical that every district became a straight line, accidentally creating the 'Cube District' with 90-degree angles only.",
            "category": "Transformers Politics"
        },
        {
            "setup": "Why did Bumblebee get elected as Cybertron's youngest senator?",
            "delivery": "His campaign focused on 'rolling out' new policies and 'transforming' the economy. Plus, his debate opponent couldn't understand his speech impediment.",
            "category": "Transformers Politics"
        },
        {
            "setup": "What's the Autobot Party's foreign policy?",
            "delivery": "'Roll out to help our allies, but first let me consult the Matrix... okay, we're helping.'",
            "category": "Transformers Politics"
        },
        {
            "setup": "Why did Megatron veto the 'Cybertronian Environmental Protection Act'?",
            "delivery": "He claimed it would 'restrict Energon mining operations' and 'hurt Decepticon job creators.' Also, the act specifically banned planet-wide fusion cannon usage.",
            "category": "Transformers Politics"
        },
        {
            "setup": "What happened during the Great Energon Tax Debate of 2024?",
            "delivery": "Optimus proposed a progressive Energon tax, Megatron countered with 'taxation is theft,' and Starscream just kept screaming 'I SHOULD BE TREASURER!'",
            "category": "Transformers Politics"
        },
        {
            "setup": "Why did Soundwave become the most successful political strategist?",
            "delivery": "His ability to 'eavesdrop' on opposition communications gave his candidates a 100% polling advantage. Ethics committee still investigating.",
            "category": "Transformers Politics"
        },
        {
            "setup": "What's the Decepticon stance on gun control?",
            "delivery": "'The only thing that stops a bad guy with a fusion cannon is a good guy with a bigger fusion cannon.' - Megatron at the NRA convention.",
            "category": "Transformers Politics"
        },
        {
            "setup": "Why did Ultra Magnus lose the Cybertronian mayoral race?",
            "delivery": "His campaign slogan was 'I can't deal with that now' - not exactly inspiring confidence in crisis management.",
            "category": "Transformers Politics"
        },
        {
            "setup": "What was the outcome of the Autobot-Decepticon Peace Summit?",
            "delivery": "They agreed to disagree, then immediately accused each other of bad faith when Megatron's fusion cannon 'accidentally' discharged during the handshake photo op.",
            "category": "Transformers Politics"
        },
        {
            "setup": "Why did Wheeljack's political career end after one term?",
            "delivery": "Every policy he proposed ended with '...and then it exploded.' The healthcare plan literally exploded. Twice.",
            "category": "Transformers Politics"
        },
        {
            "setup": "What's the Decepticon immigration policy?",
            "delivery": "Welcome to New Kaon! Please form orderly lines for processing... into the smelting pits.",
            "category": "Transformers Politics"
        },
        {
            "setup": "Why did Ratchet refuse to run for office?",
            "delivery": "'I'm a medic, not a politician. Besides, have you seen the state of Cybertron's healthcare system? I need 6 million years just to fix that mess!'",
            "category": "Transformers Politics"
        },
        {
            "setup": "What happened when the Constructicons tried to build a border wall?",
            "delivery": "They accidentally built it around their own headquarters. Devastator couldn't figure out how to get to his own campaign office.",
            "category": "Transformers Politics"
        },
        {
            "setup": "Why did Optimus Prime's infrastructure bill fail in the Senate?",
            "delivery": "Megatron filibustered for 47 hours straight about how 'roads are for Autobot scum' while occasionally firing warning shots at the ceiling.",
            "category": "Transformers Politics"
        },
        {
            "setup": "What's Starscream's position on term limits?",
            "delivery": "'Term limits are for leaders who DON'T deserve to rule forever!' - His 47th consecutive term as Air Commander.",
            "category": "Transformers Politics"
        },
        {
            "setup": "Why did the Cybertronian Supreme Court ruling on Energon corporations cause chaos?",
            "delivery": "They ruled that 'corporations are people too' - now Unicron is technically a person and demanding voting rights.",
            "category": "Transformers Politics"
        },
        {
            "setup": "Why did Perceptor's science funding bill get rejected?",
            "delivery": "Lawmakers claimed his research into 'miniaturization technology' was just an excuse to make smaller versions of himself to filibuster faster.",
            "category": "Transformers Politics"
        },
        {
            "setup": "What's the Autobot Party's position on campaign finance reform?",
            "delivery": "'All campaign contributions must be transparent... unless they're from the Matrix, which technically doesn't exist as a legal entity.'",
            "category": "Transformers Politics"
        },
        {
            "setup": "Why did Blaster lose the Cybertronian Communications Commission chairmanship?",
            "delivery": "He kept interrupting hearings with 'Autobots, transform and roll out!' over the emergency broadcast system.",
            "category": "Transformers Politics"
        },
        {
            "setup": "What happened when the Decepticons tried to unionize?",
            "delivery": "Megatron personally crushed the union because 'collective bargaining interferes with my tyranny.' The union rep was Starscream, so no great loss.",
            "category": "Transformers Politics"
        },
        {
            "setup": "Why did Ironhide's agricultural subsidy bill fail?",
            "delivery": "He proposed growing organic Energon on farms. The committee asked what farms exist on Cybertron. Ironhide responded 'That's why we need subsidies!'",
            "category": "Transformers Politics"
        },
        {
            "setup": "What's the Decepticon education policy?",
            "delivery": "'Education is important. That's why every Decepticon must memorize Megatron's speeches. Critical thinking is treason.'",
            "category": "Transformers Politics"
        },
        {
            "setup": "Why did Jazz's cultural appropriation bill cause controversy?",
            "delivery": "He wanted to appropriate Earth culture by transforming into a boombox. The committee said that was just his alt-mode. Jazz replied 'Exactly!'",
            "category": "Transformers Politics"
        },
        {
            "setup": "What happened during the Cybertronian Census?",
            "delivery": "They couldn't count the Decepticons because half were in the hospital from Starscream-related injuries and the other half were plotting coups.",
            "category": "Transformers Politics"
        },
        {
            "setup": "Why did Kup's veterans' benefits bill get tabled indefinitely?",
            "delivery": "He kept referring to 'back in my day' and the committee fell asleep during his 6-hour speech about the Quintesson Wars.",
            "category": "Transformers Politics"
        },
        {
            "setup": "What's the Decepticon energy policy?",
            "delivery": "'Drill baby drill... into other planets, strip them of resources, and leave them as lifeless husks. It's the American way!' - Megatron, confusing planets.",
            "category": "Transformers Politics"
        },
        {
            "setup": "Why did Tracks' infrastructure beautification project fail?",
            "delivery": "He wanted to add racing stripes to all public buildings. The budget committee said that wasn't infrastructure. Tracks called them 'philistines.'",
            "category": "Transformers Politics"
        },
        {
            "setup": "What was the outcome of the Cybertronian Electoral College debate?",
            "delivery": "They couldn't decide if each Transformer should count as one vote, or if combiner teams should count as five. Devastator demanded 6 votes.",
            "category": "Transformers Politics"
        },
        {
            "setup": "Why did Sunstreaker's vanity tax proposal get laughed out of committee?",
            "delivery": "He wanted to tax anyone who wasn't as beautiful as him. The committee pointed out that would tax 99.9% of Cybertron. Sunstreaker said 'Exactly!'",
            "category": "Transformers Politics"
        },
        {
            "setup": "What's the Autobot position on net neutrality?",
            "delivery": "'All data should be treated equally... unless it's Decepticon propaganda, which should be blocked by Omega Supreme firewalls.'",
            "category": "Transformers Politics"
        },
        {
            "setup": "Why did Powerglide's aviation bill never take off?",
            "delivery": "He proposed mandatory flight training for all Cybertronians. The committee asked how that would work for triple-changers. Powerglide transformed and flew away.",
            "category": "Transformers Politics"
        },
        {
            "setup": "What happened when the Decepticons tried to register as a political party?",
            "delivery": "Their platform was just 'Conquer everything' written in blood. The registrar asked if they had any other policies. They added 'Also, destroy Autobots.'",
            "category": "Transformers Politics"
        },
        {
            "setup": "Why did Hound's environmental protection bill face opposition?",
            "delivery": "He wanted to preserve Earth's natural beauty. The committee said Cybertron has no environment to protect. Hound showed them pictures of Earth and they voted yes.",
            "category": "Transformers Politics"
        },
        {
            "setup": "What's the Decepticon criminal justice reform?",
            "delivery": "'Justice reform: If you're not a Decepticon, you're guilty. If you are a Decepticon, you're innocent. Unless you're Starscream, then you're always guilty.'",
            "category": "Transformers Politics"
        },
        {
            "setup": "Why did Sideswipe's sports funding bill get sidelined?",
            "delivery": "He proposed Cybertronian Olympics with events like 'Fastest Transformation' and 'Best Megatron Impression.' The committee couldn't agree on judging criteria.",
            "category": "Transformers Politics"
        },
        {
            "setup": "What was the Great Cybertronian Shutdown of 2024?",
            "delivery": "The government shut down because Megatron refused to fund anything that didn't include 'Death to Autobots' in the budget. The Autobots used the time to actually fix things.",
            "category": "Transformers Politics"
        },
        {
            "setup": "Why did Cliffjumper's minimum wage bill explode?",
            "delivery": "Literally. He got so angry during the debate that his explosive personality caused his own podium to detonate. The bill died with the podium.",
            "category": "Transformers Politics"
        },
        {
            "setup": "What's the Autobot housing policy?",
            "delivery": "'Every Transformer deserves a place to park... I mean live. Preferably not in vehicle mode, but we're working on it.' - Optimus Prime, confused about housing.",
            "category": "Transformers Politics"
        },
        {
            "setup": "Why did Windcharger's electromagnetic pulse regulation bill short-circuit?",
            "delivery": "He kept accidentally activating his own powers during testimony, causing power outages in the entire legislative building.",
            "category": "Transformers Politics"
        },
        {
            "setup": "What happened during the Decepticon primary debates?",
            "delivery": "All candidates agreed on destroying the Autobots, then spent 3 hours arguing about the best way to do it. The winner was 'whoever can defeat Starscream's betrayal.'",
            "category": "Transformers Politics"
        },
        {
            "setup": "Why did Mirage's transparency bill vanish into thin air?",
            "delivery": "He proposed making all government actions visible to citizens. The bill mysteriously disappeared after he demonstrated his invisibility powers.",
            "category": "Transformers Politics"
        },
        {
            "setup": "What's the Decepticon economic stimulus plan?",
            "delivery": "'We'll stimulate the economy by conquering planets and stealing their resources. It's trickle-down tyranny!' - Megatron, economist.",
            "category": "Transformers Politics"
        },
        {
            "setup": "Why did Bluestreak's gun control bill trigger opposition?",
            "delivery": "He talked so much during the presentation that the committee ran out of time to vote. His filibuster was literally just his normal speaking speed.",
            "category": "Transformers Politics"
        },
        {
            "setup": "What was the Cybertronian equivalent of Brexit?",
            "delivery": "Cybexit: When the Decepticons tried to leave Cybertron but couldn't agree on who would pilot the ship. Starscream volunteered and everyone voted to stay.",
            "category": "Transformers Politics"
        },
        {
            "setup": "Why did Smokescreen's campaign finance reform bill disappear in a cloud of smoke?",
            "delivery": "He used his smoke powers to obscure the vote count. When the smoke cleared, the bill had somehow transformed into a Decepticon campaign donation.",
            "category": "Transformers Politics"
        },
        {
            "setup": "What's the Autobot position on artificial intelligence rights?",
            "delivery": "'All sentient beings deserve rights... except the Decepticons. They're more artificial than intelligent.' - Optimus Prime, creating policy loopholes.",
            "category": "Transformers Politics"
        },
        {
            "setup": "Why did Grapple's urban planning commission get demolished?",
            "delivery": "He wanted to build the perfect city but kept getting into arguments about whether buildings should transform into robots. The commission transformed into chaos.",
            "category": "Transformers Politics"
        },
        {
            "setup": "What happened when the Decepticons tried to filibuster?",
            "delivery": "Megatron's filibuster lasted 47 hours because he kept monologuing about his greatness. The Autobots used the time to pass every bill he'd been blocking.",
            "category": "Transformers Politics"
        },
        {
            "setup": "Why did Hoist's infrastructure repair bill get stuck?",
            "delivery": "He kept trying to tow the broken political system to the repair shop, but it was too heavy with corruption. Even his tow cable couldn't handle it.",
            "category": "Transformers Politics"
        },
        {
            "setup": "What's the Decepticon social media policy?",
            "delivery": "'All posts must praise Megatron. Likes are mandatory. Dislikes are punishable by fusion cannon.' - Terms of Service, Decepticon Twitter.",
            "category": "Transformers Politics"
        },
        {
            "setup": "Why did Red Alert's national security bill trigger a lockdown?",
            "delivery": "He got so paranoid about potential threats that he locked down the entire government. The threat was his own bill.",
            "category": "Transformers Politics"
        },
        {
            "setup": "What was the outcome of the Great Energon Pipeline Debate?",
            "delivery": "The Autobots wanted to build it safely, the Decepticons wanted to steal it, and Starscream wanted to redirect it to his house. The pipeline burst from indecision.",
            "category": "Transformers Politics"
        },
        {
            "setup": "Why did Inferno's fire safety regulations bill combust?",
            "delivery": "He got too passionate during his presentation and literally set the bill on fire with his enthusiasm. The fire department voted against it.",
            "category": "Transformers Politics"
        },
        {
            "setup": "What's the Autobot position on universal basic Energon?",
            "delivery": "'Every Transformer deserves enough Energon to function... unless you're a Decepticon, then you deserve to function poorly.' - Optimus Prime, policy maker.",
            "category": "Transformers Politics"
        },
        {
            "setup": "Why did Warpath's defense spending bill go ballistic?",
            "delivery": "He kept punctuating his speech with 'KA-BLAM!' every time he mentioned budget increases. The committee thought he was having mechanical seizures.",
            "category": "Transformers Politics"
        },
        {
            "setup": "What happened during the Cybertronian Electoral College certification?",
            "delivery": "Megatron objected to every Autobot vote by firing his fusion cannon at the vote counters. The certification lasted 3 weeks and 847 objections.",
            "category": "Transformers Politics"
        },
        {
            "setup": "Why did Beachcomber's renewable energy bill wash away?",
            "delivery": "He proposed using tidal energy from Cybertron's non-existent oceans. When told Cybertron has no water, he said 'That's why we need the bill!'",
            "category": "Transformers Politics"
        },
        {
            "setup": "What's the Decepticon position on government transparency?",
            "delivery": "'The government is perfectly transparent. You can see right through our lies... wait, that's not what we meant.' - Megatron, clarifying.",
            "category": "Transformers Politics"
        },
        {
            "setup": "Why did Seaspray's maritime law bill sink?",
            "delivery": "He kept insisting Cybertron needed maritime law despite having no seas. The committee said his argument didn't hold water.",
            "category": "Transformers Politics"
        },
        {
            "setup": "What was the Cybertronian equivalent of a government shutdown?",
            "delivery": "When Megatron and Optimus couldn't agree on the budget, they just shut down the government and continued fighting. It was Tuesday.",
            "category": "Transformers Politics"
        },
        {
            "setup": "Why did Cosmos' space exploration funding bill never launch?",
            "delivery": "He wanted to explore the universe for new allies. The committee asked why he kept getting lost in Earth's orbit. He said he was 'scouting ahead.'",
            "category": "Transformers Politics"
        },
        {
            "setup": "What's the Decepticon position on climate change?",
            "delivery": "'Climate change is a hoax perpetrated by Autobot scientists... unless it helps us conquer planets, then it's real and useful.' - Megatron, scientist.",
            "category": "Transformers Politics"
        },
        {
            "setup": "Why did Powerglide's aviation safety regulations stall?",
            "delivery": "He kept demonstrating unsafe flying during the presentation. The committee grounded the bill... and Powerglide.",
            "category": "Transformers Politics"
        },
        {
            "setup": "What happened during the Cybertronian State of the Union address?",
            "delivery": "Optimus gave a hopeful speech about unity. Megatron responded by declaring war. It was the most productive State of the Union in Cybertronian history.",
            "category": "Transformers Politics"
        },
        {
            "setup": "Why did Megatron's military strategy during the Battle of Autobot City fail?",
            "delivery": "Step 1: Monologue for 20 minutes about the glory of Decepticons. Step 2: Get distracted by Starscream's treachery. Step 3: Lose anyway.",
            "category": "Transformers War"
        },
        {
            "setup": "Why did the Autobots always win despite being outnumbered?",
            "delivery": "Because Decepticon military planning involves 90% internal backstabbing and 10% actual fighting. Starscream's betrayal count: 847 and rising.",
            "category": "Transformers War"
        },
        {
            "setup": "What's the most effective Decepticon military tactic?",
            "delivery": "The 'Retreat and Blame Starscream' maneuver - surprisingly effective at preserving troops while maintaining plausible deniability.",
            "category": "Transformers War"
        },
        {
            "setup": "Why did the Autobot medic corps have a 100% success rate?",
            "delivery": "Ratchet's battlefield triage: 'If you're still sparking, you're fine. If you're not, you're scrap. Next patient!'",
            "category": "Transformers War"
        },
        {
            "setup": "What happened when the Decepticons tried to use human military tactics?",
            "delivery": "They read Sun Tzu's 'Art of War' and concluded that Starscream embodies 'know yourself, know your enemy' - he's both his own worst enemy AND everyone else's.",
            "category": "Transformers War"
        },
        {
            "setup": "Why did the Battle of Chicago last exactly 3 hours and 47 minutes?",
            "delivery": "That's how long it took Optimus to finish his inspirational speech, punch Megatron through a building, and remember he had a flight mode the whole time.",
            "category": "Transformers War"
        },
        {
            "setup": "What's the Decepticon equivalent of 'friendly fire'?",
            "delivery": "'Starscream fire' - when your second-in-command shoots you in the back for the 847th time and claims it was 'accidental targeting error.'",
            "category": "Transformers War"
        },
        {
            "setup": "Why did the Autobot special forces always succeed?",
            "delivery": "Because when your team includes a ninja-bot, a samurai-bot, and a dinosaur-bot, failure isn't really an option. It's just Tuesday.",
            "category": "Transformers War"
        },
        {
            "setup": "What was Shockwave's contribution to Decepticon military intelligence?",
            "delivery": "He created a perfectly logical battle plan that accounted for every variable except 'Starscream will definitely betray us again.' The plan lasted 3.7 seconds.",
            "category": "Transformers War"
        },
        {
            "setup": "Why did the Autobots never need a military draft?",
            "delivery": "'Volunteer for the Autobot cause!' sounds way better than 'Join the Decepticons or we'll melt you down for spare parts.' Different recruitment strategies.",
            "category": "Transformers War"
        },
        {
            "setup": "What happened when the Decepticons tried to use espionage?",
            "delivery": "Soundwave's infiltration was perfect until he started referring to himself in the third person. 'Soundwave superior, Autobots inferior' tends to blow your cover.",
            "category": "Transformers War"
        },
        {
            "setup": "Why did the Autobot-Decepticon ceasefire talks always fail?",
            "delivery": "They'd agree to terms, shake hands, then Megatron would immediately start charging his fusion cannon while claiming it was 'just for ceremonial purposes.'",
            "category": "Transformers War"
        },
        {
            "setup": "What's the most devastating weapon in the Transformers arsenal?",
            "delivery": "Optimus Prime's motivational speeches - they can turn a losing battle into a victory while making you feel guilty about not believing hard enough.",
            "category": "Transformers War"
        },
        {
            "setup": "Why did the Decepticon navy never succeed?",
            "delivery": "Turns out that 'submarine mode' isn't very effective when your entire fleet is made of giant robots who sink immediately. Who knew metal doesn't float?",
            "category": "Transformers War"
        },
        {
            "setup": "What was the outcome of the Great Energon Wars?",
            "delivery": "Millions of years of fighting over glowing blue juice, and the solution was literally just 'find a new planet with more juice.' Advanced alien robots, everyone.",
            "category": "Transformers War"
        },
        {
            "setup": "Why did the Autobots always win the propaganda war?",
            "delivery": "'Freedom is the right of all sentient beings' vs. 'All hail Megatron or die horribly.' Surprisingly, one tested better with focus groups.",
            "category": "Transformers War"
        },
        {
            "setup": "What's the Decepticon version of 'rules of engagement'?",
            "delivery": "Rule 1: There are no rules. Rule 2: If there were rules, Starscream would break them. Rule 3: Blame any failures on Starscream regardless of actual involvement.",
            "category": "Transformers War"
        },
        {
            "setup": "Why did the Battle of Cybertron last 4 million years?",
            "delivery": "Both sides kept getting distracted by Starscream's daily betrayals, Megatron's monologues, and Optimus's speeches about hope. Plus, someone kept forgetting to set their alarm for the final battle.",
            "category": "Transformers War"
        },
        {
            "setup": "What happened when the Decepticons tried to use biological warfare?",
            "delivery": "They weaponized the common cold. The Autobots just got slightly runny energon dispensers for a week. Medical science is hard when you're made of metal.",
            "category": "Transformers War"
        },
        {
            "setup": "Why did the Autobot military academy have a 100% graduation rate?",
            "delivery": "'Today we learn about courage, honor, and how to dodge Megatron's fusion cannon while giving an inspirational speech.' Everyone passed the final exam.",
            "category": "Transformers War"
        },
        {
            "setup": "What's the most common Decepticon military injury?",
            "delivery": "Starscream-induced back wounds. The medical corps has a special form for it: 'Injury Code 847-S: Treachery-related laser blast to dorsal plating.'",
            "category": "Transformers War"
        },
        {
            "setup": "Why did the Autobots never need military intelligence?",
            "delivery": "Because Decepticon plans were so predictable: Step 1 - Monologue. Step 2 - Betray someone. Step 3 - Lose anyway. Step 4 - Blame Starscream.",
            "category": "Transformers War"
        },
        {
            "setup": "What was the Decepticon plan for world domination?",
            "delivery": "Step 1: Find Earth. Step 2: Monologue about destroying Earth. Step 3: Get distracted by Energon. Step 4: Lose to a truck and his friends. Repeat for 40 years.",
            "category": "Transformers War"
        },
        {
            "setup": "Why did the Autobot-Decepticon peace treaty last exactly 12 minutes?",
            "delivery": "That's how long it took for someone to mention Energon distribution, Megatron to call dibs on everything, and Optimus to remember why they were fighting in the first place.",
            "category": "Transformers War"
        },
        {
            "setup": "What's the Decepticon equivalent of 'victory conditions'?",
            "delivery": "'When Megatron says we've won, regardless of actual battlefield status, and Starscream hasn't betrayed us yet.' So basically never.",
            "category": "Transformers War"
        },
        {
            "setup": "Why did the Autobots always have superior logistics?",
            "delivery": "Wheeljack's inventions worked exactly as intended 23% of the time, but that was still better than Decepticon logistics which involved 90% Starscream complaining and 10% actual supply management.",
            "category": "Transformers War"
        },
        {
            "setup": "What happened when the Decepticons tried to use psychological warfare?",
            "delivery": "They broadcast Megatron's speeches 24/7. The Autobots just used them as white noise for meditation. Turns out 4 million years of the same monologue loses its psychological impact.",
            "category": "Transformers War"
        },
        {
            "setup": "Why did the Autobot medical corps never run out of supplies?",
            "delivery": "Because Decepticon attacks were so predictable that Ratchet could schedule repairs during their monologues. 'Megatron's at minute 12 of his speech, time for Bumblebee's tune-up!'",
            "category": "Transformers War"
        },
        {
            "setup": "What's the Decepticon military budget allocation?",
            "delivery": "60% fusion cannons, 30% Starscream replacement parts, 9% Energon, 1% actual strategy. The strategy line item keeps getting cut for more cannons.",
            "category": "Transformers War"
        },
        {
            "setup": "Why did the Great War end with a dance-off?",
            "delivery": "After 4 million years, both sides agreed that whoever had the sickest moves would win Cybertron. Jazz vs. Soundwave in the ultimate breakdancing battle. The universe was saved by funk.",
            "category": "Transformers War"
        },
        {
            "setup": "Why did the Combaticons' coordinated attack fail?",
            "delivery": "They spent so long arguing about who would form which limb that the Autobots had time to build fortifications. Bruticus ended up with two left arms and no legs.",
            "category": "Transformers War"
        },
        {
            "setup": "What happened when the Aerialbots tried air superiority tactics?",
            "delivery": "They dominated the skies until someone pointed out Cybertron has no atmosphere. Silverbolt crashed into the non-existent stratosphere.",
            "category": "Transformers War"
        },
        {
            "setup": "Why did the Protectobots' defensive strategy backfire?",
            "delivery": "They formed a defensive perimeter so tight that they couldn't actually fight back. The Decepticons just walked around them and took the city anyway.",
            "category": "Transformers War"
        },
        {
            "setup": "What's the most confusing Decepticon military rank?",
            "delivery": "'Temporary Supreme Commander (Until Starscream Betrays Me)' - a position currently held by 847 different Decepticons, all named Starscream.",
            "category": "Transformers War"
        },
        {
            "setup": "Why did the Dinobots' shock and awe tactics work too well?",
            "delivery": "They shocked and awed themselves by accidentally stepping on their own teammates. Grimlock declared it 'best plan ever' because it confused the enemy.",
            "category": "Transformers War"
        },
        {
            "setup": "What happened when the Decepticons tried trench warfare?",
            "delivery": "They dug trenches so deep they reached Cybertron's core and accidentally woke up Primus. The war paused while everyone apologized to their planet.",
            "category": "Transformers War"
        },
        {
            "setup": "Why did the Autobot artillery corps have perfect accuracy?",
            "delivery": "They only fired when Megatron was monologuing, creating a predictable 20-minute window where he stood perfectly still to deliver speeches.",
            "category": "Transformers War"
        },
        {
            "setup": "What's the Decepticon version of a military parade?",
            "delivery": "Marching in perfect formation while Starscream flies overhead plotting betrayal. The parade ends when Starscream inevitably attacks the parade.",
            "category": "Transformers War"
        },
        {
            "setup": "Why did the Autobot scouts always return with intelligence?",
            "delivery": "Because the Decepticons posted their battle plans on Decepti-Twitter. 'About to attack Autobot base at 3pm, don't tell anyone!' #EvilPlans",
            "category": "Transformers War"
        },
        {
            "setup": "What happened when the Decepticons tried guerrilla warfare?",
            "delivery": "They painted themselves green and hid in Cybertron's non-existent jungle. The Autobots found them immediately because giant robots don't blend in.",
            "category": "Transformers War"
        },
        {
            "setup": "Why did the Autobot medics never run out of patients?",
            "delivery": "Because the Decepticons kept creating new injuries with their 'friendly fire incidents' (see Starscream, definition of).",
            "category": "Transformers War"
        },
        {
            "setup": "What's the most effective Decepticon battle formation?",
            "delivery": "The 'V' formation - for 'Victory' or 'Very likely to be betrayed by Starscream.' Both interpretations are equally accurate.",
            "category": "Transformers War"
        },
        {
            "setup": "Why did the Stunticons' high-speed assault crash and burn?",
            "delivery": "They went so fast they crashed into their own battle plan. Motormaster claimed it was a 'tactical collision with enemy strategy.'",
            "category": "Transformers War"
        },
        {
            "setup": "What happened when the Technobots tried calculated warfare?",
            "delivery": "Computron calculated 847 different battle scenarios, all ending with Starscream's betrayal. They spent the battle doing probability equations instead of fighting.",
            "category": "Transformers War"
        },
        {
            "setup": "Why did the Autobot snipers never miss?",
            "delivery": "They aimed for Megatron's ego - the largest target on any battlefield. Even Starscream couldn't miss that.",
            "category": "Transformers War"
        },
        {
            "setup": "What's the Decepticon military's favorite weather condition?",
            "delivery": "Solar storms - they make Starscream's betrayal harder to detect because everyone's circuits are already scrambled.",
            "category": "Transformers War"
        },
        {
            "setup": "Why did the Autobot engineers always win siege warfare?",
            "delivery": "They built fortifications using Decepticon monologues as structural support - Megatron's speeches were long enough to span any gap.",
            "category": "Transformers War"
        },
        {
            "setup": "What happened when the Decepticons tried night operations?",
            "delivery": "They forgot Cybertron has no day/night cycle. The Autobots just turned off the lights and watched them bump into each other for 6 hours.",
            "category": "Transformers War"
        },
        {
            "setup": "Why did the Autobot communications always work perfectly?",
            "delivery": "Because the Decepticons jammed their own signals by having Starscream scream over every radio channel about his inevitable betrayal.",
            "category": "Transformers War"
        },
        {
            "setup": "What's the most feared weapon in Decepticon arsenal?",
            "delivery": "Starscream's loyalty - it's so unpredictable it could backfire on anyone, including Starscream himself.",
            "category": "Transformers War"
        },
        {
            "setup": "Why did the Autobot demolition teams never destroy the wrong target?",
            "delivery": "They just followed Starscream's laser blasts - wherever he was shooting from was clearly the Decepticon command center.",
            "category": "Transformers War"
        },
        {
            "setup": "What happened when the Decepticons tried amphibious assaults?",
            "delivery": "They sank immediately because Cybertron has no water. The assault became an underground operation when they tunneled to the planet's core instead.",
            "category": "Transformers War"
        },
        {
            "setup": "Why did the Autobot supply lines never break?",
            "delivery": "Because the Decepticons were too busy forming supply lines of their own - all leading to Starscream's inevitable coup attempt.",
            "category": "Transformers War"
        },
        {
            "setup": "What's the Decepticon military's motto?",
            "delivery": "'Victory through superior firepower... and by blaming Starscream when that doesn't work.' - Official Decepticon Field Manual, page 847.",
            "category": "Transformers War"
        },
        {
            "setup": "Why did the Autobot flanking maneuvers always succeed?",
            "delivery": "Because the Decepticons were always looking backward to check if Starscream was about to betray them. Flanking became front-al attacking.",
            "category": "Transformers War"
        },
        {
            "setup": "What happened when the Decepticons tried psychological warfare?",
            "delivery": "They tried to demoralize Autobots by broadcasting Starscream's betrayal statistics. The Autobots found it oddly comforting and motivational.",
            "category": "Transformers War"
        },
        {
            "setup": "Why did the Autobot heavy artillery always have perfect timing?",
            "delivery": "They synchronized their attacks with Megatron's dramatic pauses during monologues. His ego provided the perfect timing mechanism.",
            "category": "Transformers War"
        },
        {
            "setup": "What's the Decepticon version of a military tribunal?",
            "delivery": "'Court is now in session. The defendant is accused of not being Starscream. Verdict: Guilty of not causing enough betrayal.'",
            "category": "Transformers War"
        },
        {
            "setup": "Why did the Autobot rapid response teams always arrive first?",
            "delivery": "Because the Decepticons spent the first 20 minutes of every battle arguing about Starscream's latest betrayal. By the time they finished, the battle was over.",
            "category": "Transformers War"
        },
        {
            "setup": "What happened when the Decepticons tried winter warfare?",
            "delivery": "They froze solid because Cybertron has no seasons. The Autobots just chipped them out and used them as ice sculptures of defeat.",
            "category": "Transformers War"
        },
        {
            "setup": "Why did the Autobot reconnaissance always return accurate intel?",
            "delivery": "Because the Decepticons posted their battle plans on Decepti-Book with location tags. 'About to attack this specific base at these exact coordinates!'",
            "category": "Transformers War"
        },
        {
            "setup": "What's the most reliable Decepticon military strategy?",
            "delivery": "'Plan for Starscream's betrayal, then plan for the betrayal of that plan, then get betrayed anyway.' - Advanced Military Theory, Decepticon Academy.",
            "category": "Transformers War"
        },
        {
            "setup": "Why did the Autobot defensive perimeters never fail?",
            "delivery": "Because the Decepticons kept testing them by sending Starscream to 'negotiate' - his betrayal attempts became free perimeter testing.",
            "category": "Transformers War"
        },
        {
            "setup": "What happened when the Decepticons tried chemical warfare?",
            "delivery": "They created a gas that made Transformers tell the truth. The entire Decepticon army immediately confessed to 847 different betrayals.",
            "category": "Transformers War"
        },
        {
            "setup": "Why did the Autobot command structure never collapse?",
            "delivery": "Because Optimus Prime's leadership was so inspirational that even Decepticons considered defecting. Megatron considered this a 'tactical advantage' somehow.",
            "category": "Transformers War"
        },
        {
            "setup": "What's the Decepticon version of military intelligence?",
            "delivery": "'Intelligence suggests Starscream will betray us. Source: It's Tuesday.' - Daily Decepticon Intelligence Briefing.",
            "category": "Transformers War"
        },
        {
            "setup": "Why did the Autobot air support always arrive on time?",
            "delivery": "Because the Decepticon air force was grounded by Starscream's daily mutiny meetings. Aerialbots had the skies to themselves.",
            "category": "Transformers War"
        },
        {
            "setup": "What happened when the Decepticons tried siege warfare?",
            "delivery": "They laid siege to an Autobot base for 4 million years, forgetting that Autobots can just transform and drive away. The siege ended when they ran out of Energon.",
            "category": "Transformers War"
        },
        {
            "setup": "Why did the Autobot engineers always win the war of attrition?",
            "delivery": "Because they built repair bays faster than the Decepticons could create Starscream betrayal incidents. Supply exceeded demand for treachery.",
            "category": "Transformers War"
        },
        {
            "setup": "What's the Decepticon version of a ceasefire?",
            "delivery": "'We cease firing... at Autobots... temporarily... while we deal with Starscream's latest betrayal... then resume firing at everyone.' - Standard ceasefire terms.",
            "category": "Transformers War"
        },
        {
            "setup": "Why did the Autobot special operations always succeed?",
            "delivery": "Because the Decepticons were too busy conducting special operations against Starscream to notice the Autobots conducting actual special operations.",
            "category": "Transformers War"
        },
        {
            "setup": "What happened when the Decepticons tried blitzkrieg tactics?",
            "delivery": "They blitzed so quickly they outran their own battle plan, which Starscream was carrying. The blitzkrieg became a 'where did we put our strategy' maneuver.",
            "category": "Transformers War"
        },
        {
            "setup": "Why did the Autobot medical evacuation teams never lose a patient?",
            "delivery": "Because the Decepticons were too busy evacuating their own betrayers to interfere. Starscream evacuation became a full-time job.",
            "category": "Transformers War"
        },
        {
            "setup": "What's the most successful Decepticon military campaign?",
            "delivery": "'The Great Starscream Hunt of 2024' - they successfully hunted down and defeated Starscream's betrayal... for 3.7 seconds before he betrayed again.",
            "category": "Transformers War"
        },
        {
            "setup": "Why did the Autobot heavy armor divisions always roll to victory?",
            "delivery": "Because they rolled right over the Decepticons who were standing still arguing about Starscream's latest betrayal. Armor > Angry arguing.",
            "category": "Transformers War"
        },
        {
            "setup": "What happened when the Decepticons tried guerrilla tactics?",
            "delivery": "They became actual gorillas and pounded their chests. The Autobots were so confused they won by default while the Decepticons figured out how to transform back.",
            "category": "Transformers War"
        },
        {
            "setup": "Why did the Autobot commandos never fail a mission?",
            "delivery": "Because the Decepticon command structure was too busy commanding each other to stop Starscream to notice actual commandos. Mission accomplished by distraction.",
            "category": "Transformers War"
        },
        {
            "setup": "What's the Decepticon version of military discipline?",
            "delivery": "'Discipline is important. That's why we discipline Starscream 847 times per day. He keeps volunteering for the position.' - Decepticon Military Code.",
            "category": "Transformers War"
        },
        {
            "setup": "Why did the Autobot mechanized infantry always advance successfully?",
            "delivery": "Because the Decepticons mechanized their infantry into arguing machines that spent the battle debating Starscream's loyalty. Advance while they argue.",
            "category": "Transformers War"
        },
        {
            "setup": "What happened when the Decepticons tried electronic warfare?",
            "delivery": "They hacked their own systems to prevent Starscream's betrayal. The hack was so successful they couldn't access their own battle plans. Victory by self-sabotage.",
            "category": "Transformers War"
        },
        {
            "setup": "Why did the Autobot armored divisions always break through?",
            "delivery": "Because the Decepticon defensive lines were too busy defending against Starscream's inevitable betrayal to notice actual armored divisions. Breakthrough achieved.",
            "category": "Transformers War"
        },
        {
            "setup": "What's the Decepticon version of a military victory?",
            "delivery": "'We won! Wait, Starscream just betrayed us. Now we lost. Actually, we won again because Starscream betrayed the betrayers. Victory achieved through betrayal inception!'",
            "category": "Transformers War"
        },
        {
            "setup": "What's the difference between Optimus Prime and a motivational speaker?",
            "delivery": "At least the motivational speaker eventually stops talking about freedom. Optimus has been giving the same speech for 40 years.",
            "category": "Transformers Roast"
        },
        {
            "setup": "Why does Megatron keep losing to Optimus?",
            "delivery": "Because for a 'tactical genius,' his entire strategy is 'point fusion cannon, miss completely, scream about Prime.'",
            "category": "Transformers Roast"
        },
        {
            "setup": "What's Starscream's actual superpower?",
            "delivery": "The ability to fail at betrayal so consistently that it's statistically impossible. Even coin flips have better odds.",
            "category": "Transformers Roast"
        },
        {
            "setup": "Why doesn't Bumblebee talk?",
            "delivery": "Because even his voice box got tired of being the designated 'kid appeal' character in a war about genocide.",
            "category": "Transformers Roast"
        },
        {
            "setup": "What's Ironhide's biggest weakness?",
            "delivery": "His complete inability to solve any problem without suggesting 'we use bigger guns.' Diplomacy died with this guy.",
            "category": "Transformers Roast"
        },
        {
            "setup": "Why did Jazz die in the movie?",
            "delivery": "Because being 'cool' isn't bulletproof, and Michael Bay needed to prove he could kill anyone except the toyetic main characters.",
            "category": "Transformers Roast"
        },
        {
            "setup": "What's Ratchet's medical specialty?",
            "delivery": "Patching up plot holes with random gadgets while complaining about everyone else's battle damage. He's basically space WebMD.",
            "category": "Transformers Roast"
        },
        {
            "setup": "Why does Wheeljack's lab keep exploding?",
            "delivery": "Because 'innovation' apparently means 'what if we made everything into a bomb, but like, science-y?'",
            "category": "Transformers Roast"
        },
        {
            "setup": "What's Prowl's personality like?",
            "delivery": "Imagine if a spreadsheet gained sentience and decided to be aggressively boring about military tactics.",
            "category": "Transformers Roast"
        },
        {
            "setup": "Why does Ultra Magnus keep getting passed over for leadership?",
            "delivery": "Because 'I can't deal with that now' isn't exactly inspiring when your planet is literally being eaten by a giant robot.",
            "category": "Transformers Roast"
        },
        {
            "setup": "What's Grimlock's IQ?",
            "delivery": "Somewhere between 'me Grimlock king' and 'me Grimlock need instructions for door.' The Dinobots were a mistake.",
            "category": "Transformers Roast"
        },
        {
            "setup": "Why does Soundwave never show his face?",
            "delivery": "Because even he knows looking like a walking boombox with a visor was a design choice made during someone's edgy phase.",
            "category": "Transformers Roast"
        },
        {
            "setup": "What's Shockwave's actual shock?",
            "delivery": "That anyone takes his 'logic' seriously when his entire plan involves turning Cybertron into a giant spaceship. That's not logic, that's madness.",
            "category": "Transformers Roast"
        },
        {
            "setup": "Why does Blaster exist?",
            "delivery": "Because apparently the Autobots needed their own walking stereo system to counter Soundwave's boombox superiority complex.",
            "category": "Transformers Roast"
        },
        {
            "setup": "What's Devastator's biggest flaw?",
            "delivery": "The fact that six construction vehicles combining into a giant robot somehow makes them collectively dumber than individual bricks.",
            "category": "Transformers Roast"
        },
        {
            "setup": "Why does Perceptor transform into a microscope?",
            "delivery": "Because being useful in combat was apparently optional, and examining things really closely is definitely what you need during robot wars.",
            "category": "Transformers Roast"
        },
        {
            "setup": "What's Blurr's superpower?",
            "delivery": "Talking so fast that nobody can understand his exposition dumps. It's like having a caffeine overdose as a personality.",
            "category": "Transformers Roast"
        },
        {
            "setup": "Why did Hot Rod become Rodimus Prime?",
            "delivery": "Because Optimus needed someone to carry on the tradition of making terrible decisions while looking dramatically into the distance.",
            "category": "Transformers Roast"
        },
        {
            "setup": "What's Kup's actual role?",
            "delivery": "Being old enough to complain about everything while somehow surviving through pure plot armor and 'back in my day' speeches.",
            "category": "Transformers Roast"
        },
        {
            "setup": "Why does Arcee exist?",
            "delivery": "Because the writers needed exactly one female Transformer to prove they could be progressive while still making her pink.",
            "category": "Transformers Roast"
        },
        {
            "setup": "What's Jetfire's deal?",
            "delivery": "Being the Transformer equivalent of that one uncle who won't stop talking about his glory days while needing help transforming.",
            "category": "Transformers Roast"
        },
        {
            "setup": "Why does Omega Supreme never do anything?",
            "delivery": "Because being a giant spaceship/base/robot apparently means standing around looking impressive while everyone else actually fights.",
            "category": "Transformers Roast"
        },
        {
            "setup": "What's Blitzwing's personality?",
            "delivery": "Three personalities, all of them terrible. It's like having dissociative identity disorder, but somehow more annoying.",
            "category": "Transformers Roast"
        },
        {
            "setup": "Why does Astrotrain exist?",
            "delivery": "Because apparently someone thought 'what if we made a triple-changer, but his third mode is just being completely useless in space?'",
            "category": "Transformers Roast"
        },
        {
            "setup": "What's Ramjet's special ability?",
            "delivery": "Ramming into things headfirst. That's it. That's the entire character. A concussion with wings.",
            "category": "Transformers Roast"
        },
        {
            "setup": "Why does Dirge look like that?",
            "delivery": "Because 'doom and despair' apparently needed a face, and that face needed to be the most melodramatic jet in existence.",
            "category": "Transformers Roast"
        },
        {
            "setup": "What's Thrust's actual thrust?",
            "delivery": "His overwhelming confidence in being completely average. He's the participation trophy of Decepticon jets.",
            "category": "Transformers Roast"
        },
        {
            "setup": "Why does Cyclonus exist?",
            "delivery": "To prove that even when you get upgraded by a planet-eating god, you can still look like a flying purple disappointment.",
            "category": "Transformers Roast"
        },
        {
            "setup": "What's Scourge's sweep about?",
            "delivery": "Leading an army of identical clones who somehow manage to miss every shot while looking like rejected Halloween decorations.",
            "category": "Transformers Roast"
        },
        {
            "setup": "Why does Galvatron keep Megatron's memories?",
            "delivery": "Because even cosmic-level upgrades can't fix being terrible at winning. He's literally Megatron with anger management issues.",
            "category": "Transformers Roast"
        },
        {
            "setup": "What's Unicron's actual plan?",
            "delivery": "Eat planets. That's it. No nuance, no strategy, just cosmic obesity with a planet-sized appetite for destruction.",
            "category": "Transformers Roast"
        },
        {
            "setup": "Why does Primus suck at his job?",
            "delivery": "Creating an entire race of robots just to fight an eternal war is the worst case of parenting in cosmic history.",
            "category": "Transformers Roast"
        },
        {
            "setup": "What's the Matrix of Leadership actually good for?",
            "delivery": "Making dramatic speeches and occasionally bringing people back from the dead, but somehow never preventing wars or actual problems.",
            "category": "Transformers Roast"
        },
        {
            "setup": "Why do Transformers keep getting rebooted?",
            "delivery": "Because Hollywood discovered that nostalgia plus robots equals money, and character development is optional when you can just explode things.",
            "category": "Transformers Roast"
        },
        {
            "setup": "What's Michael Bay's contribution to Transformers?",
            "delivery": "Proving that you can make billions of dollars by replacing story with explosions and character arcs with product placement.",
            "category": "Transformers Roast"
        },
        {
            "setup": "Why does every Transformer need a vehicle mode?",
            "delivery": "Because 'disguise' apparently means 'turn into the most conspicuous version of Earth transportation possible while still being 20 feet tall.'",
            "category": "Transformers Roast"
        },
        {
            "setup": "What's the Allspark's actual purpose?",
            "delivery": "Creating life that immediately starts murdering each other. It's like a cosmic 3D printer designed by someone who hates peace.",
            "category": "Transformers Roast"
        },
        {
            "setup": "Why do Decepticons keep following Megatron?",
            "delivery": "Stockholm syndrome with a side of 'at least he's not Starscream.' That's literally the bar for Decepticon leadership.",
            "category": "Transformers Roast"
        },
        {
            "setup": "What's Optimus Prime's greatest weakness?",
            "delivery": "His inability to make a decision without first giving a 20-minute speech about the weight of leadership and the cost of war.",
            "category": "Transformers Roast"
        },
        {
            "setup": "Why does Megatron transform into a gun?",
            "delivery": "Because subtlety is for winners, and nothing says 'tactical genius' like turning into a weapon that someone else has to wield.",
            "category": "Transformers Roast"
        },
        {
            "setup": "What's Starscream's leadership potential?",
            "delivery": "Negative infinity. He could lead a parade into a ditch while blaming everyone else for not following his flawless navigation.",
            "category": "Transformers Roast"
        },
        {
            "setup": "Why do Autobots always win?",
            "delivery": "Because plot armor is stronger than any alloy in the universe, and the good guys always win in stories designed to sell toys.",
            "category": "Transformers Roast"
        },
        {
            "setup": "What's the real reason Transformers fight?",
            "delivery": "Because without the eternal war, they'd have to get actual jobs, and 'professional transforming' isn't a viable career path.",
            "category": "Transformers Roast"
        },
        {
            "setup": "Why does every Transformer have a tragic backstory?",
            "delivery": "Because 'I was built yesterday and immediately started fighting' doesn't have the same emotional weight as centuries of manufactured trauma.",
            "category": "Transformers Roast"
        },
        {
            "setup": "What's the most unrealistic thing about Transformers?",
            "delivery": "That beings capable of interstellar travel and transformation can't figure out basic conflict resolution without resorting to planetary warfare.",
            "category": "Transformers Roast"
        },
        {
            "setup": "Why do Transformers have such big egos?",
            "delivery": "When you're a 20-foot tall robot that turns into a vehicle, humility apparently gets left in the transformation cog.",
            "category": "Transformers Roast"
        },
        {
            "setup": "What's the actual Matrix of Leadership?",
            "delivery": "A cosmic glow stick that somehow makes you responsible for everyone else's terrible decisions while giving you the power to make equally terrible ones.",
            "category": "Transformers Roast"
        },
        {
            "setup": "Why does every Transformer need to announce their transformation?",
            "delivery": "Because subtlety died with Cybertron, and apparently shouting your own name while transforming is peak intimidation strategy.",
            "category": "Transformers Roast"
        },
        {
            "setup": "What's the most impressive thing about Transformers?",
            "delivery": "That they've been fighting the same war for millions of years and somehow haven't figured out that maybe, just maybe, they're the problem.",
            "category": "Transformers Roast"
        }
    ]
}