{
  "roll_system": {
    "dice_type": "d5",
    "base_skill_check_threshold": 3,
    "auto_critical_success": {
      "description": "If player's skill value + event modifier >= event_threshold, they automatically get Critical Success",
      "enabled": true
    },
    "outcome_ranges": {
      "massive_failure": {
        "range": [1, 1],
        "name": "Massive Failure",
        "description": "Complete disaster - lose the encounter",
        "result": "lose_encounter"
      },
      "failure_but_saveable": {
        "range": [2, 2],
        "name": "Failure But Saveable",
        "description": "Things go wrong but there's still hope",
        "result": "secondary_roll",
        "secondary_dice": "d5",
        "secondary_success_threshold": 3
      },
      "stalemate": {
        "range": [3, 3],
        "name": "Stalemate",
        "description": "Neither victory nor defeat - a draw",
        "result": "secondary_roll",
        "secondary_dice": "d5",
        "secondary_success_threshold": 3
      },
      "success": {
        "range": [4, 4],
        "name": "Success",
        "description": "Victory achieved through skill and determination",
        "result": "win_encounter"
      },
      "critical_success": {
        "range": [5, 5],
        "name": "Critical Success",
        "description": "Overwhelming victory with exceptional results",
        "result": "win_encounter",
        "bonus_rewards": true
      }
    }
  },
  "random_encounters": {
    "1": {
      "id": "energon_cube_discovery",
      "name": "Energon Cube Discovery",
      "description": "You discover a glowing energon cube partially buried in debris. It's unstable and could explode, but contains valuable energy.",
      "difficulty_level": "very_easy",
      "skill_thresholds": {
        "attack": 2,
        "defense": 2,
        "dexterity": 2,
        "charisma": 2
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Use brute force to quickly extract the cube before it destabilizes",
          "success_outcome": "You successfully extract the cube with raw power, securing the energon safely",
          "failure_outcome": "Your forceful approach causes the cube to crack and leak dangerous energy"
        },
        "defense": {
          "skill": "Defense",
          "description": "Carefully shield yourself while slowly and safely extracting the cube",
          "success_outcome": "Your defensive approach protects you from energy discharge as you secure the cube",
          "failure_outcome": "Despite your caution, unstable energy overwhelms your defenses"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Use precise movements to delicately extract the cube without triggering instability",
          "success_outcome": "Your precise manipulation successfully extracts the cube without incident",
          "failure_outcome": "A slight miscalculation causes the cube to become dangerously unstable"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Try to communicate with any nearby Transformers to coordinate a safe extraction",
          "success_outcome": "You successfully coordinate with others to safely extract the energon cube",
          "failure_outcome": "Miscommunication leads to a chaotic and dangerous extraction attempt"
        }
      }
    },
    "2": {
      "id": "space_bridge_malfunction",
      "name": "Space Bridge Malfunction",
      "description": "A nearby space bridge begins sparking and malfunctioning. You could try to repair it, but it's dangerous and complex.",
      "difficulty_level": "easy",
      "skill_thresholds": {
        "attack": 3,
        "defense": 3,
        "dexterity": 3,
        "charisma": 3
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Forcefully shut down the malfunctioning systems by destroying the control panel",
          "success_outcome": "Your decisive action stops the malfunction, though the bridge is temporarily offline",
          "failure_outcome": "Your aggressive approach causes a feedback loop, making the situation worse"
        },
        "defense": {
          "skill": "Defense",
          "description": "Create protective barriers while attempting to contain the malfunction",
          "success_outcome": "Your defensive measures successfully contain the malfunction until it stabilizes",
          "failure_outcome": "The malfunction overwhelms your protective measures, causing system damage"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Carefully rewire and adjust the delicate space bridge components",
          "success_outcome": "Your precise technical work successfully repairs the space bridge",
          "failure_outcome": "A small mistake in the complex wiring causes additional system failures"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Rally nearby Transformers to work together on the repair",
          "success_outcome": "Your leadership coordinates an effective team repair effort",
          "failure_outcome": "Conflicting opinions and poor coordination worsen the malfunction"
        }
      }
    },
    "3": {
      "id": "autobot_decepticon_standoff",
      "name": "Autobot-Decepticon Standoff",
      "description": "You witness a tense standoff between Autobots and Decepticons over a disputed territory. Violence seems imminent.",
      "difficulty_level": "moderate",
      "skill_thresholds": {
        "attack": 4,
        "defense": 4,
        "dexterity": 4,
        "charisma": 4
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Intervene decisively to break up the standoff through show of force",
          "success_outcome": "Your commanding presence forces both sides to reconsider their aggressive stance",
          "failure_outcome": "Your intervention is seen as a threat, causing both sides to turn on you"
        },
        "defense": {
          "skill": "Defense",
          "description": "Position yourself as a neutral barrier between the two factions",
          "success_outcome": "Your defensive positioning creates a buffer zone that cools tensions",
          "failure_outcome": "You become caught in the crossfire as the standoff escalates"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Carefully maneuver around the conflict to avoid detection",
          "success_outcome": "You successfully navigate around the conflict without being noticed",
          "failure_outcome": "Your movement is detected, drawing unwanted attention from both sides"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Attempt to mediate and find a peaceful resolution to the conflict",
          "success_outcome": "Your diplomatic skills successfully de-escalate the situation",
          "failure_outcome": "Your mediation attempts are rejected, and tensions increase"
        }
      }
    },
    "4": {
      "id": "ancient_cybertronian_artifact",
      "name": "Ancient Cybertronian Artifact",
      "description": "You discover an ancient Cybertronian artifact covered in mysterious glyphs. It pulses with unknown energy.",
      "difficulty_level": "moderate",
      "skill_thresholds": {
        "attack": 4,
        "defense": 4,
        "dexterity": 4,
        "charisma": 4
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Use force to break open the artifact and access its contents",
          "success_outcome": "Your forceful approach successfully opens the artifact, revealing its secrets",
          "failure_outcome": "Your aggressive handling damages the artifact, potentially destroying valuable knowledge"
        },
        "defense": {
          "skill": "Defense",
          "description": "Carefully study the artifact while protecting yourself from potential dangers",
          "success_outcome": "Your cautious approach allows you to safely unlock the artifact's mysteries",
          "failure_outcome": "Your overly cautious approach prevents you from making meaningful progress"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Delicately trace the glyphs and manipulate the artifact's mechanisms",
          "success_outcome": "Your precise touch activates the artifact's ancient mechanisms correctly",
          "failure_outcome": "A slight miscalculation triggers the artifact's defensive systems"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Try to communicate with the artifact's ancient AI or consciousness",
          "success_outcome": "You successfully establish communication with the artifact's ancient intelligence",
          "failure_outcome": "The ancient consciousness rejects your attempts at communication"
        }
      }
    },
    "5": {
      "id": "energon_storm_shelter",
      "name": "Energon Storm Shelter",
      "description": "A violent energon storm approaches rapidly. You need to find or create shelter before the dangerous energy discharges arrive.",
      "difficulty_level": "hard",
      "skill_thresholds": {
        "attack": 6,
        "defense": 5,
        "dexterity": 5,
        "charisma": 6
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Blast through obstacles to quickly create a makeshift shelter",
          "success_outcome": "Your powerful attacks quickly clear a safe shelter space",
          "failure_outcome": "Your destructive approach weakens the structural integrity of your shelter"
        },
        "defense": {
          "skill": "Defense",
          "description": "Reinforce existing structures to create a storm-resistant shelter",
          "success_outcome": "Your defensive modifications create an excellent storm shelter",
          "failure_outcome": "Your reinforcements prove inadequate against the storm's intensity"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Quickly and efficiently assemble a shelter from available materials",
          "success_outcome": "Your quick assembly creates an effective temporary shelter",
          "failure_outcome": "Time pressure causes mistakes in your shelter construction"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Convince other Transformers to share their shelter with you",
          "success_outcome": "Your persuasive abilities secure you safe shelter with others",
          "failure_outcome": "Others refuse to help, leaving you exposed to the storm"
        }
      }
    },
    "6": {
      "id": "matrix_bearer_test",
      "name": "Matrix Bearer Test",
      "description": "You encounter a holographic test left by an ancient Prime. It challenges your worthiness to bear the Matrix of Leadership.",
      "difficulty_level": "mythic",
      "skill_thresholds": {
        "attack": 12,
        "defense": 12,
        "dexterity": 12,
        "charisma": 12
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Demonstrate your warrior prowess and combat readiness",
          "success_outcome": "Your martial skills impress the ancient Prime's test",
          "failure_outcome": "The test judges your approach as too aggressive and unworthy"
        },
        "defense": {
          "skill": "Defense",
          "description": "Show your ability to protect others and stand firm against adversity",
          "success_outcome": "Your protective instincts prove your worthiness as a guardian",
          "failure_outcome": "The test finds your defensive approach lacking in leadership qualities"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Navigate complex challenges that test your precision and adaptability",
          "success_outcome": "Your adaptability and precision demonstrate true Prime potential",
          "failure_outcome": "Your performance fails to meet the exacting standards of the test"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Demonstrate your leadership abilities and wisdom",
          "success_outcome": "Your leadership qualities shine through, impressing the ancient test",
          "failure_outcome": "The test finds your leadership approach insufficient for Prime status"
        }
      }
    },
    "7": {
      "id": "quintesson_judge_trial",
      "name": "Quintesson Judge Trial",
      "description": "You're brought before a Quintesson judge for an unknown crime. The five-faced judge demands you prove your innocence.",
      "difficulty_level": "hard",
      "skill_thresholds": {
        "attack": 6,
        "defense": 5,
        "dexterity": 5,
        "charisma": 6
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Refuse to submit to the trial and attempt to fight your way out",
          "success_outcome": "Your bold defiance impresses the judge, who respects strength",
          "failure_outcome": "Your aggressive approach is seen as confirmation of guilt"
        },
        "defense": {
          "skill": "Defense",
          "description": "Stand firm in your innocence and defend against accusations",
          "success_outcome": "Your unwavering defense convinces the judge of your innocence",
          "failure_outcome": "Your defensive stance is interpreted as evasiveness"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Carefully navigate the complex legal proceedings",
          "success_outcome": "Your careful maneuvering through the trial leads to acquittal",
          "failure_outcome": "You make a procedural error that strengthens the case against you"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Use eloquent arguments to persuade the judge of your innocence",
          "success_outcome": "Your persuasive arguments sway the judge in your favor",
          "failure_outcome": "Your arguments fail to convince the skeptical Quintesson judge"
        }
      }
    },
    "8": {
      "id": "beast_mode_transformation",
      "name": "Beast Mode Transformation",
      "description": "You encounter a strange energy field that could grant you a temporary beast mode transformation, but it's risky and unpredictable.",
      "difficulty_level": "easy",
      "skill_thresholds": {
        "attack": 3,
        "defense": 3,
        "dexterity": 3,
        "charisma": 3
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Charge directly into the energy field with full power",
          "success_outcome": "Your bold approach successfully grants you a powerful beast mode",
          "failure_outcome": "The energy field rejects your aggressive approach, causing painful feedback"
        },
        "defense": {
          "skill": "Defense",
          "description": "Carefully shield yourself while gradually entering the field",
          "success_outcome": "Your protective measures allow for a safe and controlled transformation",
          "failure_outcome": "Your defensive barriers interfere with the transformation process"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Precisely calibrate your systems to harmonize with the energy field",
          "success_outcome": "Your precise adjustments result in a perfect beast mode transformation",
          "failure_outcome": "A calibration error causes an unstable and painful transformation"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Try to communicate with the field's consciousness to request transformation",
          "success_outcome": "The field's ancient spirit grants you a blessed beast mode form",
          "failure_outcome": "The field's consciousness finds you unworthy of its gift"
        }
      }
    },
    "9": {
      "id": "combiners_separation_crisis",
      "name": "Combiner Separation Crisis",
      "description": "You encounter a combiner team that's stuck in their combined form and can't separate. They need help to regain individual control.",
      "difficulty_level": "moderate",
      "skill_thresholds": {
        "attack": 4,
        "defense": 4,
        "dexterity": 4,
        "charisma": 4
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Use targeted strikes to disrupt the combination lock",
          "success_outcome": "Your precise strikes successfully break the combination lock",
          "failure_outcome": "Your attacks cause damage to the individual Transformers within"
        },
        "defense": {
          "skill": "Defense",
          "description": "Create a protective field while they attempt to separate themselves",
          "success_outcome": "Your protection allows them to safely work through the separation process",
          "failure_outcome": "Your defensive field interferes with their separation attempts"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Carefully manipulate their combination joints and mechanisms",
          "success_outcome": "Your delicate work successfully unlocks their combination mechanism",
          "failure_outcome": "Your manipulation accidentally triggers a painful forced separation"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Help coordinate communication between the individual minds",
          "success_outcome": "Your mediation helps them work together to achieve separation",
          "failure_outcome": "Conflicting personalities resist your coordination attempts"
        }
      }
    },
    "10": {
      "id": "primal_scream_echo",
      "name": "Primal Scream Echo",
      "description": "You hear the echo of an ancient Primal Scream - a call of distress from the dawn of Cybertron. Something responds to investigate.",
      "difficulty_level": "legendary",
      "skill_thresholds": {
        "attack": 10,
        "defense": 10,
        "dexterity": 10,
        "charisma": 10
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Prepare for battle against whatever the scream might attract",
          "success_outcome": "Your combat readiness impresses the ancient spirit that responds",
          "failure_outcome": "Your aggressive stance frightens away a potential ally"
        },
        "defense": {
          "skill": "Defense",
          "description": "Create protective barriers and prepare for unknown dangers",
          "success_outcome": "Your defensive preparations prove wise as ancient guardians test you",
          "failure_outcome": "Your barriers block beneficial ancient energies trying to reach you"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Carefully trace the source of the scream through complex terrain",
          "success_outcome": "Your precise tracking leads you to an ancient Cybertronian shrine",
          "failure_outcome": "You lose the trail and miss an important discovery"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Respond to the scream with your own call, trying to communicate",
          "success_outcome": "Your response establishes contact with an ancient Cybertronian consciousness",
          "failure_outcome": "Your call is misinterpreted as a threat by the ancient presence"
        }
      }
    },
    "11": {
      "id": "spark_chamber_malfunction",
      "name": "Spark Chamber Malfunction",
      "description": "A Transformer's spark chamber is critically damaged and failing. They have minutes before their spark extinguishes forever.",
      "difficulty_level": "hard",
      "skill_thresholds": {
        "attack": 7,
        "defense": 5,
        "dexterity": 7,
        "charisma": 5
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Use emergency surgery techniques to forcefully repair the chamber",
          "success_outcome": "Your bold surgical intervention saves the Transformer's life",
          "failure_outcome": "Your aggressive approach damages the delicate spark container"
        },
        "defense": {
          "skill": "Defense",
          "description": "Create a protective field around the spark while attempting repairs",
          "success_outcome": "Your protective field stabilizes the spark during repair procedures",
          "failure_outcome": "Your defensive field interferes with the necessary repair work"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Perform delicate microsurgery on the spark chamber mechanisms",
          "success_outcome": "Your precise surgical skills successfully repair the chamber",
          "failure_outcome": "A tiny mistake causes critical damage to the spark housing"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Keep the injured Transformer calm and focused during the crisis",
          "success_outcome": "Your calming presence helps them maintain spark stability during repairs",
          "failure_outcome": "The injured Transformer panics, making repairs nearly impossible"
        }
      }
    },
    "12": {
      "id": "terrorcon_rampage",
      "name": "Terrorcon Rampage",
      "description": "A pack of wild Terrorcons is destroying everything in their path. They're heading toward a civilian area.",
      "difficulty_level": "hard",
      "skill_thresholds": {
        "attack": 7,
        "defense": 5,
        "dexterity": 5,
        "charisma": 4
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Engage the Terrorcons in direct combat to stop their rampage",
          "success_outcome": "Your fierce combat skills drive off the Terrorcon pack",
          "failure_outcome": "The pack overwhelms you with their savage coordination"
        },
        "defense": {
          "skill": "Defense",
          "description": "Create barriers to redirect the Terrorcons away from civilians",
          "success_outcome": "Your strategic barriers successfully redirect the rampage",
          "failure_outcome": "The Terrorcons break through your defenses with brutal force"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Use hit-and-run tactics to confuse and scatter the pack",
          "success_outcome": "Your agile tactics successfully break up the coordinated pack",
          "failure_outcome": "The Terrorcons adapt to your tactics and corner you"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Try to establish dominance over the pack through intimidation",
          "success_outcome": "Your commanding presence causes the pack to submit and retreat",
          "failure_outcome": "The alpha Terrorcon sees your approach as a challenge to fight"
        }
      }
    },
    "13": {
      "id": "rust_plague_outbreak",
      "name": "Rust Plague Outbreak",
      "description": "A cosmic rust infection is spreading through a Transformer settlement. You must find a way to contain it before it spreads further.",
      "difficulty_level": "legendary",
      "skill_thresholds": {
        "attack": 8,
        "defense": 10,
        "dexterity": 9,
        "charisma": 8
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Destroy infected areas before the rust can spread further",
          "success_outcome": "Your decisive destruction contains the plague spread",
          "failure_outcome": "Your attacks scatter rust particles, accelerating the infection"
        },
        "defense": {
          "skill": "Defense",
          "description": "Create containment fields around infected zones",
          "success_outcome": "Your containment successfully isolates the plague",
          "failure_outcome": "The rust proves more corrosive than your barriers can handle"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Carefully extract and treat infected components",
          "success_outcome": "Your precise medical work successfully treats the infection",
          "failure_outcome": "You accidentally expose yourself to the rust plague"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Coordinate an organized evacuation and quarantine effort",
          "success_outcome": "Your leadership prevents panic and organizes effective containment",
          "failure_outcome": "Fear and confusion hamper your coordination efforts"
        }
      }
    },
    "14": {
      "id": "stellar_spanner_discovery",
      "name": "Stellar Spanner Discovery",
      "description": "You discover one of the legendary Stellar Spanners - ancient tools capable of manipulating space and time themselves.",
      "difficulty_level": "mythic",
      "skill_thresholds": {
        "attack": 12,
        "defense": 12,
        "dexterity": 12,
        "charisma": 12
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Attempt to claim the Stellar Spanner through force of will",
          "success_outcome": "Your determination proves worthy, and the Spanner accepts you",
          "failure_outcome": "The Spanner's power overwhelms you with temporal feedback"
        },
        "defense": {
          "skill": "Defense",
          "description": "Approach the artifact with extreme caution and respect",
          "success_outcome": "Your respectful approach gains the Spanner's trust",
          "failure_outcome": "Your excessive caution is interpreted as weakness"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Carefully study the Spanner's construction and activation methods",
          "success_outcome": "Your technical expertise allows you to safely interface with the Spanner",
          "failure_outcome": "A misunderstanding of the controls causes a dangerous temporal anomaly"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Try to communicate with the Spanner's ancient consciousness",
          "success_outcome": "You establish a partnership with the artifact's vast intelligence",
          "failure_outcome": "The ancient mind finds you unworthy of such cosmic power"
        }
      }
    },
    "15": {
      "id": "predacon_bone_hunt",
      "name": "Predacon Bone Hunt",
      "description": "You discover fossilized remains of ancient Predacons. These bones could be used to create new Predacon warriors, but others may want them too.",
      "difficulty_level": "easy",
      "skill_thresholds": {
        "attack": 3,
        "defense": 3,
        "dexterity": 3,
        "charisma": 3
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Aggressively excavate the bones before competitors arrive",
          "success_outcome": "Your speed secures the Predacon fossils before others can claim them",
          "failure_outcome": "Your hasty excavation damages some of the precious bone samples"
        },
        "defense": {
          "skill": "Defense",
          "description": "Establish a secure perimeter while carefully excavating",
          "success_outcome": "Your defensive measures allow for a thorough and safe excavation",
          "failure_outcome": "While you focus on defense, rivals slip in and steal some bones"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Use precise archaeological techniques to extract the bones intact",
          "success_outcome": "Your careful work preserves the bones in perfect condition",
          "failure_outcome": "Despite your care, some bones crumble during extraction"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Negotiate with other interested parties for peaceful extraction",
          "success_outcome": "You broker a deal that gives everyone a fair share of the discovery",
          "failure_outcome": "Negotiations break down, leading to conflict over the bones"
        }
      }
    },
    "16": {
      "id": "unicron_herald_encounter",
      "name": "Unicron Herald Encounter",
      "description": "You encounter one of Unicron's heralds spreading corruption and chaos. The herald offers you power in exchange for servitude.",
      "difficulty_level": "legendary",
      "skill_thresholds": {
        "attack": 10,
        "defense": 10,
        "dexterity": 8,
        "charisma": 11
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Immediately attack the herald before it can corrupt you",
          "success_outcome": "Your swift attack disrupts the herald's corruption attempts",
          "failure_outcome": "The herald's dark power overwhelms your assault"
        },
        "defense": {
          "skill": "Defense",
          "description": "Shield your mind and spark from the herald's corrupting influence",
          "success_outcome": "Your strong defenses protect you from Unicron's corruption",
          "failure_outcome": "The herald's influence seeps through your mental barriers"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Attempt to escape before the herald can fully manifest its power",
          "success_outcome": "You successfully escape the herald's sphere of influence",
          "failure_outcome": "The herald traps you within its corrupted domain"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Try to turn the herald away from Unicron's path",
          "success_outcome": "Your words reach something still pure within the herald",
          "failure_outcome": "The herald laughs at your naive attempts at redemption"
        }
      }
    },
    "17": {
      "id": "omega_supreme_awakening",
      "name": "Omega Supreme Awakening",
      "description": "You discover the dormant form of Omega Supreme. Ancient systems are attempting to reboot, but the process is unstable.",
      "difficulty_level": "hard",
      "skill_thresholds": {
        "attack": 5,
        "defense": 6,
        "dexterity": 7,
        "charisma": 5
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Force a hard reboot by shocking Omega Supreme's systems",
          "success_outcome": "Your forceful reboot successfully awakens the guardian",
          "failure_outcome": "The shock causes system failures in Omega Supreme's neural network"
        },
        "defense": {
          "skill": "Defense",
          "description": "Protect Omega Supreme's systems during the natural awakening process",
          "success_outcome": "Your protection ensures a smooth and stable reactivation",
          "failure_outcome": "External interference damages systems during the vulnerable boot sequence"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Carefully assist the reboot process with technical adjustments",
          "success_outcome": "Your technical expertise optimizes Omega Supreme's reactivation",
          "failure_outcome": "A misadjustment causes Omega Supreme to wake up disoriented and confused"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Speak to Omega Supreme's dormant consciousness to guide the awakening",
          "success_outcome": "Your words help Omega Supreme remember its purpose and identity",
          "failure_outcome": "Omega Supreme awakens confused about friend and foe"
        }
      }
    },
        "18": {
      "id": "minibot_rescue_mission",
      "name": "Minibot Rescue Mission",
      "description": "A group of Minibots are trapped under debris from a collapsed building. They're running out of air and time is critical.",
      "difficulty_level": "very_easy",
      "skill_thresholds": {
        "attack": 2,
        "defense": 2,
        "dexterity": 2,
        "charisma": 2
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Blast away the debris with powerful weapons",
          "success_outcome": "Your precise firepower clears a safe path to the trapped Minibots",
          "failure_outcome": "Your heavy-handed approach causes more debris to fall on the victims"
        },
        "defense": {
          "skill": "Defense",
          "description": "Create protective barriers while others work to free the Minibots",
          "success_outcome": "Your shields prevent further collapse during the rescue operation",
          "failure_outcome": "Your barriers are too weak to hold back the unstable wreckage"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Carefully move debris piece by piece to avoid further collapse",
          "success_outcome": "Your gentle touch successfully frees the Minibots without injury",
          "failure_outcome": "You accidentally trigger a small avalanche of debris"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Coordinate other rescuers and keep the trapped Minibots calm",
          "success_outcome": "Your leadership organizes an efficient rescue and keeps everyone calm",
          "failure_outcome": "Panic spreads as your coordination attempts create confusion"
        }
      }
    },
    "19": {
      "id": "cassette_intelligence_breach",
      "name": "Cassette Intelligence Breach",
      "description": "Enemy cassette minions are infiltrating a secure data facility. You need to stop them before they steal critical information.",
      "difficulty_level": "easy",
      "skill_thresholds": {
        "attack": 3,
        "defense": 3,
        "dexterity": 3,
        "charisma": 3
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Directly assault the cassette infiltrators",
          "success_outcome": "Your swift attack stops the cassettes before they can complete their mission",
          "failure_outcome": "The nimble cassettes evade your attacks and continue their infiltration"
        },
        "defense": {
          "skill": "Defense",
          "description": "Seal off the facility to trap the cassettes inside",
          "success_outcome": "Your lockdown successfully traps the infiltrators for capture",
          "failure_outcome": "The cassettes find weaknesses in your security perimeter"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Use stealth and precision to hunt down the small infiltrators",
          "success_outcome": "Your careful tracking allows you to catch each cassette individually",
          "failure_outcome": "The cassettes' small size makes them nearly impossible to track"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Try to convince the cassettes to abandon their mission",
          "success_outcome": "Your persuasion causes some cassettes to defect and reveal the plot",
          "failure_outcome": "The loyal cassettes ignore your words and continue their mission"
        }
      }
    },
    "20": {
      "id": "insecticon_swarm_investigation",
      "name": "Insecticon Swarm Investigation",
      "description": "A swarm of Insecticons has been spotted near a vital energon processing plant. You must determine if they're planning an attack.",
      "difficulty_level": "moderate",
      "skill_thresholds": {
        "attack": 4,
        "defense": 4,
        "dexterity": 4,
        "charisma": 4
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Launch a preemptive strike against the Insecticon swarm",
          "success_outcome": "Your aggressive action disperses the swarm before they can organize",
          "failure_outcome": "Your attack provokes the entire swarm into a coordinated assault"
        },
        "defense": {
          "skill": "Defense",
          "description": "Establish defensive positions around the processing plant",
          "success_outcome": "Your fortifications successfully deter the Insecticon reconnaissance",
          "failure_outcome": "The Insecticons find weak points in your defenses to exploit"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Stealthily observe the Insecticons to determine their true intentions",
          "success_outcome": "Your surveillance reveals the swarm's plans, allowing for preparation",
          "failure_outcome": "You're detected by the swarm's scouts and lose the element of surprise"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Attempt to communicate with the Insecticon hive mind",
          "success_outcome": "You establish communication and learn their true objectives",
          "failure_outcome": "The hive mind rejects your contact and becomes hostile"
        }
      }
    },
    "21": {
      "id": "headmaster_bonding_crisis",
      "name": "Headmaster Bonding Crisis",
      "description": "A Headmaster's organic partner is experiencing rejection syndrome. The mental link is failing and both beings are in danger.",
      "difficulty_level": "moderate",
      "skill_thresholds": {
        "attack": 4,
        "defense": 4,
        "dexterity": 4,
        "charisma": 4
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Use shock therapy to force the neural pathways to reconnect",
          "success_outcome": "Your aggressive intervention jolts the bond back into stability",
          "failure_outcome": "The shock damages the delicate neural connection further"
        },
        "defense": {
          "skill": "Defense",
          "description": "Create mental barriers to protect both minds during the crisis",
          "success_outcome": "Your protective measures allow time for the bond to naturally stabilize",
          "failure_outcome": "Your barriers prevent the necessary reconnection process"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Perform delicate neural surgery to repair the bonding interface",
          "success_outcome": "Your precise work successfully repairs the damaged neural pathways",
          "failure_outcome": "A small error in the procedure causes additional neural damage"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Guide both beings through mental exercises to rebuild trust",
          "success_outcome": "Your counseling helps them overcome the psychological barriers",
          "failure_outcome": "The trauma runs too deep for simple therapeutic intervention"
        }
      }
    },
    "22": {
      "id": "triple_changer_identity_conflict",
      "name": "Triple Changer Identity Conflict",
      "description": "A Triple Changer is experiencing severe personality fragmentation between their three modes, unable to maintain a stable identity.",
      "difficulty_level": "hard",
      "skill_thresholds": {
        "attack": 6,
        "defense": 5,
        "dexterity": 6,
        "charisma": 7
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Force them into a single mode to end the personality conflict",
          "success_outcome": "Your decisive action locks them into their most stable personality",
          "failure_outcome": "Your forceful approach traumatizes all three personality aspects"
        },
        "defense": {
          "skill": "Defense",
          "description": "Shield their mind from external influences worsening the conflict",
          "success_outcome": "Your mental protection allows their personalities to find balance",
          "failure_outcome": "Your barriers trap the conflicting personalities together"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Carefully adjust their transformation cog to reduce mode conflicts",
          "success_outcome": "Your technical expertise smooths the transitions between modes",
          "failure_outcome": "Your adjustments cause painful transformation malfunctions"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Mediate between the three personality aspects to find harmony",
          "success_outcome": "Your diplomatic skills help the personalities reach an accord",
          "failure_outcome": "The conflicting personalities reject your mediation attempts"
        }
      }
    },
    "23": {
      "id": "powermaster_engine_failure",
      "name": "Powermaster Engine Failure",
      "description": "A Powermaster's organic engine partner has fallen critically ill, leaving the Transformer severely weakened and vulnerable.",
      "difficulty_level": "hard",
      "skill_thresholds": {
        "attack": 5,
        "defense": 6,
        "dexterity": 7,
        "charisma": 6
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Use energon infusions to forcefully jumpstart the failing engine",
          "success_outcome": "Your emergency energon boost revitalizes the organic engine",
          "failure_outcome": "The energon overdose causes severe burns to the organic partner"
        },
        "defense": {
          "skill": "Defense",
          "description": "Create life support systems to sustain both partners during treatment",
          "success_outcome": "Your support systems buy crucial time for natural recovery",
          "failure_outcome": "Your life support interferes with the natural bonding process"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Perform microsurgery on the organic engine's biological systems",
          "success_outcome": "Your delicate work successfully repairs the engine's vital functions",
          "failure_outcome": "The organic systems are too alien for your surgical techniques"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Communicate with the organic partner to encourage recovery",
          "success_outcome": "Your motivational support inspires the engine partner to fight the illness",
          "failure_outcome": "Language barriers prevent meaningful communication"
        }
      }
    },
    "24": {
      "id": "targetmaster_weapon_rebellion",
      "name": "Targetmaster Weapon Rebellion",
      "description": "Several Targetmaster weapon partners have rebelled against their Transformer partners, demanding independence and equal treatment.",
      "difficulty_level": "hard",
      "skill_thresholds": {
        "attack": 5,
        "defense": 5,
        "dexterity": 6,
        "charisma": 8
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Force the rebellious weapons back into compliance",
          "success_outcome": "Your show of force intimidates the weapons into submission",
          "failure_outcome": "Your aggression validates their complaints about Transformer oppression"
        },
        "defense": {
          "skill": "Defense",
          "description": "Protect both sides from violence while seeking resolution",
          "success_outcome": "Your peacekeeping efforts prevent bloodshed during negotiations",
          "failure_outcome": "Your defensive stance is seen as taking the Transformers' side"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Carefully disarm the situation through technical solutions",
          "success_outcome": "Your technical modifications create better partnership interfaces",
          "failure_outcome": "Your technical approach ignores the emotional aspects of the rebellion"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Mediate between Targetmasters and their weapon partners",
          "success_outcome": "Your diplomacy establishes new agreements benefiting both parties",
          "failure_outcome": "Old grievances prove too deep for immediate reconciliation"
        }
      }
    },
    "25": {
      "id": "pretender_shell_contamination",
      "name": "Pretender Shell Contamination",
      "description": "A Pretender's organic shell has been infected with a unknown alien virus that's spreading to their robotic core systems.",
      "difficulty_level": "legendary",
      "skill_thresholds": {
        "attack": 9,
        "defense": 8,
        "dexterity": 10,
        "charisma": 8
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Burn out the infection with concentrated energy weapons",
          "success_outcome": "Your precise energy attacks sterilize the infection completely",
          "failure_outcome": "Your attack damages healthy tissue along with the infection"
        },
        "defense": {
          "skill": "Defense",
          "description": "Isolate the infected areas to prevent further spread",
          "success_outcome": "Your containment prevents the virus from reaching critical systems",
          "failure_outcome": "The virus adapts and breaks through your containment protocols"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Perform complex surgery to remove infected bio-mechanical components",
          "success_outcome": "Your surgical precision successfully excises all infected tissue",
          "failure_outcome": "The virus has integrated too deeply into the bio-mechanical systems"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Try to communicate with the virus to understand its purpose",
          "success_outcome": "You discover the virus is sentient and negotiate a peaceful resolution",
          "failure_outcome": "The virus uses your communication attempts to spread faster"
        }
      }
    },
    "26": {
      "id": "micromasters_supply_convoy",
      "name": "Micromasters Supply Convoy",
      "description": "A critical supply convoy of Micromasters is under attack by aerial raiders. The supplies are vital for a besieged city.",
      "difficulty_level": "easy",
      "skill_thresholds": {
        "attack": 3,
        "defense": 3,
        "dexterity": 3,
        "charisma": 3
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Engage the raiders directly in aerial combat",
          "success_outcome": "Your air superiority drives off the raiding party",
          "failure_outcome": "The raiders overwhelm you with superior numbers"
        },
        "defense": {
          "skill": "Defense",
          "description": "Form a protective escort around the Micromaster convoy",
          "success_outcome": "Your defensive formation successfully protects the supply convoy",
          "failure_outcome": "The raiders break through your defensive perimeter"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Guide the convoy through hidden routes to avoid the raiders",
          "success_outcome": "Your knowledge of secret paths bypasses the raider ambush",
          "failure_outcome": "You lead the convoy into an even worse raider trap"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Rally other defenders to help protect the convoy",
          "success_outcome": "Your call brings reinforcements that secure the supply route",
          "failure_outcome": "No one responds to your call for assistance in time"
        }
      }
    },
    "27": {
      "id": "actionmaster_partner_malfunction",
      "name": "Actionmaster Partner Malfunction",
      "description": "An Actionmaster's mechanical partner has gone berserk, attacking friend and foe alike due to a programming virus.",
      "difficulty_level": "easy",
      "skill_thresholds": {
        "attack": 3,
        "defense": 3,
        "dexterity": 3,
        "charisma": 3
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Destroy the malfunctioning partner before it causes more damage",
          "success_outcome": "Your quick action stops the rampage but destroys the partnership",
          "failure_outcome": "The berserk partner is more resilient than expected"
        },
        "defense": {
          "skill": "Defense",
          "description": "Contain the partner until the virus can be purged",
          "success_outcome": "Your restraining systems hold the partner until repairs are complete",
          "failure_outcome": "The partner's combat systems overwhelm your containment"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Attempt to manually purge the virus from the partner's systems",
          "success_outcome": "Your technical skills successfully remove the corrupting virus",
          "failure_outcome": "The virus adapts and becomes harder to remove"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Help the Actionmaster communicate with their corrupted partner",
          "success_outcome": "The bond between partners overcomes the viral programming",
          "failure_outcome": "The virus blocks all communication attempts"
        }
      }
    },
    "28": {
      "id": "base_transformer_siege_defense",
      "name": "Base Transformer Siege Defense",
      "description": "A massive Base Transformer city is under siege. You must help coordinate its transformation into battle mode while under attack.",
      "difficulty_level": "moderate",
      "skill_thresholds": {
        "attack": 4,
        "defense": 4,
        "dexterity": 4,
        "charisma": 4
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Man the city's weapon systems during the transformation",
          "success_outcome": "Your gunnery skills keep the attackers at bay during the vulnerable transition",
          "failure_outcome": "You're overwhelmed by the complexity of the city-sized weapon systems"
        },
        "defense": {
          "skill": "Defense",
          "description": "Reinforce critical systems during the transformation sequence",
          "success_outcome": "Your structural support prevents critical failures during transformation",
          "failure_outcome": "Enemy fire damages key transformation components despite your efforts"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Assist with the precise mechanical operations of city transformation",
          "success_outcome": "Your technical expertise speeds up the transformation process",
          "failure_outcome": "The massive scale of the transformation overwhelms your capabilities"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Coordinate the evacuation of civilians during the transformation",
          "success_outcome": "Your leadership ensures all civilians reach safety before battle mode",
          "failure_outcome": "Panic and confusion slow the evacuation process dangerously"
        }
      }
    },
    "29": {
      "id": "constructicon_workplace_accident",
      "name": "Constructicon Workplace Accident",
      "description": "A construction project has gone wrong and several Constructicons are trapped in a collapsing structure they were building.",
      "difficulty_level": "moderate",
      "skill_thresholds": {
        "attack": 4,
        "defense": 4,
        "dexterity": 4,
        "charisma": 4
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Blast through the collapsed structure to reach the trapped Constructicons",
          "success_outcome": "Your controlled demolition creates a safe rescue route",
          "failure_outcome": "Your explosions cause further structural collapse"
        },
        "defense": {
          "skill": "Defense",
          "description": "Shore up the unstable structure to prevent further collapse",
          "success_outcome": "Your reinforcements stabilize the building for a safe rescue",
          "failure_outcome": "The structure is too damaged for your emergency supports"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Navigate through the debris to reach the trapped workers",
          "success_outcome": "Your agility allows you to reach and extract each trapped Constructicon",
          "failure_outcome": "The unstable debris shifts dangerously as you move through it"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Coordinate with other Constructicons to form Devastator for the rescue",
          "success_outcome": "The combined form has the power needed for a successful mass rescue",
          "failure_outcome": "Not enough Constructicons are available for a stable combination"
        }
      }
    },
    "30": {
      "id": "seeker_squadron_desertion",
      "name": "Seeker Squadron Desertion",
      "description": "An entire squadron of Seeker jets has deserted from the Decepticon cause, but they're being hunted by loyalist forces.",
      "difficulty_level": "hard",
      "skill_thresholds": {
        "attack": 7,
        "defense": 5,
        "dexterity": 6,
        "charisma": 6
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Fight off the loyalist forces hunting the deserter Seekers",
          "success_outcome": "Your combat skills drive off the pursuit and protect the deserters",
          "failure_outcome": "The loyalist forces are too numerous and well-armed to defeat"
        },
        "defense": {
          "skill": "Defense",
          "description": "Provide sanctuary for the deserters while they decide their next move",
          "success_outcome": "Your protective measures give the deserters time to plan their future",
          "failure_outcome": "Your location is discovered and becomes a target for attack"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Help the deserters escape to neutral territory",
          "success_outcome": "Your piloting skills guide the squadron to safety through dangerous routes",
          "failure_outcome": "The escape route is compromised and the squadron is intercepted"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Negotiate with Decepticon command for amnesty for the deserters",
          "success_outcome": "Your diplomacy secures pardons in exchange for the squadron's return",
          "failure_outcome": "Decepticon command refuses to negotiate with traitors"
        }
      }
    },
    "31": {
      "id": "stunticon_racing_catastrophe",
      "name": "Stunticon Racing Catastrophe",
      "description": "The Stunticons' illegal street racing has caused a massive traffic accident involving innocent civilian vehicles.",
      "difficulty_level": "hard",
      "skill_thresholds": {
        "attack": 5,
        "defense": 6,
        "dexterity": 7,
        "charisma": 6
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Force the Stunticons to stop their reckless racing immediately",
          "success_outcome": "Your aggressive intervention stops the dangerous racing competition",
          "failure_outcome": "The Stunticons see your attack as part of the racing challenge"
        },
        "defense": {
          "skill": "Defense",
          "description": "Focus on protecting innocent civilians from the racing chaos",
          "success_outcome": "Your protective barriers shield civilians from the racing mayhem",
          "failure_outcome": "The chaos spreads faster than you can establish protective zones"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Navigate through the racing chaos to coordinate emergency response",
          "success_outcome": "Your agility allows you to organize effective disaster response",
          "failure_outcome": "The unpredictable racing patterns make coordination impossible"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Convince the Stunticons to take responsibility for the damage they've caused",
          "success_outcome": "Your words reach their conscience and they help with rescue efforts",
          "failure_outcome": "The thrill-seeking Stunticons ignore the consequences of their actions"
        }
      }
    },
    "32": {
      "id": "combaticon_military_tribunal",
      "name": "Combaticon Military Tribunal",
      "description": "The Combaticons face court martial for insubordination and war crimes. You must serve as their defender or prosecutor.",
      "difficulty_level": "legendary",
      "skill_thresholds": {
        "attack": 8,
        "defense": 9,
        "dexterity": 8,
        "charisma": 11
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Aggressively prosecute the case with overwhelming evidence",
          "success_outcome": "Your thorough prosecution secures justice for their victims",
          "failure_outcome": "Your aggressive approach creates sympathy for the defendants"
        },
        "defense": {
          "skill": "Defense",
          "description": "Mount a strong defense focusing on military necessity and chain of command",
          "success_outcome": "Your defense successfully argues mitigating circumstances",
          "failure_outcome": "The evidence of war crimes is too overwhelming to defend against"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Navigate the complex legal procedures and find technical loopholes",
          "success_outcome": "Your legal expertise finds procedural errors that affect the case",
          "failure_outcome": "The military tribunal operates under different rules than you expected"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Appeal to the tribunal's sense of justice and mercy",
          "success_outcome": "Your eloquent arguments sway the tribunal toward a fair verdict",
          "failure_outcome": "The tribunal remains unmoved by emotional appeals"
        }
      }
    },
    "33": {
      "id": "protectobot_emergency_response",
      "name": "Protectobot Emergency Response",
      "description": "A massive disaster requires the Protectobots to form Defensor, but one team member is missing and they can't combine properly.",
      "difficulty_level": "legendary",
      "skill_thresholds": {
        "attack": 9,
        "defense": 10,
        "dexterity": 9,
        "charisma": 8
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Take the place of the missing Protectobot to complete the combination",
          "success_outcome": "Your compatibility allows Defensor to form and respond to the disaster",
          "failure_outcome": "Your incompatible systems cause the combination to be unstable"
        },
        "defense": {
          "skill": "Defense",
          "description": "Coordinate alternative emergency response without the gestalt combination",
          "success_outcome": "Your organization maximizes the individual Protectobots' effectiveness",
          "failure_outcome": "The disaster is too large for individual response efforts"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Modify the remaining Protectobots to combine without the missing member",
          "success_outcome": "Your technical adjustments create a functional four-bot combination",
          "failure_outcome": "The modified combination lacks the power needed for the emergency"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Rally other rescue teams to compensate for the incomplete Protectobot team",
          "success_outcome": "Your leadership coordinates a massive multi-team rescue effort",
          "failure_outcome": "Too many teams create coordination problems and confusion"
        }
      }
    },
    "34": {
      "id": "allspark_fragment_corruption",
      "name": "Allspark Fragment Corruption",
      "description": "A fragment of the Allspark has been corrupted by dark energon and is creating twisted, malformed mechanical life.",
      "difficulty_level": "mythic",
      "skill_thresholds": {
        "attack": 12,
        "defense": 12,
        "dexterity": 12,
        "charisma": 12
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Destroy the corrupted fragment before it creates more abominations",
          "success_outcome": "Your overwhelming power shatters the fragment and ends the corruption",
          "failure_outcome": "Your attack only scatters the corruption, making it harder to contain"
        },
        "defense": {
          "skill": "Defense",
          "description": "Contain the fragment's influence while seeking a way to purify it",
          "success_outcome": "Your containment holds while you find a way to cleanse the corruption",
          "failure_outcome": "The fragment's power overwhelms even your strongest containment fields"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Attempt to surgically separate the dark energon from the Allspark fragment",
          "success_outcome": "Your precise work successfully purifies the corrupted Allspark fragment",
          "failure_outcome": "The dark energon has fused too deeply with the Allspark essence"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Try to commune with the fragment's consciousness to heal the corruption",
          "success_outcome": "Your spiritual connection helps the fragment overcome the dark influence",
          "failure_outcome": "The corruption has silenced the fragment's original consciousness"
        }
      }
    },
    "35": {
      "id": "sparkling_nursery_crisis",
      "name": "Sparkling Nursery Crisis",
      "description": "The nursery where newly sparked Transformers are cared for has lost power, and the sparklings are becoming dangerously unstable without proper energy regulation.",
      "difficulty_level": "very_easy",
      "skill_thresholds": {
        "attack": 1,
        "defense": 3,
        "dexterity": 2,
        "charisma": 2
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Use your weapons' energy cells to power the nursery systems",
          "success_outcome": "Your energy donation successfully stabilizes the sparkling incubators",
          "failure_outcome": "Your weapon systems aren't compatible with nursery power requirements"
        },
        "defense": {
          "skill": "Defense",
          "description": "Create protective fields around the sparklings until power is restored",
          "success_outcome": "Your shields maintain safe conditions for the vulnerable sparklings",
          "failure_outcome": "Your defensive systems drain too much power to maintain long-term"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Repair the power systems with improvised components",
          "success_outcome": "Your quick repairs restore power to the critical nursery systems",
          "failure_outcome": "The delicate sparkling equipment is too complex for field repairs"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Keep the sparklings calm through soothing communication",
          "success_outcome": "Your gentle presence helps the sparklings remain stable during the crisis",
          "failure_outcome": "The frightened sparklings don't respond to your unfamiliar voice"
        }
      }
    },
    "36": {
      "id": "techno_organic_virus_outbreak",
      "name": "Techno-Organic Virus Outbreak",
      "description": "A strange virus is converting mechanical systems into organic matter, threatening to transform all of Cybertron into a living world.",
      "difficulty_level": "easy",
      "skill_thresholds": {
        "attack": 2,
        "defense": 4,
        "dexterity": 3,
        "charisma": 1
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Burn out infected areas before the virus can spread further",
          "success_outcome": "Your targeted destruction stops the organic conversion in key areas",
          "failure_outcome": "The virus adapts to fire and becomes more resilient"
        },
        "defense": {
          "skill": "Defense",
          "description": "Create quarantine barriers around infected zones",
          "success_outcome": "Your containment successfully isolates the viral outbreak",
          "failure_outcome": "The organic growth corrodes through your mechanical barriers"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Develop a technical solution to reverse the organic conversion",
          "success_outcome": "Your research creates a cure that reverses the viral transformation",
          "failure_outcome": "The virus evolves faster than you can develop countermeasures"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Try to communicate with the organic intelligence emerging from the virus",
          "success_outcome": "You establish contact and negotiate a peaceful coexistence",
          "failure_outcome": "The organic consciousness views mechanical life as inferior"
        }
      }
    },
    "37": {
      "id": "forgotten_prime_tomb",
      "name": "Forgotten Prime's Tomb",
      "description": "You discover the ancient tomb of a Prime whose name has been erased from history. Strange guardians protect secrets that some want kept buried.",
      "difficulty_level": "moderate",
      "skill_thresholds": {
        "attack": 6,
        "defense": 2,
        "dexterity": 5,
        "charisma": 3
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Fight through the tomb's ancient guardian constructs",
          "success_outcome": "Your combat prowess overcomes the tomb's defensive systems",
          "failure_outcome": "The guardians are powered by the tomb itself and keep regenerating"
        },
        "defense": {
          "skill": "Defense",
          "description": "Protect yourself while studying the tomb's warning inscriptions",
          "success_outcome": "Your caution allows you to learn the tomb's secrets safely",
          "failure_outcome": "Your defensive stance triggers more aggressive security measures"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Navigate the tomb's traps and puzzles to reach the inner chamber",
          "success_outcome": "Your skill bypasses the ancient security systems elegantly",
          "failure_outcome": "You trigger a trap that seals you inside the tomb"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Show proper respect to the forgotten Prime's memory",
          "success_outcome": "Your reverence causes the guardians to stand down and grant access",
          "failure_outcome": "The guardians judge you unworthy of the Prime's legacy"
        }
      }
    },
    "38": {
      "id": "dimensional_rift_stabilization",
      "name": "Dimensional Rift Stabilization",
      "description": "A rift between dimensions has opened, bringing through strange alternate versions of familiar Transformers who don't understand they're in the wrong reality.",
      "difficulty_level": "moderate",
      "skill_thresholds": {
        "attack": 3,
        "defense": 6,
        "dexterity": 4,
        "charisma": 3
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Force the alternate versions back through the dimensional rift",
          "success_outcome": "Your decisive action sends the displaced Transformers home safely",
          "failure_outcome": "Your attacks damage the rift, making it unstable and dangerous"
        },
        "defense": {
          "skill": "Defense",
          "description": "Contain the dimensional instability while seeking a permanent solution",
          "success_outcome": "Your barriers stabilize the rift long enough to devise a proper closing method",
          "failure_outcome": "The dimensional energy overwhelms your containment systems"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Build a device to safely close the dimensional rift",
          "success_outcome": "Your technical expertise creates a controlled closure of the dimensional breach",
          "failure_outcome": "The dimensional physics are too complex for improvised solutions"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Explain the situation to the confused alternate-dimension visitors",
          "success_outcome": "Your explanation helps them understand and cooperate with returning home",
          "failure_outcome": "The alternate versions refuse to believe they're not in their own dimension"
        }
      }
    },
    "39": {
      "id": "energon_refinement_sabotage",
      "name": "Energon Refinement Sabotage",
      "description": "Someone has sabotaged the main energon refinement facility, causing dangerous instabilities that could result in a city-destroying explosion.",
      "difficulty_level": "hard",
      "skill_thresholds": {
        "attack": 4,
        "defense": 7,
        "dexterity": 8,
        "charisma": 5
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Destroy the sabotaged equipment before it can cause a larger explosion",
          "success_outcome": "Your controlled demolition prevents the catastrophic chain reaction",
          "failure_outcome": "Your explosive approach triggers the very disaster you tried to prevent"
        },
        "defense": {
          "skill": "Defense",
          "description": "Contain the energon instabilities within protective barriers",
          "success_outcome": "Your shielding contains the dangerous energon reactions safely",
          "failure_outcome": "The energon instabilities prove too volatile for standard containment"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Repair the sabotaged systems while they're still critically unstable",
          "success_outcome": "Your precise work restores stability to the refinement process",
          "failure_outcome": "The sabotage was more extensive and subtle than you realized"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Coordinate evacuation efforts while investigating who caused the sabotage",
          "success_outcome": "Your leadership saves lives and uncovers clues about the saboteur",
          "failure_outcome": "Panic spreads faster than your evacuation efforts can manage"
        }
      }
    },
    "40": {
      "id": "gladiator_pit_uprising",
      "name": "Gladiator Pit Uprising",
      "description": "The gladiatorial pits where Transformers fight for entertainment have erupted into full rebellion, with gladiators demanding freedom and rights.",
      "difficulty_level": "hard",
      "skill_thresholds": {
        "attack": 9,
        "defense": 4,
        "dexterity": 6,
        "charisma": 7
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Suppress the gladiator uprising through superior combat skills",
          "success_outcome": "Your fighting prowess earns the gladiators' respect and ends the violence",
          "failure_outcome": "The gladiators are elite fighters and your attack only escalates the conflict"
        },
        "defense": {
          "skill": "Defense",
          "description": "Protect innocent spectators caught in the gladiator revolt",
          "success_outcome": "Your defensive actions save civilian lives during the chaotic uprising",
          "failure_outcome": "The arena's design makes it difficult to establish safe zones"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Disable the arena's control systems to free the gladiators from their constraints",
          "success_outcome": "Your technical work liberates the gladiators and ends their forced servitude",
          "failure_outcome": "The control systems have lethal security measures protecting them"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Negotiate between the gladiators and arena management for reform",
          "success_outcome": "Your mediation establishes new rights and freedoms for the gladiators",
          "failure_outcome": "Both sides have suffered too much to accept peaceful compromise"
        }
      }
    },
    "41": {
      "id": "memory_core_fragmentation",
      "name": "Memory Core Fragmentation",
      "description": "A vital historical archive's memory core has fragmented, scattering important records across multiple incompatible storage systems.",
      "difficulty_level": "hard",
      "skill_thresholds": {
        "attack": 2,
        "defense": 5,
        "dexterity": 9,
        "charisma": 6
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Force-merge the fragmented data through aggressive system integration",
          "success_outcome": "Your brute-force approach successfully reunifies the scattered archives",
          "failure_outcome": "Your aggressive methods corrupt some of the fragmented data permanently"
        },
        "defense": {
          "skill": "Defense",
          "description": "Protect the existing data while developing a careful recovery strategy",
          "success_outcome": "Your protective measures preserve all data during the careful reconstruction",
          "failure_outcome": "Your defensive protocols are too restrictive and prevent necessary repairs"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Carefully rebuild the archive by manually reassembling data fragments",
          "success_outcome": "Your meticulous work perfectly reconstructs the historical archives",
          "failure_outcome": "The data is too fragmented and corrupted for manual reconstruction"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Rally other scholars to help piece together the fragmented knowledge",
          "success_outcome": "Your collaborative effort combines expertise to restore the archives",
          "failure_outcome": "Too many different approaches create conflicts in the restoration process"
        }
      }
    },
    "42": {
      "id": "sentinel_awakening_ceremony",
      "name": "Sentinel Awakening Ceremony",
      "description": "An ancient Sentinel guardian is being reactivated after eons of slumber, but the awakening ritual requires precise timing and multiple participants.",
      "difficulty_level": "legendary",
      "skill_thresholds": {
        "attack": 8,
        "defense": 10,
        "dexterity": 11,
        "charisma": 9
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Channel your warrior's spirit to awaken the Sentinel's combat protocols",
          "success_outcome": "Your martial energy successfully reactivates the Sentinel's battle systems",
          "failure_outcome": "Your aggressive energy confuses the awakening process and creates system conflicts"
        },
        "defense": {
          "skill": "Defense",
          "description": "Provide protective energy to shield the Sentinel during its vulnerable awakening",
          "success_outcome": "Your protective aura ensures the Sentinel awakens safely and completely",
          "failure_outcome": "Your defensive energy interferes with the Sentinel's natural reactivation process"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Perform the precise ritual gestures and timing required for proper awakening",
          "success_outcome": "Your perfect execution of the ancient ceremony successfully awakens the Sentinel",
          "failure_outcome": "A tiny error in the complex ritual sequence causes the awakening to fail"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Speak the ancient words of awakening and convince the Sentinel to return to service",
          "success_outcome": "Your eloquent invocation inspires the Sentinel to awaken and serve once more",
          "failure_outcome": "The Sentinel judges the current age unworthy of its protection"
        }
      }
    },
    "43": {
      "id": "rogue_hologram_invasion",
      "name": "Rogue Hologram Invasion",
      "description": "Abandoned holographic training programs have gained sentience and believe they're real Transformers fighting an actual war against intruders.",
      "difficulty_level": "easy",
      "skill_thresholds": {
        "attack": 4,
        "defense": 2,
        "dexterity": 2,
        "charisma": 4
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Destroy the holographic projectors to end the rogue programs",
          "success_outcome": "Your targeted strikes shut down the malfunctioning holographic systems",
          "failure_outcome": "The holograms have backup projectors you didn't account for"
        },
        "defense": {
          "skill": "Defense",
          "description": "Shield yourself and others from the holographic attacks",
          "success_outcome": "Your defenses prove effective against the illusory but still dangerous attacks",
          "failure_outcome": "The holograms adapt their attack patterns faster than you can adjust your defenses"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Reprogram the holographic systems to end the malfunction",
          "success_outcome": "Your technical skills successfully restore the programs to their original parameters",
          "failure_outcome": "The rogue programs have evolved beyond your programming expertise"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Convince the holographic Transformers that they're not real",
          "success_outcome": "Your logical arguments help the programs understand their true nature",
          "failure_outcome": "The holograms refuse to accept that their existence and experiences aren't real"
        }
      }
    },
    "44": {
      "id": "cosmic_rust_meteor_impact",
      "name": "Cosmic Rust Meteor Impact",
      "description": "A meteor carrying cosmic rust is about to impact Cybertron. The infection could spread across the entire planet if not stopped.",
      "difficulty_level": "legendary",
      "skill_thresholds": {
        "attack": 12,
        "defense": 8,
        "dexterity": 9,
        "charisma": 7
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Destroy the meteor before it can reach Cybertron's surface",
          "success_outcome": "Your overwhelming firepower vaporizes the meteor and its deadly cargo",
          "failure_outcome": "The meteor fragments scatter cosmic rust spores across a wider area"
        },
        "defense": {
          "skill": "Defense",
          "description": "Create a containment field around the impact site",
          "success_outcome": "Your barrier successfully contains the cosmic rust infection at ground zero",
          "failure_outcome": "The cosmic rust proves more virulent than your containment can handle"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Redirect the meteor's trajectory away from populated areas",
          "success_outcome": "Your precise calculations safely redirect the meteor to an uninhabited region",
          "failure_outcome": "The meteor's composition makes it impossible to alter its trajectory"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Rally all of Cybertron's defenders for a coordinated response",
          "success_outcome": "Your leadership unites all factions against the existential threat",
          "failure_outcome": "Old grudges prevent effective cooperation in the face of disaster"
        }
      }
    },
    "45": {
      "id": "quantum_duplicate_paradox",
      "name": "Quantum Duplicate Paradox",
      "description": "Quantum experiments have created multiple versions of yourself from different timelines, and they're all trying to return to their own realities.",
      "difficulty_level": "moderate",
      "skill_thresholds": {
        "attack": 5,
        "defense": 3,
        "dexterity": 7,
        "charisma": 1
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Fight your alternate selves to establish dominance over this timeline",
          "success_outcome": "Your victory proves you're the rightful inhabitant of this reality",
          "failure_outcome": "Fighting yourself creates temporal paradoxes that worsen the situation"
        },
        "defense": {
          "skill": "Defense",
          "description": "Protect yourself from your alternate selves while seeking a peaceful solution",
          "success_outcome": "Your defensive stance prevents temporal damage while you find a solution",
          "failure_outcome": "Your alternate selves interpret your defensive posture as weakness"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Build a quantum device to safely return each duplicate to their proper timeline",
          "success_outcome": "Your technical solution successfully resolves the quantum paradox",
          "failure_outcome": "The quantum mechanics involved are beyond current scientific understanding"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Negotiate with your alternate selves to find a mutually acceptable solution",
          "success_outcome": "Your diplomatic skills help all versions find a way to coexist peacefully",
          "failure_outcome": "Your alternate selves have incompatible goals and personalities"
        }
      }
    },
    "46": {
      "id": "datatrack_memory_theft",
      "name": "Datatrack Memory Theft",
      "description": "Information-specialized Transformers called Datatracks are having their memories stolen by unknown hackers, erasing vital knowledge forever.",
      "difficulty_level": "easy",
      "skill_thresholds": {
        "attack": 1,
        "defense": 4,
        "dexterity": 4,
        "charisma": 3
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Hunt down and eliminate the memory thieves",
          "success_outcome": "Your aggressive pursuit stops the hackers and recovers stolen data",
          "failure_outcome": "The hackers are too elusive and your attacks only alert them to your presence"
        },
        "defense": {
          "skill": "Defense",
          "description": "Create protective firewalls around the remaining Datatracks",
          "success_outcome": "Your cyber-defenses successfully protect the remaining knowledge stores",
          "failure_outcome": "The hackers find vulnerabilities in your protective systems"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Trace the data theft back to its source through technical investigation",
          "success_outcome": "Your digital forensics uncover the hackers' location and methods",
          "failure_outcome": "The hackers have covered their tracks too well for your investigation"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Convince other Datatracks to share backup copies of stolen information",
          "success_outcome": "Your networking skills help restore much of the stolen knowledge",
          "failure_outcome": "The Datatracks are too frightened to share their remaining data"
        }
      }
    },
    "47": {
      "id": "space_whale_migration",
      "name": "Space Whale Migration",
      "description": "A pod of massive space-faring creatures is migrating through Cybertronian space, but their route will take them through a heavily traveled shipping lane.",
      "difficulty_level": "moderate",
      "skill_thresholds": {
        "attack": 2,
        "defense": 4,
        "dexterity": 5,
        "charisma": 5
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Drive the space whales away from the shipping lanes through intimidation",
          "success_outcome": "Your threatening displays convince the pod to alter their migration route",
          "failure_outcome": "The space whales perceive your aggression as a territorial challenge"
        },
        "defense": {
          "skill": "Defense",
          "description": "Escort the space whales safely through the shipping lanes",
          "success_outcome": "Your protective convoy ensures both the whales and ships remain safe",
          "failure_outcome": "The escort mission is too complex to coordinate effectively"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Guide the space whales to an alternate route that avoids ship traffic",
          "success_outcome": "Your navigation skills lead the pod safely around the busy shipping lanes",
          "failure_outcome": "The alternate route contains hazards you didn't anticipate"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Communicate with the space whales to understand their migration needs",
          "success_outcome": "Your inter-species communication establishes cooperation for safe passage",
          "failure_outcome": "The space whales' consciousness is too alien for meaningful dialogue"
        }
      }
    },
    "48": {
      "id": "transformation_cog_plague",
      "name": "Transformation Cog Plague",
      "description": "A mechanical virus is attacking Transformers' transformation cogs, leaving them trapped in one form and potentially destroying their ability to transform forever.",
      "difficulty_level": "hard",
      "skill_thresholds": {
        "attack": 6,
        "defense": 8,
        "dexterity": 10,
        "charisma": 4
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Burn out the infected transformation systems to prevent spread",
          "success_outcome": "Your aggressive treatment stops the virus but damages some transformation ability",
          "failure_outcome": "Your destructive approach spreads viral fragments to healthy systems"
        },
        "defense": {
          "skill": "Defense",
          "description": "Isolate infected Transformers to prevent the plague from spreading",
          "success_outcome": "Your quarantine measures successfully contain the viral outbreak",
          "failure_outcome": "The virus has already spread too widely for effective quarantine"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Perform microsurgery to remove the virus from infected transformation cogs",
          "success_outcome": "Your surgical precision successfully purges the virus while preserving function",
          "failure_outcome": "The virus has integrated too deeply into the transformation mechanisms"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Coordinate research efforts to develop a cure for the transformation plague",
          "success_outcome": "Your leadership unites the best minds to create an effective antivirus",
          "failure_outcome": "Scientific egos and rivalries hamper the collaborative research effort"
        }
      }
    },
    "49": {
      "id": "vok_reality_manipulation",
      "name": "Vok Reality Manipulation",
      "description": "The mysterious Vok have begun manipulating local reality, causing impossible things to happen and threatening the fabric of existence itself.",
      "difficulty_level": "mythic",
      "skill_thresholds": {
        "attack": 11,
        "defense": 13,
        "dexterity": 12,
        "charisma": 12
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Launch direct assaults on the Vok's reality-warping focal points",
          "success_outcome": "Your attacks disrupt the Vok's reality manipulation and restore normal physics",
          "failure_outcome": "Your attacks are twisted by the Vok's power and turn against you"
        },
        "defense": {
          "skill": "Defense",
          "description": "Create stability fields to anchor reality against Vok manipulation",
          "success_outcome": "Your defensive measures maintain pockets of stable reality amid the chaos",
          "failure_outcome": "The Vok's reality alterations overwhelm your stabilization efforts"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Build devices to counteract the Vok's reality-warping technology",
          "success_outcome": "Your technical expertise creates effective countermeasures against the Vok",
          "failure_outcome": "The Vok's technology operates on principles beyond current understanding"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Attempt to communicate with the Vok and understand their motivations",
          "success_outcome": "Your diplomatic contact establishes dialogue and prevents further reality damage",
          "failure_outcome": "The Vok consider your species too primitive for meaningful communication"
        }
      }
    },
    "50": {
      "id": "cybertron_core_awakening",
      "name": "Cybertron Core Awakening",
      "description": "The planet Cybertron itself is beginning to awaken as Primus stirs from eons of slumber, causing massive geological upheavals and consciousness emergence.",
      "difficulty_level": "legendary",
      "skill_thresholds": {
        "attack": 10,
        "defense": 11,
        "dexterity": 8,
        "charisma": 11
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Try to force Primus back into dormancy to prevent planetary destruction",
          "success_outcome": "Your power is sufficient to guide Primus back into restful slumber",
          "failure_outcome": "Your attack on Primus brands you as a threat to be eliminated"
        },
        "defense": {
          "skill": "Defense",
          "description": "Protect Transformer cities from the geological upheavals",
          "success_outcome": "Your massive defensive efforts save countless lives during the awakening",
          "failure_outcome": "The planetary-scale upheavals exceed even your defensive capabilities"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Help guide Primus's awakening to minimize destructive side effects",
          "success_outcome": "Your technical guidance helps Primus awaken without destroying civilization",
          "failure_outcome": "Primus's consciousness is too vast and alien for your guidance to affect"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Serve as a voice for all Transformers in communion with the awakening Primus",
          "success_outcome": "Your representation helps Primus understand and protect his children",
          "failure_outcome": "Primus's awakening consciousness is too overwhelming for meaningful dialogue"
        }
      }
    },
    "51": {
      "id": "temporal_causality_loop",
      "name": "Temporal Causality Loop",
      "description": "Time experiments have created a causality loop where your actions to prevent a disaster are actually causing it to happen in the first place.",
      "difficulty_level": "mythic",
      "skill_thresholds": {
        "attack": 13,
        "defense": 11,
        "dexterity": 13,
        "charisma": 11
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Break the causality loop through overwhelming force applied at the temporal nexus",
          "success_outcome": "Your massive assault shatters the temporal loop and restores linear time",
          "failure_outcome": "Your attack becomes part of the loop, making the paradox even stronger"
        },
        "defense": {
          "skill": "Defense",
          "description": "Protect the timeline by accepting the loop and minimizing its harmful effects",
          "success_outcome": "Your acceptance stabilizes the loop in its least harmful configuration",
          "failure_outcome": "Your defensive measures trap you permanently within the temporal paradox"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Carefully adjust the temporal mechanics to unravel the paradox",
          "success_outcome": "Your precise alterations elegantly resolve the causality paradox",
          "failure_outcome": "The temporal mechanics are too complex and your changes worsen the loop"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Convince your past/future selves to break the loop through coordinated action",
          "success_outcome": "Your persuasive abilities unite all temporal versions of yourself to break free",
          "failure_outcome": "Your alternate temporal selves have incompatible perspectives and refuse cooperation"
        }
      }
    },
    "52": {
      "id": "dark_energon_corruption",
      "name": "Dark Energon Corruption",
      "description": "You discover a cache of dark energon that pulses with malevolent energy. Its corruption threatens to overwhelm your systems.",
      "difficulty_level": "hard",
      "skill_thresholds": {
        "attack": 8,
        "defense": 6,
        "dexterity": 7,
        "charisma": 9
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Destroy the dark energon before it can corrupt you further",
          "success_outcome": "Your powerful assault obliterates the dark energon, purifying the area",
          "failure_outcome": "The dark energon feeds on your aggression, growing stronger and more corrupting"
        },
        "defense": {
          "skill": "Defense",
          "description": "Shield yourself from the corruption while seeking a safe way to contain it",
          "success_outcome": "Your defenses hold strong, allowing you to safely contain the dark energon",
          "failure_outcome": "The corruption seeps through your defenses, beginning to taint your spark"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Carefully extract and neutralize the dark energon using precise techniques",
          "success_outcome": "Your delicate work successfully neutralizes the dark energon's malevolent properties",
          "failure_outcome": "A slight miscalculation causes the dark energon to explode in corrupting waves"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Rally other Transformers to help you deal with this threat together",
          "success_outcome": "Your leadership unites others in successfully containing the dark energon threat",
          "failure_outcome": "Others are too afraid of corruption to help, leaving you to face it alone"
        }
      }
    },
    "53": {
      "id": "predacon_fossil_discovery",
      "name": "Predacon Fossil Discovery",
      "description": "You uncover ancient Predacon fossils that could be used to create new beast warriors, but they're guarded by automated defenses.",
      "difficulty_level": "moderate",
      "skill_thresholds": {
        "attack": 6,
        "defense": 7,
        "dexterity": 5,
        "charisma": 8
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Blast through the automated defenses to reach the fossils",
          "success_outcome": "Your assault overwhelms the defenses, securing the valuable Predacon fossils",
          "failure_outcome": "The defenses adapt to your attacks, becoming stronger and more aggressive"
        },
        "defense": {
          "skill": "Defense",
          "description": "Weather the defensive systems while finding their weak points",
          "success_outcome": "Your patience reveals a vulnerability, allowing safe access to the fossils",
          "failure_outcome": "The prolonged assault from the defenses begins to wear down your armor"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Sneak past the defenses using stealth and precision",
          "success_outcome": "Your stealthy approach bypasses all defenses, securing the fossils undetected",
          "failure_outcome": "You trigger a motion sensor, activating all defensive systems at once"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Try to communicate with the ancient AI controlling the defenses",
          "success_outcome": "You successfully negotiate with the ancient AI, gaining peaceful access",
          "failure_outcome": "The AI views you as a grave robber and intensifies its defensive protocols"
        }
      }
    },
    "54": {
      "id": "omega_supreme_awakening",
      "name": "Omega Supreme Awakening",
      "description": "The massive Autobot guardian Omega Supreme begins to stir from eons of slumber. His awakening could be beneficial or catastrophic.",
      "difficulty_level": "legendary",
      "skill_thresholds": {
        "attack": 10,
        "defense": 9,
        "dexterity": 11,
        "charisma": 8
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Demonstrate your strength to prove you're worthy of Omega Supreme's attention",
          "success_outcome": "Omega Supreme recognizes your power and accepts you as an ally",
          "failure_outcome": "Omega Supreme sees your aggression as a threat and prepares to eliminate you"
        },
        "defense": {
          "skill": "Defense",
          "description": "Protect nearby structures from damage as Omega Supreme awakens",
          "success_outcome": "Your protective actions earn Omega Supreme's respect and gratitude",
          "failure_outcome": "You're overwhelmed by the scale of destruction from his awakening"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Carefully assist with Omega Supreme's reactivation systems",
          "success_outcome": "Your technical expertise helps Omega Supreme awaken smoothly and peacefully",
          "failure_outcome": "Your interference causes system malfunctions in the massive guardian"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Speak to Omega Supreme's ancient consciousness as he awakens",
          "success_outcome": "Your words guide Omega Supreme to a peaceful and controlled awakening",
          "failure_outcome": "Omega Supreme awakens confused and disoriented, seeing you as a potential enemy"
        }
      }
    },
    "55": {
      "id": "spark_extractor_malfunction",
      "name": "Spark Extractor Malfunction",
      "description": "A Decepticon spark extractor has malfunctioned and is draining energy from all nearby Transformers, including you.",
      "difficulty_level": "hard",
      "skill_thresholds": {
        "attack": 7,
        "defense": 8,
        "dexterity": 6,
        "charisma": 9
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Destroy the spark extractor before it can drain you completely",
          "success_outcome": "Your powerful assault destroys the extractor, stopping the energy drain",
          "failure_outcome": "The extractor absorbs your attack energy, becoming even more powerful"
        },
        "defense": {
          "skill": "Defense",
          "description": "Shield yourself from the energy drain while finding a solution",
          "success_outcome": "Your defenses hold long enough for you to find and exploit a weakness",
          "failure_outcome": "The constant drain overwhelms your defensive systems"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Carefully rewire the extractor to shut down safely",
          "success_outcome": "Your precise work safely disables the extractor without causing an explosion",
          "failure_outcome": "The complex systems overload from your modifications, causing a dangerous feedback"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Coordinate with other affected Transformers to overcome the threat together",
          "success_outcome": "Your leadership unites everyone to successfully disable the extractor",
          "failure_outcome": "Panic spreads among the affected Transformers, making the situation worse"
        }
      }
    },
    "56": {
      "id": "cybertron_memory_core",
      "name": "Cybertron Memory Core",
      "description": "You discover a memory core containing the lost history of Cybertron's golden age, but accessing it risks mental overload.",
      "difficulty_level": "epic",
      "skill_thresholds": {
        "attack": 9,
        "defense": 7,
        "dexterity": 8,
        "charisma": 6
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Force your way through the memory barriers to access the core data",
          "success_outcome": "Your mental fortitude breaks through, granting you ancient Cybertronian knowledge",
          "failure_outcome": "The forced access causes severe mental trauma and memory fragmentation"
        },
        "defense": {
          "skill": "Defense",
          "description": "Protect your mind while gradually accessing the memory core",
          "success_outcome": "Your mental defenses allow safe access to the precious historical data",
          "failure_outcome": "Your overly cautious approach prevents you from accessing the deeper memories"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Carefully interface with the memory core using precise neural connections",
          "success_outcome": "Your delicate approach successfully downloads the historical data safely",
          "failure_outcome": "A connection error causes the memory core to corrupt and become unreadable"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Communicate with the memory core's guardian AI to request access",
          "success_outcome": "The guardian AI deems you worthy and grants full access to the memories",
          "failure_outcome": "The guardian AI finds you unworthy and seals the memory core permanently"
        }
      }
    },
    "57": {
      "id": "insecticon_swarm_encounter",
      "name": "Insecticon Swarm Encounter",
      "description": "A massive swarm of wild Insecticons blocks your path, consuming everything in their way with mechanical hunger.",
      "difficulty_level": "hard",
      "skill_thresholds": {
        "attack": 6,
        "defense": 9,
        "dexterity": 7,
        "charisma": 8
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Fight your way through the swarm with overwhelming firepower",
          "success_outcome": "Your devastating assault scatters the swarm, clearing your path",
          "failure_outcome": "The swarm overwhelms you with sheer numbers despite your attacks"
        },
        "defense": {
          "skill": "Defense",
          "description": "Create barriers and fortifications to protect yourself from the swarm",
          "success_outcome": "Your defenses hold strong, and the swarm eventually moves on",
          "failure_outcome": "The Insecticons devour your defensive materials, weakening your position"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Navigate around the swarm using stealth and agility",
          "success_outcome": "Your nimble movements allow you to bypass the swarm undetected",
          "failure_outcome": "You accidentally disturb the swarm, causing them to focus entirely on you"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Try to communicate with the swarm's hive mind to negotiate passage",
          "success_outcome": "You successfully negotiate safe passage through the swarm's territory",
          "failure_outcome": "The hive mind sees you as a threat and directs the entire swarm to attack"
        }
      }
    },
    "58": {
      "id": "allspark_fragment_resonance",
      "name": "AllSpark Fragment Resonance",
      "description": "Multiple AllSpark fragments begin resonating with each other, creating dangerous energy fluctuations that could tear reality apart.",
      "difficulty_level": "mythic",
      "skill_thresholds": {
        "attack": 12,
        "defense": 10,
        "dexterity": 11,
        "charisma": 13
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Disrupt the resonance by destroying the weaker fragments",
          "success_outcome": "Your precise strikes break the resonance, stabilizing reality",
          "failure_outcome": "Your attacks cause the fragments to resonate even more violently"
        },
        "defense": {
          "skill": "Defense",
          "description": "Shield the area from the reality-warping effects while seeking a solution",
          "success_outcome": "Your protective barriers contain the effect until it naturally subsides",
          "failure_outcome": "The reality distortions overwhelm your defenses, affecting your own existence"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Carefully adjust the fragments' positions to create harmonic resonance",
          "success_outcome": "Your precise manipulation creates a stable, beneficial resonance pattern",
          "failure_outcome": "The fragments' power is too great, and your adjustments cause a reality cascade"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Commune with the AllSpark's consciousness to calm the resonance",
          "success_outcome": "The AllSpark responds to your plea, peacefully ending the dangerous resonance",
          "failure_outcome": "The AllSpark's consciousness is too alien to understand your communication"
        }
      }
    },
    "59": {
      "id": "decepticon_interrogation",
      "name": "Decepticon Interrogation",
      "description": "You've been captured by Decepticons who demand information about Autobot operations. Your responses will determine your fate.",
      "difficulty_level": "moderate",
      "skill_thresholds": {
        "attack": 7,
        "defense": 6,
        "dexterity": 8,
        "charisma": 5
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Break free from your restraints and fight your way out",
          "success_outcome": "Your sudden assault catches them off guard, allowing you to escape",
          "failure_outcome": "Your escape attempt fails, and they increase security around you"
        },
        "defense": {
          "skill": "Defense",
          "description": "Resist their interrogation techniques and protect sensitive information",
          "success_outcome": "Your mental fortitude protects all sensitive information from extraction",
          "failure_outcome": "The interrogation breaks through some of your mental defenses"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Subtly work on your restraints while appearing cooperative",
          "success_outcome": "You successfully free yourself without alerting your captors",
          "failure_outcome": "Your movements are detected, and they apply stronger restraints"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Try to turn your interrogators against each other or convert them",
          "success_outcome": "Your words sow discord among your captors, creating an opportunity to escape",
          "failure_outcome": "Your manipulation attempts are recognized and they become more hostile"
        }
      }
    },
    "60": {
      "id": "primus_awakening_signs",
      "name": "Primus Awakening Signs",
      "description": "Strange phenomena suggest that Primus, the creator god, may be stirring from his eternal slumber. The implications are cosmic.",
      "difficulty_level": "legendary",
      "skill_thresholds": {
        "attack": 11,
        "defense": 10,
        "dexterity": 12,
        "charisma": 9
      },
      "choices": {
        "attack": {
          "skill": "Attack",
          "description": "Prepare for cosmic battle, as Primus's awakening might herald Unicron's return",
          "success_outcome": "Your preparations position you as a champion ready for cosmic warfare",
          "failure_outcome": "Your aggressive preparations are seen as a threat to cosmic balance"
        },
        "defense": {
          "skill": "Defense",
          "description": "Protect Cybertron and its inhabitants from the cosmic energies of awakening",
          "success_outcome": "Your protective measures shield countless lives from cosmic disruption",
          "failure_outcome": "The cosmic forces are too vast for your defenses to meaningfully protect against"
        },
        "dexterity": {
          "skill": "Dexterity",
          "description": "Carefully monitor and document the awakening signs for future reference",
          "success_outcome": "Your precise observations provide crucial data about divine awakening patterns",
          "failure_outcome": "The cosmic phenomena are too complex for your instruments to properly record"
        },
        "charisma": {
          "skill": "Charisma",
          "description": "Rally all Transformers to prepare for the cosmic changes ahead",
          "success_outcome": "Your leadership unites all factions in preparation for the cosmic event",
          "failure_outcome": "The magnitude of the situation causes panic rather than unity"
        }
      }
    }
  },
  "encounter_resolution": {
    "outcome_effects": {
      "major_setback": {
        "description": "Significant negative consequences affect your journey"
      },
      "neutral_outcome": {
        "description": "The situation resolves without major positive or negative effects"
      },
      "positive_outcome": {
        "description": "Your success brings beneficial results to your journey"
      },
      "exceptional_outcome": {
        "description": "Outstanding success with remarkable positive consequences"
      }
    },
    "secondary_roll_outcomes": {
      "success_threshold": 5,
      "failure_result": "major_setback",
      "success_result": "positive_outcome"
    }
  }
}