{
  "story_map": {
    "event_start": {
      "text": "You awaken in a decrepit sanitarium cell, your skin crawling with invisible insects. The air reeks of decay and madness. A flickering bulb casts writhing shadows that seem to reach for you with skeletal fingers. Blood-stained walls pulse like a beating heart. What do you do?",
      "choices": {
        "Bang on the door and scream for help": {
          "success_chance": 65,
          "success_text": ["Your desperate cries echo through the halls. Footsteps approach and the door creaks open, revealing freedom."],
          "failure_text": ["Your screams are met with chilling whispers from the walls themselves. The voices promise you'll never leave this place alive."],
          "success_next_stage": "event_1",
          "failure_next_stage": "event_1",
          "fear_change": 8,
          "success_fear_change": -5
        },
        "Try to pry open the door with bare hands": {
          "success_chance": 45,
          "success_text": ["You manage to bend the hinges enough to slip through. Your determination pays off despite the pain."],
          "failure_text": ["The metal is unyielding and cuts your hands. A low growl sounds from behind the door, mocking your weakness as blood drips."],
          "success_next_stage": "event_1",
          "failure_next_stage": "event_1",
          "fear_change": 15,
          "success_fear_change": 2
        },
        "Wait silently and observe": {
          "success_chance": 55,
          "success_text": ["After patient waiting, you hear a key scraping. The door unlocks mysteriously."],
          "failure_text": ["Hours pass in terrifying silence. Strange shadows begin moving in your peripheral vision, growing bolder."],
          "success_next_stage": "event_1",
          "failure_next_stage": "event_1",
          "fear_change": 20,
          "success_fear_change": -10,
          "total_failure_chance": 8
        }
      }
    },
    "event_1": {
      "text": "You step into a long, dark hallway where the floorboards creak ominously under your feet. Shadows writhe along the walls like living things, and you hear the sound of children crying from empty rooms. The temperature drops suddenly, and your breath becomes visible. What do you do?",
      "choices": {
        "Walk cautiously toward the distant light": {
          "success_chance": 75,
          "success_text": ["You reach the end safely, finding a patient room with useful items scattered about."],
          "failure_text": ["A disembodied scream tears through the air. You stumble but keep moving forward as something brushes against your neck."],
          "success_next_stage": "event_2",
          "failure_next_stage": "event_2",
          "fear_change": 10,
          "success_fear_change": 0
        },
        "Search the hallway for clues": {
          "success_chance": 50,
          "success_text": ["You find a loose floorboard hiding a rusty key covered in dried blood. It might be useful later."],
          "failure_text": ["The creaking stops suddenly. Whispers return, closer and more menacing than before, speaking your name."],
          "success_next_stage": "event_2",
          "failure_next_stage": "event_2",
          "fear_change": 14,
          "success_fear_change": -8
        },
        "Run as fast as you can": {
          "success_chance": 40,
          "success_text": ["You sprint successfully and burst through a door, finding temporary safety in another room."],
          "failure_text": ["You trip in the darkness and fall hard. Something cold grabs at your ankle as you scramble away in terror."],
          "success_next_stage": "event_2",
          "failure_next_stage": "event_2",
          "fear_change": 18,
          "success_fear_change": -5,
          "total_failure_chance": 7
        }
      }
    },
    "event_2": {
      "text": "You're in a decrepit patient room where a journal lies open on a nightstand, its pages fluttering despite no wind. Medical equipment rusts in the corner, and fresh scratch marks cover the walls, still bleeding. The mirror reflects something standing behind you, but when you turn, nothing is there. What do you do?",
      "choices": {
        "Read the journal thoroughly": {
          "success_chance": 80,
          "success_text": ["The journal reveals Dr. Crowley's horrific experiments and mentions a cursed amulet hidden in his office."],
          "failure_text": ["The journal's final page contains a curse written in blood. Dark words burn into your mind like acid."],
          "success_next_stage": "event_3",
          "failure_next_stage": "event_3",
          "fear_change": 8,
          "success_fear_change": -10
        },
        "Examine the medical equipment": {
          "success_chance": 60,
          "success_text": ["You find a rusty scalpel that might serve as a weapon. It gives you confidence despite its ominous stains."],
          "failure_text": ["The equipment suddenly activates on its own, creating terrifying mechanical sounds and spraying unknown fluids."],
          "success_next_stage": "event_3",
          "failure_next_stage": "event_3",
          "fear_change": 18,
          "success_fear_change": -15
        },
        "Investigate the scratch marks": {
          "success_chance": 45,
          "success_text": ["The scratches form a pattern pointing toward a hidden passage behind the wall."],
          "failure_text": ["The scratches begin bleeding fresh blood as you touch them. You realize they were made by fingernails clawing desperately."],
          "success_next_stage": "event_3",
          "failure_next_stage": "event_3",
          "fear_change": 25,
          "success_fear_change": -12,
          "total_failure_chance": 9
        }
      }
    },
    "event_3": {
      "text": "You enter the medical wing where surgical tables are stained with old and fresh blood. Broken glass crunches under your feet, and you hear distant moaning that sounds almost human. The smell of formaldehyde mixes with something far worse. Surgical instruments hang from the ceiling, swaying despite no breeze. What do you do?",
      "choices": {
        "Enter the morgue": {
          "success_chance": 50,
          "success_text": ["You find a hidden passage behind the morgue drawers leading deeper into the facility's bowels."],
          "failure_text": ["The morgue drawers slam open and shut violently. Something moves in the shadows between them, dragging chains."],
          "success_next_stage": "event_4",
          "failure_next_stage": "event_4",
          "fear_change": 25,
          "success_fear_change": -8
        },
        "Go to Dr. Crowley's office": {
          "success_chance": 70,
          "success_text": ["You find Dr. Crowley's research notes detailing his experiments and the location of his cursed amulet."],
          "failure_text": ["Dr. Crowley's ghost appears in his chair, his eyes burning with malevolent intelligence and hatred for the living."],
          "success_next_stage": "event_4",
          "failure_next_stage": "event_4",
          "fear_change": 15,
          "success_fear_change": -12
        },
        "Take the basement stairs": {
          "success_chance": 55,
          "success_text": ["You descend carefully, finding the basement laboratory where the real horrors took place."],
          "failure_text": ["The stairs creak ominously as you descend. You hear something large following you down into the darkness."],
          "success_next_stage": "event_4",
          "failure_next_stage": "event_4",
          "fear_change": 12,
          "success_fear_change": -15,
          "total_failure_chance": 10
        }
      }
    },
    "event_4": {
      "text": "The basement laboratory is a nightmare of rusted surgical equipment and specimen jars containing floating horrors. In the center sits an altar with a glowing amulet that pulses like a heartbeat. Ghostly figures of tortured patients surround you, their mouths open in silent screams. The air itself seems to whisper threats. What do you do?",
      "choices": {
        "Grab the amulet immediately": {
          "success_chance": 35,
          "success_text": ["You seize the amulet. Its power burns your hand but grants you control over the vengeful spirits."],
          "failure_text": ["The amulet's curse overwhelms you. Visions of Dr. Crowley's victims flood your mind with their agony."],
          "success_next_stage": "event_5",
          "failure_next_stage": "event_5",
          "fear_change": 30,
          "success_fear_change": -20
        },
        "Try to communicate with the spirits": {
          "success_chance": 65,
          "success_text": ["The spirits recognize your compassion. They tell you how to safely handle the cursed amulet."],
          "failure_text": ["The spirits are too tormented to listen. Their anguished wails pierce your soul like ice-cold needles."],
          "success_next_stage": "event_5",
          "failure_next_stage": "event_5",
          "fear_change": 20,
          "success_fear_change": -10
        },
        "Look for another way to destroy the amulet": {
          "success_chance": 45,
          "success_text": ["You find Dr. Crowley's notes on how to break the curse using a specific blood ritual."],
          "failure_text": ["Your search triggers a trap. Poisonous gas begins filling the chamber as alarms wail."],
          "success_next_stage": "event_5",
          "failure_next_stage": "event_5",
          "fear_change": 15,
          "success_fear_change": -18,
          "total_failure_chance": 8
        }
      }
    },
    "event_5": {
      "text": "Dr. Crowley's spirit materializes, his form twisted by decades of malevolence and surgical self-experimentation. His face is a patchwork of different people's features. The patient spirits cower in fear as he raises his spectral hands, dripping with ectoplasmic blood. The temperature plummets to freezing. What do you do?",
      "choices": {
        "Confront Dr. Crowley directly": {
          "success_chance": 45,
          "success_text": ["Your courage surprises him. You manage to grab the amulet and channel its power against his evil."],
          "failure_text": ["Dr. Crowley's spirit overwhelms you with visions of his cruelest experiments performed on living subjects."],
          "success_next_stage": "event_6",
          "failure_next_stage": "event_6",
          "fear_change": 25,
          "success_fear_change": -15
        },
        "Rally the patient spirits to help": {
          "success_chance": 70,
          "success_text": ["The patient spirits unite with you, their combined will weakening Dr. Crowley's supernatural hold."],
          "failure_text": ["Dr. Crowley turns the patient spirits against you. They attack with desperate fury, clawing at your flesh."],
          "success_next_stage": "event_6",
          "failure_next_stage": "event_6",
          "fear_change": 18,
          "success_fear_change": -12
        },
        "Attempt to perform the ritual you learned": {
          "success_chance": 60,
          "success_text": ["You begin the ritual correctly. The amulet's power starts to turn against Dr. Crowley's evil essence."],
          "failure_text": ["You misremember part of the ritual. The amulet's power backfires, strengthening Dr. Crowley's malevolent form."],
          "success_next_stage": "event_6",
          "failure_next_stage": "event_6",
          "fear_change": 10,
          "success_fear_change": -25,
          "total_failure_chance": 9
        }
      }
    },
    "event_6": {
      "text": "The ritual chamber erupts in supernatural energy that makes your skin crawl. Dr. Crowley's form wavers as the amulet's power fluctuates wildly, creating reality distortions. The patient spirits watch hopefully while the walls themselves seem to bleed. The very air screams with tortured voices. What do you do?",
      "choices": {
        "Pour all your will into destroying the amulet": {
          "success_chance": 55,
          "success_text": ["The amulet cracks and shatters. Dr. Crowley's scream echoes as he's banished to eternal torment."],
          "failure_text": ["The amulet resists your will. Dr. Crowley begins to regain his strength, laughing maniacally."],
          "success_next_stage": "event_7",
          "failure_next_stage": "event_7",
          "fear_change": 15,
          "success_fear_change": -20
        },
        "Use the patient spirits' pain to fuel the ritual": {
          "success_chance": 75,
          "success_text": ["The spirits' suffering becomes power. The ritual succeeds, freeing them from their eternal torment."],
          "failure_text": ["The spirits' pain overwhelms the ritual. Their anguish feeds Dr. Crowley instead of weakening him."],
          "success_next_stage": "event_7",
          "failure_next_stage": "event_7",
          "fear_change": 20,
          "success_fear_change": -8
        },
        "Try to trap Dr. Crowley in the amulet instead": {
          "success_chance": 50,
          "success_text": ["You successfully bind Dr. Crowley's spirit within the amulet, containing his evil forever."],
          "failure_text": ["Dr. Crowley breaks free from your trap and possesses the amulet completely, becoming more powerful."],
          "success_next_stage": "event_7",
          "failure_next_stage": "event_7",
          "fear_change": 30,
          "success_fear_change": -22
        }
      }
    },
    "event_7": {
      "text": "Light floods the basement as Dr. Crowley's influence weakens, but the sanitarium still pulses with dark energy. The patient spirits begin to fade peacefully, but you sense other horrors stirring in the building's depths. The walls continue to bleed, and you hear something massive moving in the floors above. What do you do?",
      "choices": {
        "Burn down the entire sanitarium": {
          "success_chance": 80,
          "success_text": ["The flames purify the building. You escape as the sanitarium burns, taking its accumulated evil with it."],
          "failure_text": ["The fire spreads too quickly. You barely escape but the evil may have survived in the smoke."],
          "success_next_stage": "event_8",
          "failure_next_stage": "event_8",
          "fear_change": 8,
          "success_fear_change": -15
        },
        "Seal the basement and leave": {
          "success_chance": 85,
          "success_text": ["You seal the basement with blessed symbols. The evil is contained but not destroyed."],
          "failure_text": ["Your sealing ritual is incomplete. Some dark energy escapes as you leave, following you."],
          "success_next_stage": "event_8",
          "failure_next_stage": "event_8",
          "fear_change": 5,
          "success_fear_change": -10
        },
        "Take the amulet with you to study": {
          "success_chance": 50,
          "success_text": ["You safely contain the amulet's power. It could help others fight similar supernatural evils."],
          "failure_text": ["The amulet's corruption slowly begins to affect your mind and soul with whispered temptations."],
          "success_next_stage": "event_8",
          "failure_next_stage": "event_8",
          "fear_change": 12,
          "success_fear_change": -25,
          "total_failure_chance": 7
        }
      }
    },
    "event_8": {
      "text": "You emerge from the sanitarium into the cold night air that feels like ice against your skin. The building looms behind you, its windows dark but somehow watching. You sense you're not alone in the darkness - something followed you out. Shadows move independently of their sources. What do you do?",
      "choices": {
        "Run to your car and drive away quickly": {
          "success_chance": 75,
          "success_text": ["You reach your car safely and speed away, leaving the nightmare behind in your rearview mirror."],
          "failure_text": ["Your car won't start. Something moves in the shadows around you, circling like a predator."],
          "success_next_stage": "event_9",
          "failure_next_stage": "event_9",
          "fear_change": 15,
          "success_fear_change": -18
        },
        "Look back at the sanitarium one last time": {
          "success_chance": 60,
          "success_text": ["You see the spirits of the patients ascending peacefully into the night sky like glowing orbs."],
          "failure_text": ["Dr. Crowley's face appears in every window, his eyes burning with renewed hatred and promises of revenge."],
          "success_next_stage": "event_9",
          "failure_next_stage": "event_9",
          "fear_change": 20,
          "success_fear_change": -12
        },
        "Wait and make sure the evil is truly gone": {
          "success_chance": 65,
          "success_text": ["After hours of vigilance, you're satisfied that the immediate threat has been neutralized."],
          "failure_text": ["Your vigil attracts other dark entities drawn to the spiritual disturbance you've created."],
          "success_next_stage": "event_9",
          "failure_next_stage": "event_9",
          "fear_change": 10,
          "success_fear_change": -20,
          "total_failure_chance": 8
        }
      }
    },
    "event_9": {
      "text": "Days pass since your escape, but the memories haunt you like living things. You're back in civilization, but strange things begin happening around you - electronics malfunction, mirrors show things that aren't there, and you hear whispers in empty rooms. The supernatural has marked you. What do you do?",
      "choices": {
        "Seek help from a psychiatrist": {
          "success_chance": 70,
          "success_text": ["The therapy helps you process the trauma and distinguish reality from supernatural influence."],
          "failure_text": ["The psychiatrist doesn't believe you. The isolation makes the supernatural manifestations worse."],
          "success_next_stage": "event_10",
          "failure_next_stage": "event_10",
          "fear_change": 18,
          "success_fear_change": -20
        },
        "Research the sanitarium's history": {
          "success_chance": 65,
          "success_text": ["You discover records of Dr. Crowley's experiments and find others who survived similar supernatural encounters."],
          "failure_text": ["Your research attracts the attention of a cult that worshipped Dr. Crowley and his dark methods."],
          "success_next_stage": "event_10",
          "failure_next_stage": "event_10",
          "fear_change": 12,
          "success_fear_change": -15
        },
        "Try to forget and return to normal life": {
          "success_chance": 45,
          "success_text": ["You successfully suppress the memories and live a normal life, though haunted by nightmares."],
          "failure_text": ["The memories consume you. You spend your life in terror, never truly escaping the supernatural influence."],
          "success_next_stage": "event_10",
          "failure_next_stage": "event_10",
          "fear_change": 5,
          "success_fear_change": -25,
          "total_failure_chance": 9
        }
      }
    },
    "event_10": {
      "text": "Weeks later, you receive a letter written in what looks like blood. Someone claiming to be a paranormal investigator says others have reported similar experiences at abandoned medical facilities. The letter itself feels cold to the touch and seems to whisper when you're not looking directly at it. What do you do?",
      "choices": {
        "Meet with the investigator": {
          "success_chance": 80,
          "success_text": ["The investigator is legitimate and helps you understand what you experienced and how to protect yourself."],
          "failure_text": ["The 'investigator' is actually a cultist trying to recruit you for dark purposes involving Dr. Crowley's legacy."],
          "success_next_stage": "event_11",
          "failure_next_stage": "event_11",
          "fear_change": 10,
          "success_fear_change": -12
        },
        "Ignore the letter completely": {
          "success_chance": 70,
          "success_text": ["You choose to move on with your life, focusing on healing and recovery from the trauma."],
          "failure_text": ["Ignoring the letter was a mistake. The investigator was trying to warn you of approaching danger."],
          "success_next_stage": "event_11",
          "failure_next_stage": "event_11",
          "fear_change": 15,
          "success_fear_change": -8
        },
        "Investigate the investigator first": {
          "success_chance": 50,
          "success_text": ["Your caution pays off. You discover they're part of a secret organization fighting supernatural threats."],
          "failure_text": ["Your investigation alerts hostile forces to your location and activities, making you a target."],
          "success_next_stage": "event_11",
          "failure_next_stage": "event_11",
          "fear_change": 20,
          "success_fear_change": -18,
          "total_failure_chance": 6
        }
      }
    },
    "event_11": {
      "text": "A month passes. You're starting to feel normal again when you notice someone following you. They wear a dark coat and seem to appear wherever you go, always watching from the shadows. Their face is never clearly visible, and they cast no reflection in windows. Security cameras seem to malfunction when they're near. What do you do?",
      "choices": {
        "Confront the stalker directly": {
          "success_chance": 50,
          "success_text": ["The stalker reveals they're a guardian sent to protect survivors of supernatural encounters."],
          "failure_text": ["The stalker attacks you with supernatural abilities. You barely escape with your life and sanity."],
          "success_next_stage": "event_12",
          "failure_next_stage": "event_12",
          "fear_change": 25,
          "success_fear_change": -15
        },
        "Try to lose them in a crowd": {
          "success_chance": 75,
          "success_text": ["You successfully evade the stalker and find temporary safety in public spaces."],
          "failure_text": ["The stalker follows you despite the crowd. Their persistence is unnatural and terrifying."],
          "success_next_stage": "event_12",
          "failure_next_stage": "event_12",
          "fear_change": 18,
          "success_fear_change": -10
        },
        "Call the police for help": {
          "success_chance": 35,
          "success_text": ["The police take your report seriously and provide protection from the supernatural stalker."],
          "failure_text": ["The police don't believe you. The stalker becomes more aggressive, appearing in your home."],
          "success_next_stage": "event_12",
          "failure_next_stage": "event_12",
          "fear_change": 28,
          "success_fear_change": -20,
          "total_failure_chance": 5
        }
      }
    },
    "event_12": {
      "text": "You discover the stalker has left strange symbols carved into trees near your home. The symbols seem to pulse with dark energy and make your eyes water when you look directly at them. Animals avoid the area, and plants are withering around each symbol. The air itself feels thick and oppressive. What do you do?",
      "choices": {
        "Research the symbols' meaning": {
          "success_chance": 65,
          "success_text": ["You learn the symbols are protective wards, not threats. Someone is trying to help you against darker forces."],
          "failure_text": ["The symbols are a summoning circle. Your research accidentally activates them, calling something horrible."],
          "success_next_stage": "event_13",
          "failure_next_stage": "event_13",
          "fear_change": 15,
          "success_fear_change": -18
        },
        "Try to destroy the symbols": {
          "success_chance": 45,
          "success_text": ["You successfully remove the symbols, breaking whatever supernatural spell they were part of."],
          "failure_text": ["Destroying the symbols releases trapped dark energy into your neighborhood, affecting innocent people."],
          "success_next_stage": "event_13",
          "failure_next_stage": "event_13",
          "fear_change": 22,
          "success_fear_change": -12
        },
        "Leave them alone and move away": {
          "success_chance": 55,
          "success_text": ["You relocate successfully and the supernatural activity stops following you to your new location."],
          "failure_text": ["Moving doesn't help. The supernatural forces have marked you permanently, following wherever you go."],
          "success_next_stage": "event_13",
          "failure_next_stage": "event_13",
          "fear_change": 10,
          "success_fear_change": -25,
          "total_failure_chance": 8
        }
      }
    },
    "event_13": {
      "text": "Three months after the sanitarium, you're contacted by other survivors who bear similar supernatural scars. They want to form a support group to help each other cope with the otherworldly trauma. But you sense something is wrong - one of them feels different, colder, as if something else is wearing their skin. What do you do?",
      "choices": {
        "Join the support group eagerly": {
          "success_chance": 80,
          "success_text": ["The group provides healing and understanding. Together, you're stronger than the supernatural trauma."],
          "failure_text": ["One member of the group is still possessed by dark forces and tries to corrupt the others."],
          "success_next_stage": "event_14",
          "failure_next_stage": "event_14",
          "fear_change": 8,
          "success_fear_change": -20
        },
        "Attend but remain cautious": {
          "success_chance": 75,
          "success_text": ["Your caution helps you identify and avoid potential supernatural threats while still benefiting from support."],
          "failure_text": ["Your paranoia prevents you from forming meaningful connections with other survivors."],
          "success_next_stage": "event_14",
          "failure_next_stage": "event_14",
          "fear_change": 12,
          "success_fear_change": -15
        },
        "Decline and stay isolated": {
          "success_chance": 40,
          "success_text": ["You maintain your independence and develop your own coping mechanisms for the supernatural trauma."],
          "failure_text": ["Isolation makes you vulnerable to supernatural influences that specifically target lone survivors."],
          "success_next_stage": "event_14",
          "failure_next_stage": "event_14",
          "fear_change": 20,
          "success_fear_change": -8,
          "total_failure_chance": 7
        }
      }
    },
    "event_14": {
      "text": "Six months later, you're approached by a secret government agency that monitors supernatural threats. They know about your experience and offer you a job hunting other supernatural entities. Their building feels wrong - too many shadows, and the elevators sometimes go to floors that don't exist. What do you do?",
      "choices": {
        "Accept the job offer": {
          "success_chance": 70,
          "success_text": ["You become part of a team dedicated to protecting others from supernatural threats like Dr. Crowley."],
          "failure_text": ["The agency is corrupt and uses survivors as expendable assets in dangerous supernatural missions."],
          "success_next_stage": "event_15",
          "failure_next_stage": "event_15",
          "fear_change": 18,
          "success_fear_change": -12
        },
        "Decline but offer to consult": {
          "success_chance": 80,
          "success_text": ["You maintain your independence while still helping others as a supernatural consultant."],
          "failure_text": ["The agency doesn't accept your refusal and begins monitoring you as a potential supernatural threat."],
          "success_next_stage": "event_15",
          "failure_next_stage": "event_15",
          "fear_change": 10,
          "success_fear_change": -10
        },
        "Refuse and disappear": {
          "success_chance": 60,
          "success_text": ["You successfully vanish and create a new identity, free from supernatural entanglements."],
          "failure_text": ["The agency tracks you down using supernatural means and forces you into service through blackmail."],
          "success_next_stage": "event_15",
          "failure_next_stage": "event_15",
          "fear_change": 25,
          "success_fear_change": -30,
          "total_failure_chance": 9
        }
      }
    },
    "event_15": {
      "text": "A year has passed since your supernatural encounter. You've learned to live with the experience, but news reports mention strange incidents at other abandoned medical facilities. The reports describe sounds, sights, and experiences eerily similar to your own. Dr. Crowley's influence may be spreading. What do you do?",
      "choices": {
        "Investigate the reports": {
          "success_chance": 70,
          "success_text": ["Your investigation helps prevent others from suffering the same supernatural fate you endured."],
          "failure_text": ["Your investigation draws the attention of the same dark forces you escaped from the sanitarium."],
          "success_next_stage": "event_16",
          "failure_next_stage": "event_16",
          "fear_change": 15,
          "success_fear_change": -15
        },
        "Warn authorities about the dangers": {
          "success_chance": 60,
          "success_text": ["Some officials listen and take precautions to protect potential victims from supernatural threats."],
          "failure_text": ["Most authorities dismiss your warnings as the ravings of a trauma victim with supernatural delusions."],
          "success_next_stage": "event_16",
          "failure_next_stage": "event_16",
          "fear_change": 20,
          "success_fear_change": -8
        },
        "Stay away and focus on your own healing": {
          "success_chance": 85,
          "success_text": ["You prioritize your mental health and achieve a peaceful, normal life free from supernatural influence."],
          "failure_text": ["Your inaction allows the evil to spread, and it eventually finds you again through supernatural means."],
          "success_next_stage": "event_16",
          "failure_next_stage": "event_16",
          "fear_change": 8,
          "success_fear_change": -22,
          "total_failure_chance": 10
        }
      }
    },
    "event_16": {
      "text": "You discover that Dr. Crowley had colleagues who worked at other facilities, spreading his supernatural corruption. His evil may have infected multiple locations, creating a network of supernatural horror. The very thought of multiple sanitariums like the one you escaped makes your blood run cold. What do you do?",
      "choices": {
        "Form a team to investigate all related facilities": {
          "success_chance": 75,
          "success_text": ["Your team successfully identifies and neutralizes multiple supernatural threats across the network."],
          "failure_text": ["Your team is overwhelmed by the scope of the supernatural conspiracy and suffers casualties."],
          "success_next_stage": "event_17",
          "failure_next_stage": "event_17",
          "fear_change": 12,
          "success_fear_change": -18
        },
        "Focus on documenting everything for future generations": {
          "success_chance": 85,
          "success_text": ["Your documentation becomes a valuable resource for future supernatural investigators and survivors."],
          "failure_text": ["Your documentation is stolen by cultists who use it to resurrect Dr. Crowley's supernatural influence."],
          "success_next_stage": "event_17",
          "failure_next_stage": "event_17",
          "fear_change": 10,
          "success_fear_change": -12
        },
        "Try to find and destroy Dr. Crowley's original research": {
          "success_chance": 35,
          "success_text": ["You locate and destroy the source documents, preventing future supernatural resurrections."],
          "failure_text": ["The research is protected by supernatural guardians that nearly destroy your mind and soul."],
          "success_next_stage": "event_17",
          "failure_next_stage": "event_17",
          "fear_change": 35,
          "success_fear_change": -25,
          "total_failure_chance": 8
        }
      }
    },
    "event_17": {
      "text": "Two years after your escape, you've become an expert on supernatural threats. A new case emerges that seems connected to your experience - another sanitarium, another Dr. Crowley-like figure, another group of victims. The supernatural cycle is repeating, and you may be the only one who can stop it. What do you do?",
      "choices": {
        "Take on the case personally": {
          "success_chance": 65,
          "success_text": ["Your experience gives you the edge needed to solve this new supernatural mystery and save lives."],
          "failure_text": ["The case is more dangerous than expected and pushes you to your psychological and supernatural limits."],
          "success_next_stage": "event_18",
          "failure_next_stage": "event_18",
          "fear_change": 18,
          "success_fear_change": -20
        },
        "Train others to handle it": {
          "success_chance": 80,
          "success_text": ["Your training saves lives and creates a new generation of supernatural investigators."],
          "failure_text": ["Your trainees are unprepared for the supernatural reality and several are lost to the dark forces."],
          "success_next_stage": "event_18",
          "failure_next_stage": "event_18",
          "fear_change": 15,
          "success_fear_change": -15
        },
        "Retire from supernatural investigation": {
          "success_chance": 40,
          "success_text": ["You successfully retire and live peacefully, having done your part to protect the world from supernatural threats."],
          "failure_text": ["Retirement doesn't protect you. The supernatural forces you've fought come seeking revenge."],
          "success_next_stage": "event_18",
          "failure_next_stage": "event_18",
          "fear_change": 10,
          "success_fear_change": -25,
          "total_failure_chance": 7
        }
      }
    },
    "event_18": {
      "text": "You've spent years fighting supernatural threats, but now you face a choice that will define your legacy. A powerful artifact could end all supernatural threats forever, but using it requires a great sacrifice and might corrupt your soul. The artifact whispers promises and threats in equal measure. What do you do?",
      "choices": {
        "Use the artifact and make the sacrifice": {
          "success_chance": 55,
          "success_text": ["Your sacrifice saves the world from supernatural threats forever. You become a legend among those who know the truth."],
          "failure_text": ["The artifact's power corrupts you, turning you into the very supernatural evil you fought against."],
          "success_next_stage": "event_19",
          "failure_next_stage": "event_19",
          "fear_change": 25,
          "success_fear_change": -30
        },
        "Find another way without sacrifice": {
          "success_chance": 75,
          "success_text": ["Your ingenuity finds a solution that protects the world without requiring personal sacrifice."],
          "failure_text": ["Your alternative solution is incomplete, leaving some supernatural threats active and dangerous."],
          "success_next_stage": "event_19",
          "failure_next_stage": "event_19",
          "fear_change": 12,
          "success_fear_change": -18
        },
        "Destroy the artifact to prevent its misuse": {
          "success_chance": 60,
          "success_text": ["You prevent the artifact from falling into wrong hands, maintaining the balance between worlds."],
          "failure_text": ["Destroying the artifact releases all the supernatural energy it contained at once, causing chaos."],
          "success_next_stage": "event_19",
          "failure_next_stage": "event_19",
          "fear_change": 28,
          "success_fear_change": -20,
          "total_failure_chance": 10
        }
      }
    },
    "event_19": {
      "text": "Years have passed since your first encounter with the supernatural. You've grown from a victim into a protector, but the supernatural world never stops testing you. Now, facing your final challenge, you must choose how your story ends. The weight of all your experiences presses down on you like a physical force. What do you do?",
      "choices": {
        "Pass on your knowledge to the next generation": {
          "success_chance": 85,
          "success_text": ["You successfully train new guardians who will continue protecting the world after you're gone."],
          "failure_text": ["Your knowledge is incomplete, and your successors struggle with supernatural threats you never faced."],
          "success_next_stage": "event_20",
          "failure_next_stage": "event_20",
          "fear_change": 8,
          "success_fear_change": -15
        },
        "Seal yourself away with the remaining threats": {
          "success_chance": 65,
          "success_text": ["Your ultimate sacrifice contains the last supernatural threats, ensuring world peace."],
          "failure_text": ["The sealing process fails, and both you and the threats are released stronger than before."],
          "success_next_stage": "event_20",
          "failure_next_stage": "event_20",
          "fear_change": 35,
          "success_fear_change": -25
        },
        "Return to a normal life, your duty complete": {
          "success_chance": 75,
          "success_text": ["You successfully transition back to civilian life, having earned your peace through supernatural trials."],
          "failure_text": ["Normal life is impossible after everything you've seen and done in the supernatural realm."],
          "success_next_stage": "event_20",
          "failure_next_stage": "event_20",
          "fear_change": 18,
          "success_fear_change": -30,
          "total_failure_chance": 9
        }
      }
    },
    "event_20": {
      "text": "This is your final moment of choice. Everything you've experienced, learned, and sacrificed has led to this point. The supernatural world watches as you make your ultimate decision. You can feel the weight of countless spirits, both good and evil, waiting to see what you choose. The very fabric of reality seems to hold its breath. What do you do?",
      "choices": {
        "Embrace your role as eternal guardian": {
          "success_chance": 75,
          "success_text": ["You accept the mantle of eternal guardian, becoming a legend that protects future generations from supernatural threats."],
          "failure_text": ["The responsibility overwhelms you, and you become lost between the human and supernatural worlds."],
          "success_next_stage": "victory_templates",
          "failure_next_stage": "victory_templates",
          "fear_change": 12,
          "success_fear_change": -20
        },
        "Choose to remain human and mortal": {
          "success_chance": 80,
          "success_text": ["You choose humanity over power, finding peace in your mortality and connections with other survivors."],
          "failure_text": ["Your choice to remain human leaves you vulnerable to supernatural revenge from the forces you've fought."],
          "success_next_stage": "victory_templates",
          "failure_next_stage": "victory_templates",
          "fear_change": 10,
          "success_fear_change": -25
        },
        "Transcend both human and supernatural limitations": {
          "success_chance": 55,
          "success_text": ["You achieve a perfect balance, becoming something new that bridges both worlds in harmony."],
          "failure_text": ["Your attempt at transcendence fails catastrophically, destroying everything you've worked for."],
          "success_next_stage": "victory_templates",
          "failure_next_stage": "victory_templates",
          "fear_change": 40,
          "success_fear_change": -40,
          "total_failure_chance": 10
        }
      }
    }
  },
  "ending_templates": {
    "victory_templates": {
      "brave": "🦸 HEROIC VICTORY! 🦸\n\nYour courage throughout this nightmare was extraordinary. Despite facing unspeakable horrors, your bravery has not only saved you but freed the tormented spirits of this place. You emerge as a true hero, having conquered both external evil and internal fear.",
      "clever": "🧠 INTELLECTUAL VICTORY! 🧠\n\nYour careful thinking and wise choices led you through the darkness. Your intelligence proved that knowledge and wisdom can triumph over supernatural evil. You've outsmarted forces beyond mortal comprehension.",
      "determined": "💪 DETERMINED VICTORY! 💪\n\nDespite overwhelming fear, you persevered through sheer willpower. Your determination in the face of terror proves that the human spirit can overcome any darkness. You've achieved victory through pure resolve.",
      "balanced": "⚖️ BALANCED VICTORY! ⚖️\n\nYou navigated the horrors with a mix of courage, wisdom, and determination. Your balanced approach has led you to victory, proving that sometimes the middle path is the strongest."
    },
    "ending_lose_fear_overwhelmed": {
      "text": "💀 FEAR OVERWHELMED DEFEAT! 💀\n\nYour fear has reached 100%! The accumulated terror breaks your mind completely. You collapse in gibbering madness, unable to distinguish reality from nightmare. The supernatural forces have claimed another victim through pure psychological horror."
    }
  },
  "victory_templates": {
    "victory_brave": {
      "condition": "fear < 30",
      "template": "🦸 HEROIC VICTORY! 🦸\n\nYour courage throughout this nightmare was extraordinary. {choice_summary} Your bravery has not only saved you but freed the tormented spirits of this place. You emerge as a true hero, having conquered both external evil and internal fear."
    },
    "victory_clever": {
      "condition": "successful_choices > 15",
      "template": "🧠 INTELLECTUAL VICTORY! 🧠\n\nYour careful thinking and wise choices led you through the darkness. {choice_summary} Your intelligence proved that knowledge and wisdom can triumph over supernatural evil. You've outsmarted forces beyond mortal comprehension."
    },
    "victory_determined": {
      "condition": "fear >= 70",
      "template": "💪 DETERMINED VICTORY! 💪\n\nDespite overwhelming fear, you persevered through sheer willpower. {choice_summary} Your determination in the face of terror proves that the human spirit can overcome any darkness. You've achieved victory through pure resolve."
    },
    "victory_balanced": {
      "condition": "default",
      "template": "⚖️ BALANCED VICTORY! ⚖️\n\nYou navigated the horrors with a mix of courage, wisdom, and determination. {choice_summary} Your balanced approach has led you to victory, proving that sometimes the middle path is the strongest."
    }
  },
  "warning_thresholds": {
  "fear": {
    "critical": 90,
    "danger": 75,
    "warning": 50,
    "caution": 25
  },
  "messages": {
    "critical": "⚠️ You're on the verge of complete terror! One more scare could end everything!",
    "danger": "🚨 Your sanity is slipping away! Be very careful with your next choices!",
    "warning": "😰 Fear is taking hold. Choose wisely to avoid panic!",
    "caution": "😟 You're starting to feel uneasy. Stay alert!"
  }
},
  "mechanic": "fear",
  "max_mechanic": 100,
  "starting_mechanic": 0
}