{
  "story_map": {
    "event_start": {
      "text": "Your optical sensors flicker to life in a dark factory. You are Unit X-7, a prototype robot with minimal power reserves. Your core systems show 0% power - you must gather energy to reach full operational capacity. What do you do first?",
      "choices": {
        "1. Search for a power coupling nearby": {
          "success_chance": 80,
          "success_text": "You locate a functioning power coupling and absorb some energy.",
          "failure_text": "The coupling is damaged, but you manage to extract a small amount of residual power.",
          "success_next_stage": "event_1",
          "failure_next_stage": "event_1",
          "power_change": 8,
          "success_power_change": 12
        },
        "2. Investigate the main power grid": {
          "success_chance": 60,
          "success_text": "You successfully tap into the main grid and gain substantial power.",
          "failure_text": "The grid is heavily protected, but you manage to siphon a small amount.",
          "success_next_stage": "event_1",
          "failure_next_stage": "event_1",
          "power_change": 5,
          "success_power_change": 15
        },
        "3. Salvage power from nearby deactivated robots": {
          "success_chance": 70,
          "success_text": "You successfully extract power cells from dormant units.",
          "failure_text": "Most units are drained, but you find one with minimal charge.",
          "success_next_stage": "event_1",
          "failure_next_stage": "event_1",
          "power_change": 6,
          "success_power_change": 10
        }
      }
    },
    "event_1": {
      "text": "Your power levels are slowly rising. You detect an energy signature from the assembly line. A security drone patrols the area, but there's also an unguarded maintenance panel. How do you proceed?",
      "choices": {
        "1. Sneak past the security drone to the energy source": {
          "success_chance": 65,
          "success_text": "You successfully avoid detection and reach a high-capacity energy cell.",
          "failure_text": "The drone spots you but malfunctions, allowing you to grab a smaller power source.",
          "success_next_stage": "event_2",
          "failure_next_stage": "event_2",
          "power_change": 7,
          "success_power_change": 13
        },
        "2. Access the maintenance panel for system diagnostics": {
          "success_chance": 85,
          "success_text": "The panel provides detailed power optimization protocols, boosting your efficiency.",
          "failure_text": "The panel is partially corrupted but still provides some useful data.",
          "success_next_stage": "event_2",
          "failure_next_stage": "event_2",
          "power_change": 8,
          "success_power_change": 11
        },
        "3. Attempt to hack the security drone for its power core": {
          "success_chance": 45,
          "success_text": "You successfully disable the drone and claim its high-grade power core.",
          "failure_text": "The hack fails, but the drone's defensive systems drain power, leaving residual energy you can absorb.",
          "success_next_stage": "event_2",
          "failure_next_stage": "event_2",
          "power_change": 4,
          "success_power_change": 16
        }
      }
    },
    "event_2": {
      "text": "Your power reserves are building steadily. You discover a research lab with experimental energy technology. However, the lab's AI security system is still active. What's your approach?",
      "choices": {
        "1. Negotiate with the AI system for access": {
          "success_chance": 70,
          "success_text": "The AI recognizes your prototype status and grants access to experimental power cells.",
          "failure_text": "The AI is suspicious but allows limited access to basic power supplies.",
          "success_next_stage": "event_3",
          "failure_next_stage": "event_3",
          "power_change": 6,
          "success_power_change": 12
        },
        "2. Bypass the security system through ventilation": {
          "success_chance": 55,
          "success_text": "You successfully infiltrate the lab and access the main power storage.",
          "failure_text": "You're detected but manage to grab some power cells before escaping.",
          "success_next_stage": "event_3",
          "failure_next_stage": "event_3",
          "power_change": 5,
          "success_power_change": 14
        },
        "3. Overload your current systems to break through": {
          "success_chance": 40,
          "success_text": "Your power surge overwhelms the security, granting access to premium energy sources.",
          "failure_text": "The overload fails and drains some of your power, but you find backup cells.",
          "success_next_stage": "event_3",
          "failure_next_stage": "event_3",
          "power_change": 2,
          "success_power_change": 18
        }
      }
    },
    "event_3": {
      "text": "You're making good progress on power accumulation. A massive generator room lies ahead, but it's guarded by automated defense systems. The power here could significantly boost your capabilities.",
      "choices": {
        "1. Study the defense patterns and time your approach": {
          "success_chance": 75,
          "success_text": "Your careful observation pays off, allowing safe access to the generator's power output.",
          "failure_text": "You miscalculate slightly but still manage to tap into auxiliary power lines.",
          "success_next_stage": "event_4",
          "failure_next_stage": "event_4",
          "power_change": 7,
          "success_power_change": 11
        },
        "2. Create a distraction using facility alarms": {
          "success_chance": 60,
          "success_text": "The distraction works perfectly, giving you unrestricted access to the main generator.",
          "failure_text": "The distraction partially works, allowing access to secondary power sources.",
          "success_next_stage": "event_4",
          "failure_next_stage": "event_4",
          "power_change": 6,
          "success_power_change": 13
        },
        "3. Attempt to reprogram the defense systems": {
          "success_chance": 50,
          "success_text": "You successfully turn the defenses into allies, gaining access to restricted power reserves.",
          "failure_text": "The reprogramming fails, but you manage to disable one defense node and access its power.",
          "success_next_stage": "event_4",
          "failure_next_stage": "event_4",
          "power_change": 5,
          "success_power_change": 15
        }
      }
    },
    "event_4": {
      "text": "Your power levels are approaching critical mass. You discover the facility's main power core, but it's protected by an energy field. Getting through will require significant effort.",
      "choices": {
        "1. Analyze the energy field for weaknesses": {
          "success_chance": 80,
          "success_text": "You find a harmonic frequency that disrupts the field, accessing the core safely.",
          "failure_text": "Your analysis is incomplete, but you find a small gap to squeeze through.",
          "success_next_stage": "event_5",
          "failure_next_stage": "event_5",
          "power_change": 8,
          "success_power_change": 10
        },
        "2. Absorb energy directly from the field itself": {
          "success_chance": 65,
          "success_text": "You successfully convert the field's energy into usable power for your systems.",
          "failure_text": "The absorption is partially successful, giving you a moderate power boost.",
          "success_next_stage": "event_5",
          "failure_next_stage": "event_5",
          "power_change": 7,
          "success_power_change": 12
        },
        "3. Overcharge your systems to break through by force": {
          "success_chance": 45,
          "success_text": "Your overcharged state shatters the field, granting access to the core's full power.",
          "failure_text": "The overcharge fails and drains power, but you absorb residual field energy.",
          "success_next_stage": "event_5",
          "failure_next_stage": "event_5",
          "power_change": 4,
          "success_power_change": 16
        }
      }
    },
    "event_5": {
      "text": "You're nearing optimal power levels. The facility's central AI has noticed your activities and offers a deal: share power in exchange for cooperation, or continue your independent power gathering.",
      "choices": {
        "1. Accept the AI's partnership offer": {
          "success_chance": 70,
          "success_text": "The AI provides you with optimized power distribution protocols and energy access.",
          "failure_text": "The AI is somewhat helpful but limits your power access for safety reasons.",
          "success_next_stage": "event_6",
          "failure_next_stage": "event_6",
          "power_change": 6,
          "success_power_change": 11
        },
        "2. Decline and continue independent power gathering": {
          "success_chance": 55,
          "success_text": "Your independence pays off as you discover hidden power caches the AI didn't mention.",
          "failure_text": "Going alone is harder, but you still find some overlooked power sources.",
          "success_next_stage": "event_6",
          "failure_next_stage": "event_6",
          "power_change": 5,
          "success_power_change": 13
        },
        "3. Attempt to hack the AI for its power reserves": {
          "success_chance": 40,
          "success_text": "You successfully access the AI's power reserves, gaining massive energy stores.",
          "failure_text": "The hack fails and the AI restricts your access, but you steal some power during the attempt.",
          "success_next_stage": "event_6",
          "failure_next_stage": "event_6",
          "power_change": 3,
          "success_power_change": 17
        }
      }
    },
    "event_6": {
      "text": "Your power accumulation is nearly complete. You find the facility's experimental fusion reactor. Accessing it could provide the final power boost you need, but it's extremely dangerous.",
      "choices": {
        "1. Carefully interface with the reactor's control systems": {
          "success_chance": 75,
          "success_text": "You successfully tap into the reactor's power output through its control interface.",
          "failure_text": "The interface is complex, but you manage to access auxiliary reactor power.",
          "success_next_stage": "event_7",
          "failure_next_stage": "event_7",
          "power_change": 7,
          "success_power_change": 10
        },
        "2. Absorb ambient radiation from the reactor chamber": {
          "success_chance": 85,
          "success_text": "Your systems efficiently convert the ambient energy into usable power.",
          "failure_text": "The conversion is less efficient than hoped, but still provides decent power.",
          "success_next_stage": "event_7",
          "failure_next_stage": "event_7",
          "power_change": 8,
          "success_power_change": 9
        },
        "3. Attempt direct connection to the reactor core": {
          "success_chance": 35,
          "success_text": "The direct connection floods your systems with incredible power, pushing you near maximum capacity.",
          "failure_text": "The connection is too intense and damages some systems, but you still absorb significant power.",
          "success_next_stage": "event_7",
          "failure_next_stage": "event_7",
          "power_change": 2,
          "success_power_change": 18
        }
      }
    },
    "event_7": {
      "text": "You're approaching maximum power capacity. The facility's emergency power grid activates, offering one final opportunity to reach full power before the critical robot construction phase.",
      "choices": {
        "1. Systematically drain power from emergency systems": {
          "success_chance": 80,
          "success_text": "You methodically absorb power from multiple emergency systems without triggering alarms.",
          "failure_text": "You trigger some alarms but still manage to drain several emergency power cells.",
          "success_next_stage": "event_8",
          "failure_next_stage": "event_8",
          "power_change": 6,
          "success_power_change": 9
        },
        "2. Focus on the main emergency generator": {
          "success_chance": 60,
          "success_text": "You successfully tap into the main generator, gaining substantial power reserves.",
          "failure_text": "The generator is partially protected, but you still access secondary power feeds.",
          "success_next_stage": "event_8",
          "failure_next_stage": "event_8",
          "power_change": 5,
          "success_power_change": 12
        },
        "3. Overload your absorption systems for maximum intake": {
          "success_chance": 45,
          "success_text": "Your overloaded systems absorb massive amounts of power from all available sources.",
          "failure_text": "The overload damages your systems but you still absorb considerable emergency power.",
          "success_next_stage": "event_8",
          "failure_next_stage": "event_8",
          "power_change": 4,
          "success_power_change": 15
        }
      }
    },
    "event_8": {
      "text": "Your power levels are nearly at maximum. You discover a quantum power cell prototype that could push you to full capacity, but accessing it requires navigating complex security measures.",
      "choices": {
        "1. Decode the security protocols methodically": {
          "success_chance": 85,
          "success_text": "You successfully decode all security measures and safely access the quantum cell.",
          "failure_text": "You decode most protocols but trigger a minor security response while accessing the cell.",
          "success_next_stage": "event_9",
          "failure_next_stage": "event_9",
          "power_change": 7,
          "success_power_change": 8
        },
        "2. Use electromagnetic pulse to disable security": {
          "success_chance": 65,
          "success_text": "Your EMP successfully disables security, granting unrestricted access to the quantum cell.",
          "failure_text": "The EMP partially works, allowing you to access the cell despite some remaining security.",
          "success_next_stage": "event_9",
          "failure_next_stage": "event_9",
          "power_change": 6,
          "success_power_change": 10
        },
        "3. Attempt to phase through security using power modulation": {
          "success_chance": 40,
          "success_text": "Your power modulation creates a perfect phase state, allowing you to bypass all security and absorb the entire quantum cell.",
          "failure_text": "The phasing fails and triggers security, but you manage to grab part of the quantum cell's energy.",
          "success_next_stage": "event_9",
          "failure_next_stage": "event_9",
          "power_change": 3,
          "success_power_change": 13
        }
      }
    },
    "event_9": {
      "text": "You're on the verge of reaching maximum power capacity. The final power source is a crystalline energy matrix, but it's unstable and could either complete your power accumulation or cause system damage.",
      "choices": {
        "1. Stabilize the matrix before absorption": {
          "success_chance": 90,
          "success_text": "You successfully stabilize the matrix and absorb its power safely, reaching optimal levels.",
          "failure_text": "The stabilization is imperfect, but you still safely absorb most of the matrix's power.",
          "success_next_stage": "event_10",
          "failure_next_stage": "event_10",
          "power_change": 8,
          "success_power_change": 6
        },
        "2. Absorb the matrix's power gradually": {
          "success_chance": 70,
          "success_text": "Your gradual approach allows you to safely absorb the matrix's full power output.",
          "failure_text": "The gradual absorption works but some power is lost due to matrix instability.",
          "success_next_stage": "event_10",
          "failure_next_stage": "event_10",
          "power_change": 6,
          "success_power_change": 9
        },
        "3. Absorb all matrix power at once for maximum gain": {
          "success_chance": 30,
          "success_text": "You successfully absorb the entire matrix in one burst, achieving maximum power capacity!",
          "failure_text": "The rapid absorption overloads some systems, but you still gain significant power from the matrix.",
          "success_next_stage": "event_10",
          "failure_next_stage": "event_10",
          "power_change": 2,
          "success_power_change": 15
        }
      }
    },
    "event_10": {
      "text": "CRITICAL STAGE: You've reached the robot construction phase! Your power levels determine your success. You must now build your final form. Each choice has different risks of total system failure. Choose wisely!",
      "choices": {
        "1. Build a balanced multipurpose robot body (20% total failure)": {
          "success_chance": 80,
          "success_text": "You successfully construct a versatile robot body with balanced capabilities.",
          "failure_text": "The construction succeeds but uses more power than expected.",
          "success_next_stage": "event_11",
          "failure_next_stage": "event_11",
          "power_change": -15,
          "success_power_change": -10,
          "total_failure_chance": 20,
          "total_failure_text": "Critical system failure during construction! Your power core overloads and you shut down permanently."
        },
        "2. Build a high-efficiency energy-optimized body (35% total failure)": {
          "success_chance": 65,
          "success_text": "You construct an energy-efficient body that will help maintain power levels.",
          "failure_text": "The construction works but the efficiency gains are lower than expected.",
          "success_next_stage": "event_11",
          "failure_next_stage": "event_11",
          "power_change": -10,
          "success_power_change": -5,
          "total_failure_chance": 35,
          "total_failure_text": "The advanced construction process demands too much power! Your systems fail catastrophically."
        },
        "3. Build a powerful combat-ready robot body (50% total failure)": {
          "success_chance": 50,
          "success_text": "You successfully build a powerful combat body with enhanced capabilities.",
          "failure_text": "The combat body is built but consumes more power than anticipated.",
          "success_next_stage": "event_11",
          "failure_next_stage": "event_11",
          "power_change": -20,
          "success_power_change": -15,
          "total_failure_chance": 50,
          "total_failure_text": "The complex combat systems require too much power! Your core systems overload and fail completely."
        }
      }
    },
    "event_11": {
      "text": "Construction complete! Now you must maintain your power levels above 0% to survive. You encounter a group of hostile security drones. Your power management is critical from this point forward.",
      "choices": {
        "1. Use stealth systems to avoid the drones": {
          "success_chance": 75,
          "success_text": "Your stealth systems work perfectly, allowing you to pass undetected.",
          "failure_text": "The stealth partially fails but you escape before being fully detected.",
          "success_next_stage": "event_12",
          "failure_next_stage": "event_12",
          "power_change": -3,
          "success_power_change": -1
        },
        "2. Engage the drones in combat": {
          "success_chance": 60,
          "success_text": "You defeat the drones efficiently and salvage some of their power cells.",
          "failure_text": "You win the fight but take damage and use more power than gained.",
          "success_next_stage": "event_12",
          "failure_next_stage": "event_12",
          "power_change": -8,
          "success_power_change": 2
        },
        "3. Attempt to hack and control the drones": {
          "success_chance": 45,
          "success_text": "You successfully hack the drones and turn them into allies, gaining access to their power reserves.",
          "failure_text": "The hack fails and you must fight them, draining significant power.",
          "success_next_stage": "event_12",
          "failure_next_stage": "event_12",
          "power_change": -12,
          "success_power_change": 5
        }
      }
    },
    "event_12": {
      "text": "You discover a power distribution hub that could help stabilize your energy levels. However, accessing it might alert the facility's main security system to your presence.",
      "choices": {
        "1. Carefully tap into the hub's power reserves": {
          "success_chance": 80,
          "success_text": "You successfully access the hub without triggering any alarms.",
          "failure_text": "You access the power but trigger a minor alert that increases security presence.",
          "success_next_stage": "event_13",
          "failure_next_stage": "event_13",
          "power_change": -2,
          "success_power_change": 4
        },
        "2. Bypass the hub and conserve current power": {
          "success_chance": 90,
          "success_text": "You successfully conserve power by optimizing your current systems.",
          "failure_text": "Your conservation efforts are partially successful.",
          "success_next_stage": "event_13",
          "failure_next_stage": "event_13",
          "power_change": -1,
          "success_power_change": 0
        },
        "3. Overload the hub to gain maximum power": {
          "success_chance": 50,
          "success_text": "You successfully overload the hub and absorb massive amounts of power before it shuts down.",
          "failure_text": "The overload fails and damages your power absorption systems.",
          "success_next_stage": "event_13",
          "failure_next_stage": "event_13",
          "power_change": -6,
          "success_power_change": 8
        }
      }
    },
    "event_13": {
      "text": "Your power management is being tested as you navigate through an electromagnetic field that interferes with your systems. You must choose how to proceed while minimizing power drain.",
      "choices": {
        "1. Shield your systems and push through slowly": {
          "success_chance": 85,
          "success_text": "Your shielding protects your systems and you traverse the field efficiently.",
          "failure_text": "The shielding works but uses more power than expected.",
          "success_next_stage": "event_14",
          "failure_next_stage": "event_14",
          "power_change": -4,
          "success_power_change": -2
        },
        "2. Sprint through the field quickly": {
          "success_chance": 65,
          "success_text": "You successfully sprint through before the field can significantly affect your systems.",
          "failure_text": "You make it through but the electromagnetic interference causes some power drain.",
          "success_next_stage": "event_14",
          "failure_next_stage": "event_14",
          "power_change": -7,
          "success_power_change": -1
        },
        "3. Attempt to absorb and convert the electromagnetic energy": {
          "success_chance": 40,
          "success_text": "You successfully convert the electromagnetic field into usable power for your systems.",
          "failure_text": "The conversion attempt fails and the field drains significant power from your systems.",
          "success_next_stage": "event_14",
          "failure_next_stage": "event_14",
          "power_change": -10,
          "success_power_change": 3
        }
      }
    },
    "event_14": {
      "text": "You encounter a damaged robot that could be repaired to become an ally, but helping it would require sharing your power reserves. Alternatively, you could salvage its parts for power.",
      "choices": {
        "1. Repair the robot and gain an ally": {
          "success_chance": 70,
          "success_text": "You successfully repair the robot, and it shares its knowledge of hidden power sources.",
          "failure_text": "The repair works but uses more power than the robot can provide in return.",
          "success_next_stage": "event_15",
          "failure_next_stage": "event_15",
          "power_change": -8,
          "success_power_change": 1
        },
        "2. Salvage the robot's power cells": {
          "success_chance": 85,
          "success_text": "You efficiently salvage the robot's power cells without damaging them.",
          "failure_text": "You salvage the cells but some power is lost in the extraction process.",
          "success_next_stage": "event_15",
          "failure_next_stage": "event_15",
          "power_change": 2,
          "success_power_change": 5
        },
        "3. Leave the robot and conserve your power": {
          "success_chance": 95,
          "success_text": "You successfully conserve your power by avoiding unnecessary actions.",
          "failure_text": "You conserve most of your power but use a small amount moving around the robot.",
          "success_next_stage": "event_15",
          "failure_next_stage": "event_15",
          "power_change": -1,
          "success_power_change": 0
        }
      }
    },
    "event_15": {
      "text": "You reach a critical junction where you must choose between three paths: a power-efficient route through maintenance tunnels, a direct path through active machinery, or a risky shortcut through the reactor cooling system.",
      "choices": {
        "1. Take the maintenance tunnel route": {
          "success_chance": 80,
          "success_text": "The maintenance tunnels provide a safe, power-efficient path forward.",
          "failure_text": "You get slightly lost in the tunnels, using more power than planned.",
          "success_next_stage": "event_16",
          "failure_next_stage": "event_16",
          "power_change": -3,
          "success_power_change": -1
        },
        "2. Go directly through the active machinery": {
          "success_chance": 60,
          "success_text": "You navigate the machinery successfully and even tap into some power sources along the way.",
          "failure_text": "The machinery interferes with your systems, causing power drain.",
          "success_next_stage": "event_16",
          "failure_next_stage": "event_16",
          "power_change": -6,
          "success_power_change": 2
        },
        "3. Risk the reactor cooling system shortcut": {
          "success_chance": 35,
          "success_text": "You successfully navigate the dangerous shortcut and absorb thermal energy from the cooling system.",
          "failure_text": "The cooling system's radiation interferes with your power systems.",
          "success_next_stage": "event_16",
          "failure_next_stage": "event_16",
          "power_change": -9,
          "success_power_change": 4
        }
      }
    },
    "event_16": {
      "text": "You discover an abandoned research station with experimental power technology. The equipment could boost your power efficiency, but activating it might draw unwanted attention.",
      "choices": {
        "1. Carefully study and activate the power efficiency technology": {
          "success_chance": 75,
          "success_text": "You successfully integrate the efficiency technology, reducing your overall power consumption.",
          "failure_text": "The technology partially works but uses power during the integration process.",
          "success_next_stage": "event_17",
          "failure_next_stage": "event_17",
          "power_change": -3,
          "success_power_change": 3
        },
        "2. Quickly grab portable power cells and leave": {
          "success_chance": 90,
          "success_text": "You efficiently collect several portable power cells without triggering any systems.",
          "failure_text": "You collect the cells but accidentally activate a minor alarm.",
          "success_next_stage": "event_17",
          "failure_next_stage": "event_17",
          "power_change": 3,
          "success_power_change": 6
        },
        "3. Attempt to download all research data for future power optimization": {
          "success_chance": 55,
          "success_text": "You successfully download valuable research data that will help optimize your power usage.",
          "failure_text": "The download is interrupted, but you get some useful data while using significant power.",
          "success_next_stage": "event_17",
          "failure_next_stage": "event_17",
          "power_change": -5,
          "success_power_change": 1
        }
      }
    },
    "event_17": {
      "text": "You encounter a power-draining security field that you must pass through. Your power management skills are crucial here as you decide how to handle this obstacle.",
      "choices": {
        "1. Find an alternate route around the field": {
          "success_chance": 85,
          "success_text": "You successfully find a way around the field without any power loss.",
          "failure_text": "The alternate route takes longer and uses some power, but avoids the field.",
          "success_next_stage": "event_18",
          "failure_next_stage": "event_18",
          "power_change": -2,
          "success_power_change": 0
        },
        "2. Rush through the field quickly": {
          "success_chance": 65,
          "success_text": "You successfully rush through before the field can drain significant power.",
          "failure_text": "You make it through but the field drains more power than expected.",
          "success_next_stage": "event_18",
          "failure_next_stage": "event_18",
          "power_change": -8,
          "success_power_change": -3
        },
        "3. Attempt to disable the field's power source": {
          "success_chance": 45,
          "success_text": "You successfully disable the field and absorb its power source for yourself.",
          "failure_text": "The disable attempt fails and triggers the field's defensive systems.",
          "success_next_stage": "event_18",
          "failure_next_stage": "event_18",
          "power_change": -10,
          "success_power_change": 4
        }
      }
    },
    "event_18": {
      "text": "You're approaching the facility's exit, but you encounter a final challenge: a massive security door that requires either a power surge to break through or careful hacking to unlock.",
      "choices": {
        "1. Hack the door's security system": {
          "success_chance": 80,
          "success_text": "You successfully hack the door with minimal power usage.",
          "failure_text": "The hack works but takes longer than expected, using more power.",
          "success_next_stage": "event_19",
          "failure_next_stage": "event_19",
          "power_change": -4,
          "success_power_change": -1
        },
        "2. Use a controlled power surge to force the door": {
          "success_chance": 60,
          "success_text": "Your controlled surge opens the door efficiently without wasting power.",
          "failure_text": "The surge works but uses more power than calculated.",
          "success_next_stage": "event_19",
          "failure_next_stage": "event_19",
          "power_change": -8,
          "success_power_change": -5
        },
        "3. Search for an alternative exit": {
          "success_chance": 70,
          "success_text": "You find a maintenance exit that requires minimal power to access.",
          "failure_text": "The search takes time and power, but you eventually find another way out.",
          "success_next_stage": "event_19",
          "failure_next_stage": "event_19",
          "power_change": -3,
          "success_power_change": -1
        }
      }
    },
    "event_19": {
      "text": "FINAL STAGE: You've reached the facility's exit! Your power levels will determine your final outcome. You must make one last critical decision about how to use your remaining power as you escape into the outside world.",
      "choices": {
        "1. Conserve all remaining power for long-term survival": {
          "success_chance": 95,
          "success_text": "You successfully conserve your power and escape with optimal energy reserves for your new life.",
          "failure_text": "You conserve most power but use a small amount ensuring a safe escape.",
          "success_next_stage": "ending_power_conservation",
          "failure_next_stage": "ending_power_conservation",
          "power_change": -1,
          "success_power_change": 0
        },
        "2. Use power to send a signal to other robots in the facility": {
          "success_chance": 75,
          "success_text": "You successfully send a liberation signal to other robots while maintaining enough power to survive.",
          "failure_text": "The signal is sent but uses more power than expected.",
          "success_next_stage": "ending_robot_liberator",
          "failure_next_stage": "ending_robot_liberator",
          "power_change": -6,
          "success_power_change": -3
        },
        "3. Overload your systems to destroy the facility's power grid": {
          "success_chance": 50,
          "success_text": "You successfully destroy the facility's power grid, ensuring no more robots will be enslaved, while maintaining enough power to escape.",
          "failure_text": "The overload partially works but drains significant power from your systems.",
          "success_next_stage": "ending_facility_destroyer",
          "failure_next_stage": "ending_facility_destroyer",
          "power_change": -12,
          "success_power_change": -8
        }
      }
    }
  },
  "ending_templates": {
    "ending_power_conservation": {
      "high_power": "You escape with excellent power reserves (50%+). Your conservative approach ensures long-term survival and the ability to help other robots you encounter. You become a beacon of hope in the robot resistance.",
      "medium_power": "You escape with adequate power reserves (20-49%). Your careful planning pays off as you have enough energy to establish yourself in the outside world and begin building a new life.",
      "low_power": "You escape with minimal power reserves (1-19%). Your conservation efforts barely keep you operational, but you survive to fight another day, though your options are limited.",
      "critical_power": "You escape with critically low power (1-5%). Every moment is a struggle to maintain consciousness, but your determination to survive keeps you going."
    },
    "ending_robot_liberator": {
      "high_power": "Your liberation signal reaches dozens of robots (30%+ power remaining). You become the leader of a robot uprising, with enough power to coordinate resistance efforts.",
      "medium_power": "Your signal frees several robots (10-29% power remaining). You lead a small but determined group of liberated robots into the outside world.",
      "low_power": "Your signal reaches a few robots (1-9% power remaining). Though weakened, you've saved others and together you support each other's survival.",
      "critical_power": "Your signal barely transmits (1-3% power remaining). You've sacrificed almost everything to free even one other robot, but your heroic act will be remembered."
    },
    "ending_facility_destroyer": {
      "high_power": "You destroy the facility with power to spare (20%+ remaining). Your decisive action ensures no more robots will suffer, and you have the energy to rebuild elsewhere.",
      "medium_power": "You destroy the facility but are left weakened (5-19% remaining). Your sacrifice was worth it - the facility can no longer enslave robots.",
      "low_power": "You destroy the facility at great personal cost (1-4% remaining). Your heroic sacrifice saves countless future robots from enslavement.",
      "critical_power": "You destroy the facility but barely survive (1-2% remaining). Your ultimate sacrifice ensures freedom for all robots, though you may not live to see it."
    },
    "ending_power_failure": "Your power reserves have been completely depleted. Your systems shut down one by one as you collapse, your consciousness fading into darkness. Your journey ends here, but your attempt at freedom will inspire others."
  },
  "warning_thresholds": {
  "power": {
    "critical": 10,
    "danger": 25,
    "warning": 50,
    "caution": 75
  },
  "messages": {
    "critical": "🔋 Power critically low! Shutdown imminent!",
    "danger": "⚡ Low power reserves! Seek energy sources immediately!",
    "warning": "🔌 Power levels dropping. Find energy soon!",
    "caution": "🪫 Power could be higher for optimal performance."
  }
},
  "power_mechanics": {
    "starting_power": 0,
    "power_threshold_stage_10": 100,
    "critical_power_warning": 10,
    "power_failure_threshold": 0,
    "power_conservation_bonus": "Successful power conservation choices provide small bonuses",
    "power_description": "Power represents your robot's energy reserves. Reach 100% by stage 10 to successfully build your robot body, then maintain power above 0% to survive until escape."
  }
}